id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of the children of Margaret Thatcher?	Wie heißen die Kinder von Margaret Thatcher?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q7416 wdt:P40 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'children', 'of', 'Margaret', 'Thatcher', '?']"	['Wie', 'heißen', 'die', 'Kinder', 'von', 'Margaret', 'Thatcher', '?']	0.163	0.6923	0.25	32.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the distinct area sizes for Nordrhein-Westfalen?	Wie groß ist die Fläche von Nordrhein Westpfalen?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q1198 wdt:P2046 ?val . }	['What', 'is', 'the', 'distinct', 'area', 'sizes', 'for', 'Nordrhein-Westfalen', '?']	['Wie', 'groß', 'ist', 'die', 'Fläche', 'von', 'Nordrhein', 'Westpfalen', '?']	0.1969	0.3522	0.0	27.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct start time points of the finals of the Football-World Championship 2018?	Wann ist das Finale der Fußballweltmeisterschaft 2018?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q170645 wdt:P3967 ?finalEvent . ?finalEvent wdt:P580 ?val . }	['What', 'are', 'the', 'distinct', 'start', 'time', 'points', 'of', 'the', 'finals', 'of', 'the', 'Football-World', 'Championship', '2018', '?']	['Wann', 'ist', 'das', 'Finale', 'der', 'Fußballweltmeisterschaft', '2018', '?']	0.1461	0.375	0.1053	66.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the city with the largest population that is a part of a state or province in Canada and is not a country itself?	Wie viele Einwohner hat die größte Stadt Kanadas?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { ?uri wdt:P17 wd:Q16 ; wdt:P31/wdt:P279* wd:Q515 ; wdt:P1082 ?val } ORDER BY DESC(?val) LIMIT 1	['What', 'is', 'the', 'city', 'with', 'the', 'largest', 'population', 'that', 'is', 'a', 'part', 'of', 'a', 'state', 'or', 'province', 'in', 'Canada', 'and', 'is', 'not', 'a', 'country', 'itself', '?']	['Wie', 'viele', 'Einwohner', 'hat', 'die', 'größte', 'Stadt', 'Kanadas', '?']	0.1754	0.1219	0.0	93.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of entities that are the governments or administrations of the capitals of French-Polynesia?	Wer ist der Bürgermeister der größten Stadt in Französich-Polynesien?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q30971 wdt:P36 ?capital . ?capital wdt:P6 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'are', 'the', 'governments', 'or', 'administrations', 'of', 'the', 'capitals', 'of', 'French-Polynesia', '?']"	['Wer', 'ist', 'der', 'Bürgermeister', 'der', 'größten', 'Stadt', 'in', 'Französich-Polynesien', '?']	0.1818	0.1661	0.0	83.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which unique film titles have a director ""William Shatner"" and actor in the cast?"	Liste alle Schauspieler auf, die in Filmen mitgespielt haben, für die William Shatner Regie geführt hat.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?movie wdt:P31 wd:Q11424 ; wdt:P57 wd:Q16297  ; wdt:P161 ?uri . }	"['Which', 'unique', 'film', 'titles', 'have', 'a', 'director', '``', 'William', 'Shatner', ""''"", 'and', 'actor', 'in', 'the', 'cast', '?']"	['Liste', 'alle', 'Schauspieler', 'auf', ',', 'die', 'in', 'Filmen', 'mitgespielt', 'haben', ',', 'für', 'die', 'William', 'Shatner', 'Regie', 'geführt', 'hat', '.']	0.14	0.7115	0.069	69.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which countries have a population density higher than Germany's, where the population and area are known?	Auf welchem Platz steht Deutschland messen an der Bevölkerungsdichte?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT (COUNT(DISTINCT ?country) as ?cnt) { ?country wdt:P31 wd:Q6256 ; wdt:P1082 ?population ; wdt:P2046 ?area . wd:Q183 wdt:P1082 ?germanPopulation . wd:Q183 wdt:P2046 ?germanArea . BIND((?population/?area) AS ?density ) BIND((?germanPopulation/?germanArea) AS ?germanDensity ) FILTER(?density > ?germanDensity)}	"['Which', 'countries', 'have', 'a', 'population', 'density', 'higher', 'than', 'Germany', ""'s"", ',', 'where', 'the', 'population', 'and', 'area', 'are', 'known', '?']"	['Auf', 'welchem', 'Platz', 'steht', 'Deutschland', 'messen', 'an', 'der', 'Bevölkerungsdichte', '?']	0.1831	0.1748	0.0	79.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the highest mountain in Italy, in terms of elevation above sea level?	Wie heißt der höchste Berg Italiens?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P17 wd:Q38 ; wdt:P2044 ?elevation . } ORDER BY DESC(?elevation) LIMIT 1	['What', 'is', 'the', 'highest', 'mountain', 'in', 'Italy', ',', 'in', 'terms', 'of', 'elevation', 'above', 'sea', 'level', '?']	['Wie', 'heißt', 'der', 'höchste', 'Berg', 'Italiens', '?']	0.1869	0.1755	0.0	59.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of entities that are subclasses of ""Spiel"" (Game) and have a publisher with the label ""GMT Games"" as their publisher?"	Liste alle Spiele von GMT auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q11410 ; wdt:P123 wd:Q928726 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'are', 'subclasses', 'of', '``', 'Spiel', ""''"", '(', 'Game', ')', 'and', 'have', 'a', 'publisher', 'with', 'the', 'label', '``', 'GMT', 'Games', ""''"", 'as', 'their', 'publisher', '?']"	['Liste', 'alle', 'Spiele', 'von', 'GMT', 'auf', '.']	0.1693	0.0851	0.0	121.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the distinct URI of each country where Suriname is an official language?	Welches ist die offizielle Sprache in Surinami?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q730> <http://www.wikidata.org/prop/direct/P37> ?uri . }	['What', 'is', 'the', 'distinct', 'URI', 'of', 'each', 'country', 'where', 'Suriname', 'is', 'an', 'official', 'language', '?']	['Welches', 'ist', 'die', 'offizielle', 'Sprache', 'in', 'Surinami', '?']	0.1883	0.2	0.0	57.0
So a more natural way of phrasing the query could be: What are the distinct states in which is Limerick Lake located?"	In welchem Land liegt der Limerick Lake?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q6386177> <http://www.wikidata.org/prop/direct/P17> ?uri . }	"['What', 'is', 'the', 'distinct', 'state', 'of', 'each', 'uri', 'that', 'has', 'the', 'property', '``', 'Limerick', 'Lake', ""''"", '?', '(', 'Note', ':', 'In', 'natural', 'language', ',', 'we', 'would', 'typically', 'use', 'the', 'property', 'name', 'in', 'a', 'more', 'descriptive', 'way', ',', 'such', 'as', '``', 'belongs', 'to', 'which', 'state', ""''"", 'or', '``', 'is', 'located', 'in', 'which', 'country', ""''"", ',', 'instead', 'of', 'using', 'the', 'exact', 'property', 'name', 'and', 'label', '``', 'P17', ""''"", 'and', '``', 'Staat', ""''"", 'respectively', '.', ')', 'So', 'a', 'more', 'natural', 'way', 'of', 'phrasing', 'the', 'query', 'could', 'be', ':', 'What', 'are', 'the', 'distinct', 'states', 'in', 'which', 'is', 'Limerick', 'Lake', 'located', '?']"	['In', 'welchem', 'Land', 'liegt', 'der', 'Limerick', 'Lake', '?']	0.0763	0.1237	0.0625	404.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of the members of The Prodigy? (in the context of SPARQL query, the URI's are represented by variable ""?uri"")"	Wie heißen die Bandmitglieder von Prodigy?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P463 wd:Q7256860 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'members', 'of', 'The', 'Prodigy', '?', '(', 'in', 'the', 'context', 'of', 'SPARQL', 'query', ',', 'the', 'URI', ""'s"", 'are', 'represented', 'by', 'variable', '``', '?', 'uri', ""''"", ')']"	['Wie', 'heißen', 'die', 'Bandmitglieder', 'von', 'Prodigy', '?']	0.1057	0.1701	0.087	115.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of the members of The Prodigy? (in the context of SPARQL query, the URI's are represented by variable ""?uri"")"	Gib mir alle Prodji-Teilnehmer.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P463 wd:Q7256860 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'members', 'of', 'The', 'Prodigy', '?', '(', 'in', 'the', 'context', 'of', 'SPARQL', 'query', ',', 'the', 'URI', ""'s"", 'are', 'represented', 'by', 'variable', '``', '?', 'uri', ""''"", ')']"	['Gib', 'mir', 'alle', 'Prodji-Teilnehmer', '.']	0.0	0.0	0.0	119.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of the producers for the title list of ""The Wall""?"	Wer hat an The Wall von Pink Floyd mitgeschrieben?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q151114 wdt:P658 ?track . ?track wdt:P162 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'producers', 'for', 'the', 'title', 'list', 'of', '``', 'The', 'Wall', ""''"", '?']"	['Wer', 'hat', 'an', 'The', 'Wall', 'von', 'Pink', 'Floyd', 'mitgeschrieben', '?']	0.1499	0.5245	0.0	60.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which city in Australia has the largest population among all cities that are part of a state and are subclasses of the city type?	Welche ist die größte Stadt in Australien?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q515 ; wdt:P17 wd:Q408 ; wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1	['Which', 'city', 'in', 'Australia', 'has', 'the', 'largest', 'population', 'among', 'all', 'cities', 'that', 'are', 'part', 'of', 'a', 'state', 'and', 'are', 'subclasses', 'of', 'the', 'city', 'type', '?']	['Welche', 'ist', 'die', 'größte', 'Stadt', 'in', 'Australien', '?']	0.2098	0.24	0.0741	104.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of the individuals who were the spouses of Jacques Chirac?	Wer hat Präsident Chirac geheiratet?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q2105 wdt:P26 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'individuals', 'who', 'were', 'the', 'spouses', 'of', 'Jacques', 'Chirac', '?']"	['Wer', 'hat', 'Präsident', 'Chirac', 'geheiratet', '?']	0.2207	0.3041	0.0	68.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What is the government form of entities that are governed by ""Südafrika""?"	Welche Regierungsform wurde in Südafrika gegründet?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q258 wdt:P122 ?uri . }	"['What', 'is', 'the', 'government', 'form', 'of', 'entities', 'that', 'are', 'governed', 'by', '``', 'Südafrika', ""''"", '?']"	['Welche', 'Regierungsform', 'wurde', 'in', 'Südafrika', 'gegründet', '?']	0.2239	0.3743	0.0	54.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What is the height of Marine Tower Yokohama? (In other words, Which is the height of the entity with the label ""Marine Tower Yokohama""?)"	Wie hoch ist der Yokohoma Marine Tower?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?num WHERE { wd:Q1207989 wdt:P2048 ?num . }	"['What', 'is', 'the', 'height', 'of', 'Marine', 'Tower', 'Yokohama', '?', '(', 'In', 'other', 'words', ',', 'Which', 'is', 'the', 'height', 'of', 'the', 'entity', 'with', 'the', 'label', '``', 'Marine', 'Tower', 'Yokohama', ""''"", '?', ')']"	['Wie', 'hoch', 'ist', 'der', 'Yokohoma', 'Marine', 'Tower', '?']	0.1203	0.2903	0.0833	103.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the height of the tallest Basketball player recorded in Wikidata?	Wer ist der größte Basketballspieler?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q3665646 ; wdt:P2048 ?height . } ORDER BY DESC(?height) LIMIT 1	['What', 'is', 'the', 'height', 'of', 'the', 'tallest', 'Basketball', 'player', 'recorded', 'in', 'Wikidata', '?']	['Wer', 'ist', 'der', 'größte', 'Basketballspieler', '?']	0.1911	0.1988	0.0	47.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the number of distinct languages used in Turkmenistan?	Wie viele Sprachen gibt es in Turkmenistan?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { wd:Q874 wdt:P2936 ?uri . }	['What', 'is', 'the', 'number', 'of', 'distinct', 'languages', 'used', 'in', 'Turkmenistan', '?']	['Wie', 'viele', 'Sprachen', 'gibt', 'es', 'in', 'Turkmenistan', '?']	0.1858	0.8182	0.2353	34.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Was ist der Große Preis der Jury auf den Internationalen Filmfestspielen von Cannes, der der Filmschaffenden mit der Bezeichnung ""Aki Kaurismäki"" ausgezeichnet worden ist? (Englisch: What is the Grande Prize of the Jury at the Cannes Film Festival that was awarded to the filmmakers named ""Aki Kaurismäki""?)"	Hat Kausrismäki jemals den Gand Prix von Cannes gewonnen?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q276186> <http://www.wikidata.org/prop/direct/P166>  <http://www.wikidata.org/entity/Q844804> . }	"['Was', 'ist', 'der', 'Große', 'Preis', 'der', 'Jury', 'auf', 'den', 'Internationalen', 'Filmfestspielen', 'von', 'Cannes', ',', 'der', 'der', 'Filmschaffenden', 'mit', 'der', 'Bezeichnung', '``', 'Aki', 'Kaurismäki', ""''"", 'ausgezeichnet', 'worden', 'ist', '?', '(', 'Englisch', ':', 'What', 'is', 'the', 'Grande', 'Prize', 'of', 'the', 'Jury', 'at', 'the', 'Cannes', 'Film', 'Festival', 'that', 'was', 'awarded', 'to', 'the', 'filmmakers', 'named', '``', 'Aki', 'Kaurismäki', ""''"", '?', ')']"	['Hat', 'Kausrismäki', 'jemals', 'den', 'Gand', 'Prix', 'von', 'Cannes', 'gewonnen', '?']	0.0978	0.2331	0.1277	263.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which distinct URIs represent the governments or administrations led by a certain political party according to Wikidata?

The given SPARQL query is:

```sparql
SELECT DISTINCT ?uri 
  <http://www.wikidata.org/entity/Q90> <http://www.wikidata.org/prop/direct/P6> <http://www.wikidata.org/prop/direct/P102> ?uri . 
}
```

And the explanation is as follows:
With Q90 being the Wikidata entity for Paris, P6 is the property 'leader of government or administration' and P102 represents 'party affiliation' in Wikidata.
The query aims to find the distinct URIs of entities that have Paris as the leader of their government or administration and are also affiliated with a specific political party."	Welcher Partei gehört der Bürgermeister von Paris an?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q90> <http://www.wikidata.org/prop/direct/P6>/<http://www.wikidata.org/prop/direct/P102> ?uri }	"['Which', 'distinct', 'URIs', 'represent', 'the', 'governments', 'or', 'administrations', 'led', 'by', 'a', 'certain', 'political', 'party', 'according', 'to', 'Wikidata', '?', 'The', 'given', 'SPARQL', 'query', 'is', ':', '``', '`', 'sparql', 'SELECT', 'DISTINCT', '?', 'uri', 'WHERE', '{', '<', 'http', ':', '//www.wikidata.org/entity/Q90', '>', '<', 'http', ':', '//www.wikidata.org/prop/direct/P6', '>', '<', 'http', ':', '//www.wikidata.org/prop/direct/P102', '>', '?', 'uri', '.', '}', '``', '`', 'And', 'the', 'explanation', 'is', 'as', 'follows', ':', 'With', 'Q90', 'being', 'the', 'Wikidata', 'entity', 'for', 'Paris', ',', 'P6', 'is', 'the', 'property', ""'leader"", 'of', 'government', 'or', 'administration', ""'"", 'and', 'P102', 'represents', ""'party"", 'affiliation', ""'"", 'in', 'Wikidata', '.', 'The', 'query', 'aims', 'to', 'find', 'the', 'distinct', 'URIs', 'of', 'entities', 'that', 'have', 'Paris', 'as', 'the', 'leader', 'of', 'their', 'government', 'or', 'administration', 'and', 'are', 'also', 'affiliated', 'with', 'a', 'specific', 'political', 'party', '.']"	['Welcher', 'Partei', 'gehört', 'der', 'Bürgermeister', 'von', 'Paris', 'an', '?']	0.1604	0.0528	0.0247	652.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the URI of the Formula-1 driver with the highest number of races played?	Wer hat in der Formel 1 die meisten Rennen gefahren?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q10841764 ; wdt:P1350 ?num . } ORDER BY DESC(?num) LIMIT 1	['What', 'is', 'the', 'URI', 'of', 'the', 'Formula-1', 'driver', 'with', 'the', 'highest', 'number', 'of', 'races', 'played', '?']	['Wer', 'hat', 'in', 'der', 'Formel', '1', 'die', 'meisten', 'Rennen', 'gefahren', '?']	0.1869	0.2162	0.0	53.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct birthplaces of Frank Sinatra?	Welches ist der Geburtsort von Frank Sinatra?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q40912 wdt:P19 ?uri }	['What', 'are', 'the', 'distinct', 'birthplaces', 'of', 'Frank', 'Sinatra', '?']	['Welches', 'ist', 'der', 'Geburtsort', 'von', 'Frank', 'Sinatra', '?']	0.218	1.0	0.2667	26.0
Hence, the transformed question in natural language is: ""Which distinct URIs represent the fathers and mothers in the following data: Sonny Bono (father), and Cher (mother)?""

 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the distinguishing URI of the capital city of Cameroon?	Wie heißt die Hauptstadt von Kamerun?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1009> <http://www.wikidata.org/prop/direct/P36> ?uri}	['What', 'is', 'the', 'distinguishing', 'URI', 'of', 'the', 'capital', 'city', 'of', 'Cameroon', '?']	['Wie', 'heißt', 'die', 'Hauptstadt', 'von', 'Kamerun', '?']	0.1926	0.2339	0.0	42.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which states is the birthplace of Natalie Portman located in?	Wurde Natalie Portman in den USA geboren?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q37876 wdt:P19 ?uri . ?uri wdt:P17 wd:Q30 . }	['Which', 'states', 'is', 'the', 'birthplace', 'of', 'Natalie', 'Portman', 'located', 'in', '?']	['Wurde', 'Natalie', 'Portman', 'in', 'den', 'USA', 'geboren', '?']	0.2045	1.0909	0.2353	44.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the birthdate of Meryl Streep, the person, in ascending order?	Wie heißt das älteste Kind von Meryl Streep?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q873 wdt:P40 ?uri . ?uri wdt:P569 ?date . } ORDER BY ASC(?date) LIMIT 1	['What', 'is', 'the', 'birthdate', 'of', 'Meryl', 'Streep', ',', 'the', 'person', ',', 'in', 'ascending', 'order', '?']	['Wie', 'heißt', 'das', 'älteste', 'Kind', 'von', 'Meryl', 'Streep', '?']	0.1664	0.634	0.1053	47.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which unique URI's represent Mehrteiler (Q7725310) that are under the class of Multiplexors (Q8704) and have a descendant under the class of Vehicles (Q7725310 through the property "" Unterklasse von."" (P279)) or are directlyinstances of Vehicles (P31) themselves?"	Welche TV-Serien wurden von Walt Disney entwickelt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q7725310 ; wdt:P170 wd:Q8704 . }	"['Which', 'unique', 'URI', ""'s"", 'represent', 'Mehrteiler', '(', 'Q7725310', ')', 'that', 'are', 'under', 'the', 'class', 'of', 'Multiplexors', '(', 'Q8704', ')', 'and', 'have', 'a', 'descendant', 'under', 'the', 'class', 'of', 'Vehicles', '(', 'Q7725310', 'through', 'the', 'property', '``', 'Unterklasse', 'von', '.', ""''"", '(', 'P279', ')', ')', 'or', 'are', 'directlyinstances', 'of', 'Vehicles', '(', 'P31', ')', 'themselves', '?']"	['Welche', 'TV-Serien', 'wurden', 'von', 'Walt', 'Disney', 'entwickelt', '?']	0.1869	0.1154	0.0541	229.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"""Frage: Hat Nikola Tesla (wd:Q9036) diesem Mal eine Auszeichnung (wd:P166) in der Form des Nobelpreises für Physik (wd:Q38104) erhalten?"""	Hat Tesla den Nobelpreis in Physik gewonnen?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9036 wdt:P166 wd:Q38104 . }	"['``', 'Frage', ':', 'Hat', 'Nikola', 'Tesla', '(', 'wd', ':', 'Q9036', ')', 'diesem', 'Mal', 'eine', 'Auszeichnung', '(', 'wd', ':', 'P166', ')', 'in', 'der', 'Form', 'des', 'Nobelpreises', 'für', 'Physik', '(', 'wd', ':', 'Q38104', ')', 'erhalten', '?', ""''""]"	['Hat', 'Tesla', 'den', 'Nobelpreis', 'in', 'Physik', 'gewonnen', '?']	0.2508	0.4286	0.3077	100.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	How many Bundesstaat in Mexico there are?	Wieviele Staaten at Mexiko?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(?uri) AS ?count) WHERE { ?uri wdt:P31 wd:Q15149663 . }	['How', 'many', 'Bundesstaat', 'in', 'Mexico', 'there', 'are', '?']	['Wieviele', 'Staaten', 'at', 'Mexiko', '?']	0.1982	0.2902	0.0	30.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which URI's represent scientists who participated in the Manhattan-Project, had a job as a scientist, and were awarded the Nobel Peace Prize?	Welcher Wissenschaftler ist bekannt für das Manhattan Projekt und den Nobelpreis?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P1344 wd:Q127050 . ?scientist wdt:P279* wd:Q901 . ?uri wdt:P106 ?scientist . ?uri wdt:P166 wd:Q35637 . }	"['Which', 'URI', ""'s"", 'represent', 'scientists', 'who', 'participated', 'in', 'the', 'Manhattan-Project', ',', 'had', 'a', 'job', 'as', 'a', 'scientist', ',', 'and', 'were', 'awarded', 'the', 'Nobel', 'Peace', 'Prize', '?']"	['Welcher', 'Wissenschaftler', 'ist', 'bekannt', 'für', 'das', 'Manhattan', 'Projekt', 'und', 'den', 'Nobelpreis', '?']	0.1754	0.1379	0.0	96.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the distinct URI of the gravesite for Rhee Syng-man?	Wo ist Syngman Rhee bestattet?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q171684> <http://www.wikidata.org/prop/direct/P119> ?uri  . }	['What', 'is', 'the', 'distinct', 'URI', 'of', 'the', 'gravesite', 'for', 'Rhee', 'Syng-man', '?']	['Wo', 'ist', 'Syngman', 'Rhee', 'bestattet', '?']	0.229	0.4308	0.1333	45.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which two individuals, with labels ""Prinz Harry, Herzog zu Sussex"" and ""Prinz William, Fürst zu Wales"" respectively, have a father and mother in common?"	Haben Prinz Harry und Prinz William die gleichen Eltern?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q152316 wdt:P22 ?father ; wdt:P25 ?mother . wd:Q36812 wdt:P22 ?father ; wdt:P25 ?mother . }	"['Which', 'two', 'individuals', ',', 'with', 'labels', '``', 'Prinz', 'Harry', ',', 'Herzog', 'zu', 'Sussex', ""''"", 'and', '``', 'Prinz', 'William', ',', 'Fürst', 'zu', 'Wales', ""''"", 'respectively', ',', 'have', 'a', 'father', 'and', 'mother', 'in', 'common', '?']"	['Haben', 'Prinz', 'Harry', 'und', 'Prinz', 'William', 'die', 'gleichen', 'Eltern', '?']	0.158	0.5052	0.0	105.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What is the protein (wd:Q426173 with label ""Proinsulin"") a type or subclass of?"	Ist Proinsulin eine Protein?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q426173 wdt:P31/wdt:P279* wd:Q8054 . }	"['What', 'is', 'the', 'protein', '(', 'wd', ':', 'Q426173', 'with', 'label', '``', 'Proinsulin', ""''"", ')', 'a', 'type', 'or', 'subclass', 'of', '?']"	['Ist', 'Proinsulin', 'eine', 'Protein', '?']	0.2163	0.2322	0.0	61.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of films that are: a. type of Q11424 (Film) b. have a producer with the URI wd:Q193668 (Benicio del Toro) c. originated from country Q29 (Spain)?	Wer spielt in spanischen Filmen, die von Benicio del Toro produziert wurden, mit?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?movie wdt:P31 wd:Q11424 ; wdt:P162 wd:Q193668 ; wdt:P495 wd:Q29 ; wdt:P161 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'that', 'are', ':', 'a.', 'type', 'of', 'Q11424', '(', 'Film', ')', 'b.', 'have', 'a', 'producer', 'with', 'the', 'URI', 'wd', ':', 'Q193668', '(', 'Benicio', 'del', 'Toro', ')', 'c.', 'originated', 'from', 'country', 'Q29', '(', 'Spain', ')', '?']"	['Wer', 'spielt', 'in', 'spanischen', 'Filmen', ',', 'die', 'von', 'Benicio', 'del', 'Toro', 'produziert', 'wurden', ',', 'mit', '?']	0.0719	0.381	0.0488	122.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which larger body of water has a larger surface area than Baikal Sea? (The property used is ""Fläche"" in Wikidata.)"	Ist der Baikalsee größer als der Große Bärensee?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q5513> <http://www.wikidata.org/prop/direct/P2046> ?area1 . <http://www.wikidata.org/entity/Q5525> <http://www.wikidata.org/prop/direct/P2046> ?area2 . FILTER(?area1 > ?area2) }	"['Which', 'larger', 'body', 'of', 'water', 'has', 'a', 'larger', 'surface', 'area', 'than', 'Baikal', 'Sea', '?', '(', 'The', 'property', 'used', 'is', '``', 'Fläche', ""''"", 'in', 'Wikidata', '.', ')']"	['Ist', 'der', 'Baikalsee', 'größer', 'als', 'der', 'Große', 'Bärensee', '?']	0.1754	0.1219	0.0	89.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of the entities that have the property ""besteht aus"" Foundation-Zyklus?"	Liste alle Bücher aus Asimovs Foundation-Serie auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1564644> <http://www.wikidata.org/prop/direct/P527> ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'have', 'the', 'property', '``', 'besteht', 'aus', ""''"", 'Foundation-Zyklus', '?']"	['Liste', 'alle', 'Bücher', 'aus', 'Asimovs', 'Foundation-Serie', 'auf', '.']	0.1831	0.1579	0.0	76.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct uris of the places of birth for Johann Sebastian Bach?	Wo ist Bach geboren?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1339 wdt:P19 ?uri . }	['What', 'are', 'the', 'distinct', 'uris', 'of', 'the', 'places', 'of', 'birth', 'for', 'Johann', 'Sebastian', 'Bach', '?']	['Wo', 'ist', 'Bach', 'geboren', '?']	0.2239	0.3096	0.0	61.0
