id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
196	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1480118 wdt:P113 ?uri . } 
 Где:
 wd:Q1480118 именуется как ""Yeti Airlines.""
 wdt:P113 именуется как ""узловой аэропорт.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which airports are the hubs for Yeti Airlines?	Какие аэропорты обслуживает Yeti Airlines?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1480118 wdt:P113 ?uri . }	['Which', 'airports', 'are', 'the', 'hubs', 'for', 'Yeti', 'Airlines', '?']	['Какие', 'аэропорты', 'обслуживает', 'Yeti', 'Airlines', '?']	0.218	0.8617	0.3077	29.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which airports are the hubs for Yeti Airlines?	Какие аэропорты обслуживает Авиалиния Йети?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1480118 wdt:P113 ?uri . }	['Which', 'airports', 'are', 'the', 'hubs', 'for', 'Yeti', 'Airlines', '?']	['Какие', 'аэропорты', 'обслуживает', 'Авиалиния', 'Йети', '?']	0.1969	0.2872	0.0	43.0
197	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q5879 wdt:P19 ?res . }  
 Где:
 wd:Q5879 именуется как ""Иоганн Вольфганг фон Гёте.""
 wdt:P19 именуется как ""место рождения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the birthplace of Johann Wolfgang von Goethe (wd:Q5879)?	Место рождения Гете?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q5879 wdt:P19 ?res . } 	['What', 'is', 'the', 'birthplace', 'of', 'Johann', 'Wolfgang', 'von', 'Goethe', '(', 'wd', ':', 'Q5879', ')', '?']	['Место', 'рождения', 'Гете', '?']	0.1883	0.1333	0.0	61.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the date that the Caribbean Crisis ended, and what is the date that Operation in the Gulf of Pigs began, with the former being before the latter?	Был ли кубинский кризис раньше, чем операция в бухте Кочинос?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q128160> <http://www.wikidata.org/prop/direct/P582> ?date1 . <http://www.wikidata.org/entity/Q191721> <http://www.wikidata.org/prop/direct/P580> ?date2 . FILTER(?date1 < ?date2) }	['What', 'is', 'the', 'date', 'that', 'the', 'Caribbean', 'Crisis', 'ended', ',', 'and', 'what', 'is', 'the', 'date', 'that', 'Operation', 'in', 'the', 'Gulf', 'of', 'Pigs', 'began', ',', 'with', 'the', 'former', 'being', 'before', 'the', 'latter', '?']	['Был', 'ли', 'кубинский', 'кризис', 'раньше', ',', 'чем', 'операция', 'в', 'бухте', 'Кочинос', '?']	0.2022	0.2241	0.0	142.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the date that the Caribbean Crisis ended, and what is the date that Operation in the Gulf of Pigs began, with the former being before the latter?	Был ли Карибский кризис раньше, чем высадка в заливе Свиней?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q128160> <http://www.wikidata.org/prop/direct/P582> ?date1 . <http://www.wikidata.org/entity/Q191721> <http://www.wikidata.org/prop/direct/P580> ?date2 . FILTER(?date1 < ?date2) }	['What', 'is', 'the', 'date', 'that', 'the', 'Caribbean', 'Crisis', 'ended', ',', 'and', 'what', 'is', 'the', 'date', 'that', 'Operation', 'in', 'the', 'Gulf', 'of', 'Pigs', 'began', ',', 'with', 'the', 'former', 'being', 'before', 'the', 'latter', '?']	['Был', 'ли', 'Карибский', 'кризис', 'раньше', ',', 'чем', 'высадка', 'в', 'заливе', 'Свиней', '?']	0.2022	0.2241	0.0	142.0
199	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q656071 wdt:P527 ?uri . } 
 Где:
 wd:Q656071 именуется как ""Морковный торт.""
 wdt:P527 именуется как ""состоит из.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct entities that ""Морковный торт"" (wd:Q656071) is made of, according to the ""состоит из."" (wdt:P527) property?"	Какие ингридиенты нужны для морковного торта?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q656071 wdt:P527 ?uri . }	"['What', 'are', 'the', 'distinct', 'entities', 'that', '``', 'Морковный', 'торт', ""''"", '(', 'wd', ':', 'Q656071', ')', 'is', 'made', 'of', ',', 'according', 'to', 'the', '``', 'состоит', 'из', '.', ""''"", '(', 'wdt', ':', 'P527', ')', 'property', '?']"	['Какие', 'ингридиенты', 'нужны', 'для', 'морковного', 'торта', '?']	0.1685	0.0826	0.0	113.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct entities that ""Морковный торт"" (wd:Q656071) is made of, according to the ""состоит из."" (wdt:P527) property?"	Какие ингридиенты мне нужны для морковного торта?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q656071 wdt:P527 ?uri . }	"['What', 'are', 'the', 'distinct', 'entities', 'that', '``', 'Морковный', 'торт', ""''"", '(', 'wd', ':', 'Q656071', ')', 'is', 'made', 'of', ',', 'according', 'to', 'the', '``', 'состоит', 'из', '.', ""''"", '(', 'wdt', ':', 'P527', ')', 'property', '?']"	['Какие', 'ингридиенты', 'мне', 'нужны', 'для', 'морковного', 'торта', '?']	0.1685	0.0882	0.0	114.0
200	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q52 wdt:P112 ?uri . } 
 Где:
 wd:Q52 именуется как ""Википедия.""
 wdt:P112 именуется как ""основатель.""
201	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P31 wd:Q8502 . ?res wdt:P131+ wd:Q1202 . ?res wdt:P2044 ?height . } ORDER BY DESC(?height) LIMIT 1 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q8502 именуется как ""гора.""
 wdt:P131 именуется как ""административно-территориальная единица.""
 wd:Q1202 именуется как ""Саксония.""
 wdt:P2044 именуется как ""высота над уровнем моря.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the tallest mountain that is a part of an administrative region called Saxony, with a known height over sea level?	Какая самая высокая гора в федеральной земле Саксония	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P31 wd:Q8502 . ?res wdt:P131+ wd:Q1202 . ?res wdt:P2044 ?height . } ORDER BY DESC(?height) LIMIT 1	['What', 'is', 'the', 'tallest', 'mountain', 'that', 'is', 'a', 'part', 'of', 'an', 'administrative', 'region', 'called', 'Saxony', ',', 'with', 'a', 'known', 'height', 'over', 'sea', 'level', '?']	['Какая', 'самая', 'высокая', 'гора', 'в', 'федеральной', 'земле', 'Саксония']	0.0	0.0	0.0	115.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the tallest mountain that is a part of an administrative region called Saxony, with a known height over sea level?	Какая гора в Саксонии самая высокая?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P31 wd:Q8502 . ?res wdt:P131+ wd:Q1202 . ?res wdt:P2044 ?height . } ORDER BY DESC(?height) LIMIT 1	['What', 'is', 'the', 'tallest', 'mountain', 'that', 'is', 'a', 'part', 'of', 'an', 'administrative', 'region', 'called', 'Saxony', ',', 'with', 'a', 'known', 'height', 'over', 'sea', 'level', '?']	['Какая', 'гора', 'в', 'Саксонии', 'самая', 'высокая', '?']	0.1774	0.117	0.0	116.0
202	"Имея следующий SPARQL запрос: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/>  SELECT ?res WHERE { ?res p:P39 _:a . _:a ps:P39 wd:Q22575092 . :a pq:P580 ?start . } ORDER BY DESC(?start) LIMIT 1 
 Где:
 p:P39 именуется как ""занимаемая должность.""
 ps:P39 именуется как ""занимаемая должность.""
 wd:Q22575092 именуется как ""федеральный министр финансов Германии.""
 pq:P580 именуется как ""дата начала.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the position held by the resource with the descending earliest starting date, and what is the date it started, that is a federal minister of finance in Germany?	Кто в настоящее время является федеральным министром финансов в Германии	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/>  SELECT ?res WHERE { ?res p:P39 _:a . _:a ps:P39 wd:Q22575092 . :a pq:P580 ?start . } ORDER BY DESC(?start) LIMIT 1	['What', 'is', 'the', 'position', 'held', 'by', 'the', 'resource', 'with', 'the', 'descending', 'earliest', 'starting', 'date', ',', 'and', 'what', 'is', 'the', 'date', 'it', 'started', ',', 'that', 'is', 'a', 'federal', 'minister', 'of', 'finance', 'in', 'Germany', '?']	['Кто', 'в', 'настоящее', 'время', 'является', 'федеральным', 'министром', 'финансов', 'в', 'Германии']	0.0	0.0	0.0	159.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the position held by the resource with the descending earliest starting date, and what is the date it started, that is a federal minister of finance in Germany?	Кто сейчас является федеральным министром финансов Германии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/>  SELECT ?res WHERE { ?res p:P39 _:a . _:a ps:P39 wd:Q22575092 . :a pq:P580 ?start . } ORDER BY DESC(?start) LIMIT 1	['What', 'is', 'the', 'position', 'held', 'by', 'the', 'resource', 'with', 'the', 'descending', 'earliest', 'starting', 'date', ',', 'and', 'what', 'is', 'the', 'date', 'it', 'started', ',', 'that', 'is', 'a', 'federal', 'minister', 'of', 'finance', 'in', 'Germany', '?']	['Кто', 'сейчас', 'является', 'федеральным', 'министром', 'финансов', 'Германии', '?']	0.1693	0.0909	0.0	161.0
203	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?res WHERE { wd:Q5806 wdt:P131+ ?res . ?res wdt:P31 wd:Q6256 . } 
 Где:
 wd:Q5806 именуется как ""Мекка.""
 wdt:P131 именуется как ""административно-территориальная единица.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q6256 именуется как ""страна.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct administrative units that are part of the country named ""Мекка"" and are classified as a specific type of entity?"""	В какой стране находится Мекка	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?res WHERE { wd:Q5806 wdt:P131+ ?res . ?res wdt:P31 wd:Q6256 . }	"['What', 'are', 'the', 'distinct', 'administrative', 'units', 'that', 'are', 'part', 'of', 'the', 'country', 'named', '``', 'Мекка', ""''"", 'and', 'are', 'classified', 'as', 'a', 'specific', 'type', 'of', 'entity', '?', ""''""]"	['В', 'какой', 'стране', 'находится', 'Мекка']	0.1745	0.086	0.0	126.0
204	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q5620660> ^<http://www.wikidata.org/prop/qualifier/P453>/<http://www.wikidata.org/prop/statement/P161> ?uri }  
 Где:
 http://www.wikidata.org/entity/Q5620660 именуется как ""Гас Фринг.""
 http://www.wikidata.org/prop/qualifier/P453 именуется как ""играет роль персонажа.""
 http://www.wikidata.org/prop/statement/P161 именуется как ""в ролях.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinctive URI's of the entities that play a role as characters in the shows or series where Gaas Fring, identified by the URI <http://www.wikidata.org/entity/Q5620660>, appears?	"Кто играл персонажа Гаса Фринга в сериале ""Во все тяжкие"""	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q5620660> ^<http://www.wikidata.org/prop/qualifier/P453>/<http://www.wikidata.org/prop/statement/P161> ?uri } 	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'play', 'a', 'role', 'as', 'characters', 'in', 'the', 'shows', 'or', 'series', 'where', 'Gaas', 'Fring', ',', 'identified', 'by', 'the', 'URI', '<', 'http', ':', '//www.wikidata.org/entity/Q5620660', '>', ',', 'appears', '?']"	"['Кто', 'играл', 'персонажа', 'Гаса', 'Фринга', 'в', 'сериале', '``', 'Во', 'все', 'тяжкие', ""''""]"	0.0	0.0	0.0	183.0
205	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?res WHERE { wd:Q3392 wdt:P885/wdt:P17 ?res . } 
 Где:
 wd:Q3392 именуется как ""Нил.""
 wdt:P885 именуется как ""исток водотока.""
 wdt:P17 именуется как ""государство.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the countries where the Nile river originates?	В какой стране начинается Нил	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?res WHERE { wd:Q3392 wdt:P885/wdt:P17 ?res . }	['What', 'are', 'the', 'countries', 'where', 'the', 'Nile', 'river', 'originates', '?']	['В', 'какой', 'стране', 'начинается', 'Нил']	0.0	0.0	0.0	51.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the countries where the Nile river originates?	В какой стране находится исток Нила?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?res WHERE { wd:Q3392 wdt:P885/wdt:P17 ?res . }	['What', 'are', 'the', 'countries', 'where', 'the', 'Nile', 'river', 'originates', '?']	['В', 'какой', 'стране', 'находится', 'исток', 'Нила', '?']	0.1955	0.2807	0.0	49.0
206	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q739627 wdt:P131 ?res . ?res wdt:P31/wdt:P279* wd:Q106458883 . } 
 Где:
 wd:Q739627 именуется как ""Университет штата Пенсильвания.""
 wdt:P131 именуется как ""административно-территориальная единица.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q106458883 именуется как ""штат.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the administrative region that is a subclass of a state and is the location of University of Pennsylvania?	В каком штате находится университет Пенн Стейт	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q739627 wdt:P131 ?res . ?res wdt:P31/wdt:P279* wd:Q106458883 . }	['What', 'is', 'the', 'administrative', 'region', 'that', 'is', 'a', 'subclass', 'of', 'a', 'state', 'and', 'is', 'the', 'location', 'of', 'University', 'of', 'Pennsylvania', '?']	['В', 'каком', 'штате', 'находится', 'университет', 'Пенн', 'Стейт']	0.0	0.0	0.0	108.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the URI of the facility that is either a subclass of ""stadion"" or has the property ""this type of entity"" with value ""stadion"" and has the maximum value for the property ""вместимость (P1083)"", belonging to the country ""Испания (P17)""?"	Какой стадион является самым большим в Испании?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q483110> .  } UNION { ?uri <http://www.wikidata.org/prop/direct/P31> ?type . ?type <http://www.wikidata.org/prop/direct/P279> <http://www.wikidata.org/entity/Q483110> } ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q29> .  ?uri <http://www.wikidata.org/prop/direct/P1083> ?num .  } ORDER BY DESC(?num) LIMIT 1	"['What', 'is', 'the', 'URI', 'of', 'the', 'facility', 'that', 'is', 'either', 'a', 'subclass', 'of', '``', 'stadion', ""''"", 'or', 'has', 'the', 'property', '``', 'this', 'type', 'of', 'entity', ""''"", 'with', 'value', '``', 'stadion', ""''"", 'and', 'has', 'the', 'maximum', 'value', 'for', 'the', 'property', '``', 'вместимость', '(', 'P1083', ')', ""''"", ',', 'belonging', 'to', 'the', 'country', '``', 'Испания', '(', 'P17', ')', ""''"", '?']"	['Какой', 'стадион', 'является', 'самым', 'большим', 'в', 'Испании', '?']	0.1546	0.0526	0.0	225.0
209	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?area WHERE { wd:Q145 wdt:P2046 ?area . } 
 Где:
 wd:Q145 именуется как ""Великобритания.""
 wdt:P2046 именуется как ""площадь.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the area with a size (or extent) that belongs to entity Q145, which is called ""Великобритания""?"	Какова площадь Великобритании	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?area WHERE { wd:Q145 wdt:P2046 ?area . }	"['What', 'is', 'the', 'area', 'with', 'a', 'size', '(', 'or', 'extent', ')', 'that', 'belongs', 'to', 'entity', 'Q145', ',', 'which', 'is', 'called', '``', 'Великобритания', ""''"", '?']"	['Какова', 'площадь', 'Великобритании']	0.0	0.0	0.0	88.0
210	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q2695156 wdt:P170 ?uri . } 
 Где:
 wd:Q2695156 именуется как ""Бэтмен.""
 wdt:P170 именуется как ""создатель.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""Что создалEntity with ID ""Batman"" (wd:Q2695156)?""

In English: ""What created Entity with ID 'Batman' (wd:Q2695156)?"""	Кто создал Бэтмена	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q2695156 wdt:P170 ?uri . }	"['``', 'Что', 'создалEntity', 'with', 'ID', '``', 'Batman', ""''"", '(', 'wd', ':', 'Q2695156', ')', '?', ""''"", 'In', 'English', ':', '``', 'What', 'created', 'Entity', 'with', 'ID', ""'Batman"", ""'"", '(', 'wd', ':', 'Q2695156', ')', '?', ""''""]"	['Кто', 'создал', 'Бэтмена']	0.0	0.0	0.0	107.0
211	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9215 wdt:P26 ?o1 . } 
 Где:
 wd:Q9215 именуется как ""Зигмунд Фрейд.""
 wdt:P26 именуется как ""супруг(а).""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Is there a spouse of ""Zigmund Freud"" (wd:Q9215)?"	Зигмунд Фрейд был женат?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9215 wdt:P26 ?o1 . }	"['Is', 'there', 'a', 'spouse', 'of', '``', 'Zigmund', 'Freud', ""''"", '(', 'wd', ':', 'Q9215', ')', '?']"	['Зигмунд', 'Фрейд', 'был', 'женат', '?']	0.1883	0.1548	0.0	44.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Is there a spouse of ""Zigmund Freud"" (wd:Q9215)?"	Был ли Зигмут Фрейд женат?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9215 wdt:P26 ?o1 . }	"['Is', 'there', 'a', 'spouse', 'of', '``', 'Zigmund', 'Freud', ""''"", '(', 'wd', ':', 'Q9215', ')', '?']"	['Был', 'ли', 'Зигмут', 'Фрейд', 'женат', '?']	0.1883	0.1723	0.0	43.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Is there a spouse of ""Zigmund Freud"" (wd:Q9215)?"	Был ли женат Сигмунд Фрейд?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9215 wdt:P26 ?o1 . }	"['Is', 'there', 'a', 'spouse', 'of', '``', 'Zigmund', 'Freud', ""''"", '(', 'wd', ':', 'Q9215', ')', '?']"	['Был', 'ли', 'женат', 'Сигмунд', 'Фрейд', '?']	0.1883	0.1723	0.0	44.0
212	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q465 wdt:P112 ?uri . } 
 Где:
 wd:Q465 именуется как ""DBpedia.""
 wdt:P112 именуется как ""основатель.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI entities that are the founders of DBpedia?	Кто разработчик DBpedia?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q465 wdt:P112 ?uri . }	['What', 'are', 'the', 'distinct', 'URI', 'entities', 'that', 'are', 'the', 'founders', 'of', 'DBpedia', '?']	['Кто', 'разработчик', 'DBpedia', '?']	0.16	0.3077	0.1538	58.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI entities that are the founders of DBpedia?	Кто является разработчиками DBpedia?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q465 wdt:P112 ?uri . }	['What', 'are', 'the', 'distinct', 'URI', 'entities', 'that', 'are', 'the', 'founders', 'of', 'DBpedia', '?']	['Кто', 'является', 'разработчиками', 'DBpedia', '?']	0.16	0.3572	0.1429	57.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI entities that are the founders of DBpedia?	Кто являются разработчиками DBpedia?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q465 wdt:P112 ?uri . }	['What', 'are', 'the', 'distinct', 'URI', 'entities', 'that', 'are', 'the', 'founders', 'of', 'DBpedia', '?']	['Кто', 'являются', 'разработчиками', 'DBpedia', '?']	0.16	0.3572	0.1429	57.0
213	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q11424 ; wdt:P57 wd:Q56094 . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q11424 именуется как ""фильм.""
 wdt:P57 именуется как ""режиссёр.""
 wd:Q56094 именуется как ""Фрэнсис Форд Коппола.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI labels of films that have a director who is a descendant of the film concept, i.e., they belong to a subclass of films?	Назовите все фильмы, режиссер которых Фрэнсис Форд Коппола.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q11424 ; wdt:P57 wd:Q56094 . }	['What', 'are', 'the', 'distinct', 'URI', 'labels', 'of', 'films', 'that', 'have', 'a', 'director', 'who', 'is', 'a', 'descendant', 'of', 'the', 'film', 'concept', ',', 'i.e.', ',', 'they', 'belong', 'to', 'a', 'subclass', 'of', 'films', '?']	['Назовите', 'все', 'фильмы', ',', 'режиссер', 'которых', 'Фрэнсис', 'Форд', 'Коппола', '.']	0.1709	0.1072	0.0	137.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the closest taxon above ""quackswans"" (<http://www.wikidata.org/entity/Q53696>) in the taxonomic hierarchy, which includes the group of ""amphibians"" (<http://www.wikidata.org/entity/Q10908})?"	Древесные лягушки - это разновидность земноводных?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q53696> <http://www.wikidata.org/prop/direct/P171>* <http://www.wikidata.org/entity/Q10908> . }	"['What', 'is', 'the', 'closest', 'taxon', 'above', '``', 'quackswans', ""''"", '(', '<', 'http', ':', '//www.wikidata.org/entity/Q53696', '>', ')', 'in', 'the', 'taxonomic', 'hierarchy', ',', 'which', 'includes', 'the', 'group', 'of', '``', 'amphibians', ""''"", '(', '<', 'http', ':', '//www.wikidata.org/entity/Q10908', '}', ')', '?']"	['Древесные', 'лягушки', '-', 'это', 'разновидность', 'земноводных', '?']	0.1662	0.0759	0.0	192.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the closest taxon above ""quackswans"" (<http://www.wikidata.org/entity/Q53696>) in the taxonomic hierarchy, which includes the group of ""amphibians"" (<http://www.wikidata.org/entity/Q10908})?"	Является ли древестная лягушка амфибией?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q53696> <http://www.wikidata.org/prop/direct/P171>* <http://www.wikidata.org/entity/Q10908> . }	"['What', 'is', 'the', 'closest', 'taxon', 'above', '``', 'quackswans', ""''"", '(', '<', 'http', ':', '//www.wikidata.org/entity/Q53696', '>', ')', 'in', 'the', 'taxonomic', 'hierarchy', ',', 'which', 'includes', 'the', 'group', 'of', '``', 'amphibians', ""''"", '(', '<', 'http', ':', '//www.wikidata.org/entity/Q10908', '}', ')', '?']"	['Является', 'ли', 'древестная', 'лягушка', 'амфибией', '?']	0.1662	0.0699	0.0	193.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the closest taxon above ""quackswans"" (<http://www.wikidata.org/entity/Q53696>) in the taxonomic hierarchy, which includes the group of ""amphibians"" (<http://www.wikidata.org/entity/Q10908})?"	Являются ли древесный лягушки амфибиями?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q53696> <http://www.wikidata.org/prop/direct/P171>* <http://www.wikidata.org/entity/Q10908> . }	"['What', 'is', 'the', 'closest', 'taxon', 'above', '``', 'quackswans', ""''"", '(', '<', 'http', ':', '//www.wikidata.org/entity/Q53696', '>', ')', 'in', 'the', 'taxonomic', 'hierarchy', ',', 'which', 'includes', 'the', 'group', 'of', '``', 'amphibians', ""''"", '(', '<', 'http', ':', '//www.wikidata.org/entity/Q10908', '}', ')', '?']"	['Являются', 'ли', 'древесный', 'лягушки', 'амфибиями', '?']	0.1662	0.0699	0.0	193.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the closest taxon above ""quackswans"" (<http://www.wikidata.org/entity/Q53696>) in the taxonomic hierarchy, which includes the group of ""amphibians"" (<http://www.wikidata.org/entity/Q10908})?"	Древесные лягушки это земноводные?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q53696> <http://www.wikidata.org/prop/direct/P171>* <http://www.wikidata.org/entity/Q10908> . }	"['What', 'is', 'the', 'closest', 'taxon', 'above', '``', 'quackswans', ""''"", '(', '<', 'http', ':', '//www.wikidata.org/entity/Q53696', '>', ')', 'in', 'the', 'taxonomic', 'hierarchy', ',', 'which', 'includes', 'the', 'group', 'of', '``', 'amphibians', ""''"", '(', '<', 'http', ':', '//www.wikidata.org/entity/Q10908', '}', ')', '?']"	['Древесные', 'лягушки', 'это', 'земноводные', '?']	0.1662	0.0628	0.0	194.0
215	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q62408 wdt:P131 ?uri . } 
 Где:
 wd:Q62408 именуется как ""Вестминстерский дворец.""
 wdt:P131 именуется как ""административно-территориальная единица.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct administrative-territorial units (wd:P131) associated with the entity ""Вестминстерский дворец"" (wd:Q62408)?"	Где находятся палаты Парламента?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q62408 wdt:P131 ?uri . }	"['What', 'are', 'the', 'distinct', 'administrative-territorial', 'units', '(', 'wd', ':', 'P131', ')', 'associated', 'with', 'the', 'entity', '``', 'Вестминстерский', 'дворец', ""''"", '(', 'wd', ':', 'Q62408', ')', '?']"	['Где', 'находятся', 'палаты', 'Парламента', '?']	0.1764	0.0929	0.0	122.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct administrative-territorial units (wd:P131) associated with the entity ""Вестминстерский дворец"" (wd:Q62408)?"	Где находится Вестминстерский дворец?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q62408 wdt:P131 ?uri . }	"['What', 'are', 'the', 'distinct', 'administrative-territorial', 'units', '(', 'wd', ':', 'P131', ')', 'associated', 'with', 'the', 'entity', '``', 'Вестминстерский', 'дворец', ""''"", '(', 'wd', ':', 'Q62408', ')', '?']"	['Где', 'находится', 'Вестминстерский', 'дворец', '?']	0.1326	0.2786	0.0	104.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct administrative-territorial units (wd:P131) associated with the entity ""Вестминстерский дворец"" (wd:Q62408)?"	Где расположены Палаты Парламента?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q62408 wdt:P131 ?uri . }	"['What', 'are', 'the', 'distinct', 'administrative-territorial', 'units', '(', 'wd', ':', 'P131', ')', 'associated', 'with', 'the', 'entity', '``', 'Вестминстерский', 'дворец', ""''"", '(', 'wd', ':', 'Q62408', ')', '?']"	['Где', 'расположены', 'Палаты', 'Парламента', '?']	0.1764	0.0929	0.0	122.0
