id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the producers for the compositions linked to ""The Wall""?"	Кто является авторами альбома Wall группы Pink Floyd?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q151114 wdt:P658 ?track . ?track wdt:P162 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'producers', 'for', 'the', 'compositions', 'linked', 'to', '``', 'The', 'Wall', ""''"", '?']"	['Кто', 'является', 'авторами', 'альбома', 'Wall', 'группы', 'Pink', 'Floyd', '?']	0.2177	0.3337	0.0	76.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the producers for the compositions linked to ""The Wall""?"	Кто являются авторами альбома Стена Пинк Флойда?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q151114 wdt:P658 ?track . ?track wdt:P162 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'producers', 'for', 'the', 'compositions', 'linked', 'to', '``', 'The', 'Wall', ""''"", '?']"	['Кто', 'являются', 'авторами', 'альбома', 'Стена', 'Пинк', 'Флойда', '?']	0.1831	0.1579	0.0	80.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the producers for the compositions linked to ""The Wall""?"	"Назовите всех авторов альбома ""the Wall"" группы Пинк Флойд?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q151114 wdt:P658 ?track . ?track wdt:P162 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'producers', 'for', 'the', 'compositions', 'linked', 'to', '``', 'The', 'Wall', ""''"", '?']"	"['Назовите', 'всех', 'авторов', 'альбома', '``', 'the', 'Wall', ""''"", 'группы', 'Пинк', 'Флойд', '?']"	0.1703	0.9434	0.0	75.0
300	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q34370 wdt:P6 ?uri . } 
 Где:
 wd:Q34370 именуется как ""Роттердам.""
 wdt:P6 именуется как ""глава правительства.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of entities that have been the head of government for Rotterdam?	Кто является мэром Роттердама?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q34370 wdt:P6 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'been', 'the', 'head', 'of', 'government', 'for', 'Rotterdam', '?']"	['Кто', 'является', 'мэром', 'Роттердама', '?']	0.1843	0.129	0.0	88.0
301	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q515 ; wdt:P17 wd:Q408 ; wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q515 именуется как ""город.""
 wdt:P17 именуется как ""государство.""
 wd:Q408 именуется как ""Австралия.""
 wdt:P1082 именуется как ""численность населения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the city with the largest population that is a subclass of a city and is located in Australia?	Какой город Автралии является крупнейшим?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q515 ; wdt:P17 wd:Q408 ; wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1	['What', 'is', 'the', 'city', 'with', 'the', 'largest', 'population', 'that', 'is', 'a', 'subclass', 'of', 'a', 'city', 'and', 'is', 'located', 'in', 'Australia', '?']	['Какой', 'город', 'Автралии', 'является', 'крупнейшим', '?']	0.1807	0.1231	0.0	97.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the city with the largest population that is a subclass of a city and is located in Australia?	Какой город самый большой в Австралии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q515 ; wdt:P17 wd:Q408 ; wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1	['What', 'is', 'the', 'city', 'with', 'the', 'largest', 'population', 'that', 'is', 'a', 'subclass', 'of', 'a', 'city', 'and', 'is', 'located', 'in', 'Australia', '?']	['Какой', 'город', 'самый', 'большой', 'в', 'Австралии', '?']	0.1807	0.1337	0.0	96.0
302	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q2105 wdt:P26 ?uri . } 
 Где:
 wd:Q2105 именуется как ""Жак Ширак.""
 wdt:P26 именуется как ""супруг(а).""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers for the spouses of ""Jacques Chirac"" (wd:Q2105)?"	На ком был женат президент Ширак?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q2105 wdt:P26 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'for', 'the', 'spouses', 'of', '``', 'Jacques', 'Chirac', ""''"", '(', 'wd', ':', 'Q2105', ')', '?']"	['На', 'ком', 'был', 'женат', 'президент', 'Ширак', '?']	0.1818	0.1404	0.0	79.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers for the spouses of ""Jacques Chirac"" (wd:Q2105)?"	Кто вышла замуж за президента Ширака?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q2105 wdt:P26 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'for', 'the', 'spouses', 'of', '``', 'Jacques', 'Chirac', ""''"", '(', 'wd', ':', 'Q2105', ')', '?']"	['Кто', 'вышла', 'замуж', 'за', 'президента', 'Ширака', '?']	0.1818	0.1404	0.0	79.0
303	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q258 wdt:P122 ?uri . } 
 Где:
 wd:Q258 именуется как ""ЮАР.""
 wdt:P122 именуется как ""форма правления.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the form of government for the entity with the Wikidata ID ""Q258"" (South Africa)?"	Какая формы правления существуют в Южной Африке?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q258 wdt:P122 ?uri . }	"['What', 'is', 'the', 'form', 'of', 'government', 'for', 'the', 'entity', 'with', 'the', 'Wikidata', 'ID', '``', 'Q258', ""''"", '(', 'South', 'Africa', ')', '?']"	['Какая', 'формы', 'правления', 'существуют', 'в', 'Южной', 'Африке', '?']	0.1807	0.1429	0.0	82.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the form of government for the entity with the Wikidata ID ""Q258"" (South Africa)?"	Какая форма правления в Южной Африке?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q258 wdt:P122 ?uri . }	"['What', 'is', 'the', 'form', 'of', 'government', 'for', 'the', 'entity', 'with', 'the', 'Wikidata', 'ID', '``', 'Q258', ""''"", '(', 'South', 'Africa', ')', '?']"	['Какая', 'форма', 'правления', 'в', 'Южной', 'Африке', '?']	0.1807	0.1337	0.0	83.0
304	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?num WHERE { wd:Q1207989 wdt:P2048 ?num . } 
 Где:
 wd:Q1207989 именуется как ""Марин-тауэр.""
 wdt:P2048 именуется как ""высота/рост.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the height (or length) of the Marin-tower denoted by the Wikidata entity wd:Q1207989?	Какая высота Марин-тауэр в Иокагаме?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?num WHERE { wd:Q1207989 wdt:P2048 ?num . }	['What', 'is', 'the', 'height', '(', 'or', 'length', ')', 'of', 'the', 'Marin-tower', 'denoted', 'by', 'the', 'Wikidata', 'entity', 'wd', ':', 'Q1207989', '?']	['Какая', 'высота', 'Марин-тауэр', 'в', 'Иокагаме', '?']	0.1818	0.1292	0.0	87.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the height (or length) of the Marin-tower denoted by the Wikidata entity wd:Q1207989?	Какова высота Морской башни в Иокогаме?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?num WHERE { wd:Q1207989 wdt:P2048 ?num . }	['What', 'is', 'the', 'height', '(', 'or', 'length', ')', 'of', 'the', 'Marin-tower', 'denoted', 'by', 'the', 'Wikidata', 'entity', 'wd', ':', 'Q1207989', '?']	['Какова', 'высота', 'Морской', 'башни', 'в', 'Иокогаме', '?']	0.1818	0.1404	0.0	87.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which URI represents an instance of a celebration event that is a subclass of anyclass, including its subclasses and further subclasses?	Какие праздники отмечают во всем мире?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/>  SELECT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q1445650 . }	['Which', 'URI', 'represents', 'an', 'instance', 'of', 'a', 'celebration', 'event', 'that', 'is', 'a', 'subclass', 'of', 'anyclass', ',', 'including', 'its', 'subclasses', 'and', 'further', 'subclasses', '?']	['Какие', 'праздники', 'отмечают', 'во', 'всем', 'мире', '?']	0.1785	0.1221	0.0	130.0
306	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q3665646 ; wdt:P2048 ?height . } ORDER BY DESC(?height) LIMIT 1 
 Где:
 wdt:P106 именуется как ""род занятий.""
 wd:Q3665646 именуется как ""баскетболист.""
 wdt:P2048 именуется как ""высота/рост.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the tallest professional basketball player, in terms of height, according to Wikidata?	Кто самый высокий баскетболист	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q3665646 ; wdt:P2048 ?height . } ORDER BY DESC(?height) LIMIT 1	['What', 'is', 'the', 'tallest', 'professional', 'basketball', 'player', ',', 'in', 'terms', 'of', 'height', ',', 'according', 'to', 'Wikidata', '?']	['Кто', 'самый', 'высокий', 'баскетболист']	0.0	0.0	0.0	91.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the tallest professional basketball player, in terms of height, according to Wikidata?	Кто является высочайшим игроком в баскетбол?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q3665646 ; wdt:P2048 ?height . } ORDER BY DESC(?height) LIMIT 1	['What', 'is', 'the', 'tallest', 'professional', 'basketball', 'player', ',', 'in', 'terms', 'of', 'height', ',', 'according', 'to', 'Wikidata', '?']	['Кто', 'является', 'высочайшим', 'игроком', 'в', 'баскетбол', '?']	0.1856	0.1651	0.0	88.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the number of distinct entities that have the property ""language of communication"" with the entity named ""Turkmenistan"" (wd:Q874)?"	На скольких языках говорят в Туркменистане	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { wd:Q874 wdt:P2936 ?uri . }	"['What', 'is', 'the', 'number', 'of', 'distinct', 'entities', 'that', 'have', 'the', 'property', '``', 'language', 'of', 'communication', ""''"", 'with', 'the', 'entity', 'named', '``', 'Turkmenistan', ""''"", '(', 'wd', ':', 'Q874', ')', '?']"	['На', 'скольких', 'языках', 'говорят', 'в', 'Туркменистане']	0.0	0.0	0.0	133.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the number of distinct entities that have the property ""language of communication"" with the entity named ""Turkmenistan"" (wd:Q874)?"	На скольких языках говорят в Туркмении?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { wd:Q874 wdt:P2936 ?uri . }	"['What', 'is', 'the', 'number', 'of', 'distinct', 'entities', 'that', 'have', 'the', 'property', '``', 'language', 'of', 'communication', ""''"", 'with', 'the', 'entity', 'named', '``', 'Turkmenistan', ""''"", '(', 'wd', ':', 'Q874', ')', '?']"	['На', 'скольких', 'языках', 'говорят', 'в', 'Туркмении', '?']	0.1726	0.0968	0.0	132.0
308	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5809 wdt:P40 ?uri . } 
 Где:
 wd:Q5809 именуется как ""Эрнесто Че Гевара.""
 wdt:P40 именуется как ""дети.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""EXISTS a uri such that Ernesto Che Guevara has the property 'дети' with value uri?"""	Есть ли у Че Гевары дети	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5809 wdt:P40 ?uri . }	"['``', 'EXISTS', 'a', 'uri', 'such', 'that', 'Ernesto', 'Che', 'Guevara', 'has', 'the', 'property', ""'дети"", ""'"", 'with', 'value', 'uri', '?', ""''""]"	['Есть', 'ли', 'у', 'Че', 'Гевары', 'дети']	0.0	0.0	0.0	75.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""EXISTS a uri such that Ernesto Che Guevara has the property 'дети' with value uri?"""	Были ли дети у Че Гевары?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5809 wdt:P40 ?uri . }	"['``', 'EXISTS', 'a', 'uri', 'such', 'that', 'Ernesto', 'Che', 'Guevara', 'has', 'the', 'property', ""'дети"", ""'"", 'with', 'value', 'uri', '?', ""''""]"	['Были', 'ли', 'дети', 'у', 'Че', 'Гевары', '?']	0.1831	0.1478	0.0	75.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Was Akis Kaurismaki awarded the Grand-prize of the Cannes Film Festival?	Выигрывал ли Каурисмяки Гран-при Каннского фестиваля	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q276186> <http://www.wikidata.org/prop/direct/P166>  <http://www.wikidata.org/entity/Q844804> . }	['Was', 'Akis', 'Kaurismaki', 'awarded', 'the', 'Grand-prize', 'of', 'the', 'Cannes', 'Film', 'Festival', '?']	['Выигрывал', 'ли', 'Каурисмяки', 'Гран-при', 'Каннского', 'фестиваля']	0.0	0.0	0.0	67.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Was Akis Kaurismaki awarded the Grand-prize of the Cannes Film Festival?	Выигрывал ли когда-либо Каурисмаки Гран-При в Каннах?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q276186> <http://www.wikidata.org/prop/direct/P166>  <http://www.wikidata.org/entity/Q844804> . }	['Was', 'Akis', 'Kaurismaki', 'awarded', 'the', 'Grand-prize', 'of', 'the', 'Cannes', 'Film', 'Festival', '?']	['Выигрывал', 'ли', 'когда-либо', 'Каурисмаки', 'Гран-При', 'в', 'Каннах', '?']	0.1926	0.25	0.0	66.0
310	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q90> <http://www.wikidata.org/prop/direct/P6>/<http://www.wikidata.org/prop/direct/P102> ?uri } 
 Где:
 http://www.wikidata.org/entity/Q90 именуется как ""Париж.""
 http://www.wikidata.org/prop/direct/P6 именуется как ""глава правительства.""
 http://www.wikidata.org/prop/direct/P102 именуется как ""член политической партии.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of entities that are the heads of government for political parties of which Paris is a member?	В какой партии состоит мэр Парижа	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q90> <http://www.wikidata.org/prop/direct/P6>/<http://www.wikidata.org/prop/direct/P102> ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'are', 'the', 'heads', 'of', 'government', 'for', 'political', 'parties', 'of', 'which', 'Paris', 'is', 'a', 'member', '?']"	['В', 'какой', 'партии', 'состоит', 'мэр', 'Парижа']	0.0	0.0	0.0	117.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of entities that are the heads of government for political parties of which Paris is a member?	Какова партийная принадлежность мэра Парижа?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q90> <http://www.wikidata.org/prop/direct/P6>/<http://www.wikidata.org/prop/direct/P102> ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'are', 'the', 'heads', 'of', 'government', 'for', 'political', 'parties', 'of', 'which', 'Paris', 'is', 'a', 'member', '?']"	['Какова', 'партийная', 'принадлежность', 'мэра', 'Парижа', '?']	0.1774	0.1077	0.0	117.0
311	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q10841764 ; wdt:P1350 ?num . } ORDER BY DESC(?num) LIMIT 1 
 Где:
 wdt:P106 именуется как ""род занятий.""
 wd:Q10841764 именуется как ""пилот Формулы-1.""
 wdt:P1350 именуется как ""число сыгранных матчей/спортивных стартов.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the URI of the person with the occupation of a Formula-1 pilot and the highest number of racing participation (number of matches or starts)?	У какого гонщика Формулы-1 больше всего заездов	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q10841764 ; wdt:P1350 ?num . } ORDER BY DESC(?num) LIMIT 1	['What', 'is', 'the', 'URI', 'of', 'the', 'person', 'with', 'the', 'occupation', 'of', 'a', 'Formula-1', 'pilot', 'and', 'the', 'highest', 'number', 'of', 'racing', 'participation', '(', 'number', 'of', 'matches', 'or', 'starts', ')', '?']	['У', 'какого', 'гонщика', 'Формулы-1', 'больше', 'всего', 'заездов']	0.0	0.0	0.0	140.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the URI of the person with the occupation of a Formula-1 pilot and the highest number of racing participation (number of matches or starts)?	Какой пилот Формулы 1 выиграл больше всего гонок?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q10841764 ; wdt:P1350 ?num . } ORDER BY DESC(?num) LIMIT 1	['What', 'is', 'the', 'URI', 'of', 'the', 'person', 'with', 'the', 'occupation', 'of', 'a', 'Formula-1', 'pilot', 'and', 'the', 'highest', 'number', 'of', 'racing', 'participation', '(', 'number', 'of', 'matches', 'or', 'starts', ')', '?']	['Какой', 'пилот', 'Формулы', '1', 'выиграл', 'больше', 'всего', 'гонок', '?']	0.1726	0.1093	0.0	139.0
312	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q2663195> <http://www.wikidata.org/prop/direct/P17> ?uri } 
 Где:
 http://www.wikidata.org/entity/Q2663195 именуется как ""Sitecore.""
 http://www.wikidata.org/prop/direct/P17 именуется как ""государство.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the countries associated with the Sitecore entity?	В какой стране основан Sitecore	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q2663195> <http://www.wikidata.org/prop/direct/P17> ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'countries', 'associated', 'with', 'the', 'Sitecore', 'entity', '?']"	['В', 'какой', 'стране', 'основан', 'Sitecore']	0.1883	0.1548	0.125	69.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the countries associated with the Sitecore entity?	Из какой страны родом Сайткор?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q2663195> <http://www.wikidata.org/prop/direct/P17> ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'countries', 'associated', 'with', 'the', 'Sitecore', 'entity', '?']"	['Из', 'какой', 'страны', 'родом', 'Сайткор', '?']	0.1883	0.1723	0.0	76.0
313	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q40912 wdt:P19 ?uri } 
 Где:
 wd:Q40912 именуется как ""Фрэнк Синатра.""
 wdt:P19 именуется как ""место рождения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinctive URI's of the places where Frank Sinatra was born?	Где родился Фрэнк Синатра	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q40912 wdt:P19 ?uri }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'the', 'places', 'where', 'Frank', 'Sinatra', 'was', 'born', '?']"	['Где', 'родился', 'Фрэнк', 'Синатра']	0.0	0.0	0.0	71.0
314	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1481540 wdt:P161 wd:Q45772 . } 
 Где:
 wd:Q1481540 именуется как ""Бархатная золотая жила.""
 wdt:P161 именуется как ""в ролях.""
 wd:Q45772 именуется как ""Кристиан Бейл.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""Список лиц, whom ""Бархатная золотая жила"" (wd:Q1481540) played roles?""
""Who did 'The Velvet Goldsmith' (wd:Q1481540) act as in a film?""
""Who are the actors in 'The Velvet Goldsmith' (wd:Q1481540) movie?""
""Who portrayed the characters in 'The Velvet Goldsmith' (wd:Q1481540)""
""Who are the cast members in 'The Velvet Goldsmith' (wd:Q1481540)""

Is any of these questions conveying the intended message of your SPARQL query?

Given that your query states that `wd:Q1481540 wdt:P161 wd:Q45772` , I'm assuming you are looking for the person(s) who played a role in a movie for 'Barhath Gold' (wd:Q1481540).

""Who acted alongside Christian Bale in a film?"" or ""Which movies did Christian Bale and 'The Velvet Goldsmith' (wd:Q1481540) appear together in?""

Hope the question is clear. Let me know if I need to adjust or modify it further."	"Кристиан Бейл снимался в фильме ""Бархатная золотая жила"""	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1481540 wdt:P161 wd:Q45772 . }	"['``', 'Список', 'лиц', ',', 'whom', '``', 'Бархатная', 'золотая', 'жила', ""''"", '(', 'wd', ':', 'Q1481540', ')', 'played', 'roles', '?', ""''"", '``', 'Who', 'did', ""'The"", 'Velvet', 'Goldsmith', ""'"", '(', 'wd', ':', 'Q1481540', ')', 'act', 'as', 'in', 'a', 'film', '?', ""''"", '``', 'Who', 'are', 'the', 'actors', 'in', ""'The"", 'Velvet', 'Goldsmith', ""'"", '(', 'wd', ':', 'Q1481540', ')', 'movie', '?', ""''"", '``', 'Who', 'portrayed', 'the', 'characters', 'in', ""'The"", 'Velvet', 'Goldsmith', ""'"", '(', 'wd', ':', 'Q1481540', ')', ""''"", ""''"", 'Who', 'are', 'the', 'cast', 'members', 'in', ""'The"", 'Velvet', 'Goldsmith', ""'"", '(', 'wd', ':', 'Q1481540', ')', ""''"", 'Is', 'any', 'of', 'these', 'questions', 'conveying', 'the', 'intended', 'message', 'of', 'your', 'SPARQL', 'query', '?', 'Given', 'that', 'your', 'query', 'states', 'that', '`', 'wd', ':', 'Q1481540', 'wdt', ':', 'P161', 'wd', ':', 'Q45772', '`', ',', 'I', ""'m"", 'assuming', 'you', 'are', 'looking', 'for', 'the', 'person', '(', 's', ')', 'who', 'played', 'a', 'role', 'in', 'a', 'movie', 'for', ""'Barhath"", 'Gold', ""'"", '(', 'wd', ':', 'Q1481540', ')', '.', '``', 'Who', 'acted', 'alongside', 'Christian', 'Bale', 'in', 'a', 'film', '?', ""''"", 'or', '``', 'Which', 'movies', 'did', 'Christian', 'Bale', 'and', ""'The"", 'Velvet', 'Goldsmith', ""'"", '(', 'wd', ':', 'Q1481540', ')', 'appear', 'together', 'in', '?', ""''"", 'Hope', 'the', 'question', 'is', 'clear', '.', 'Let', 'me', 'know', 'if', 'I', 'need', 'to', 'adjust', 'or', 'modify', 'it', 'further', '.']"	"['Кристиан', 'Бейл', 'снимался', 'в', 'фильме', '``', 'Бархатная', 'золотая', 'жила', ""''""]"	0.0165	0.0822	0.0652	816.0
315	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P22> <http://www.wikidata.org/entity/Q179150> . ?uri <http://www.wikidata.org/prop/direct/P25> <http://www.wikidata.org/entity/Q12003> . } 
 Где:
 http://www.wikidata.org/prop/direct/P22 именуется как ""отец.""
 http://www.wikidata.org/entity/Q179150 именуется как ""Сонни Боно.""
 http://www.wikidata.org/prop/direct/P25 именуется как ""мать.""
 http://www.wikidata.org/entity/Q12003 именуется как ""Шер.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the individuals who have ""Sonny Bono"" as their father and ""Sh cher"" as their mother?"	Кто сын Сонни и Шер	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P22> <http://www.wikidata.org/entity/Q179150> . ?uri <http://www.wikidata.org/prop/direct/P25> <http://www.wikidata.org/entity/Q12003> . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'individuals', 'who', 'have', '``', 'Sonny', 'Bono', ""''"", 'as', 'their', 'father', 'and', '``', 'Sh', 'cher', ""''"", 'as', 'their', 'mother', '?']"	['Кто', 'сын', 'Сонни', 'и', 'Шер']	0.0	0.0	0.0	111.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the individuals who have ""Sonny Bono"" as their father and ""Sh cher"" as their mother?"	Кто является сыном Сонни и Шэр?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P22> <http://www.wikidata.org/entity/Q179150> . ?uri <http://www.wikidata.org/prop/direct/P25> <http://www.wikidata.org/entity/Q12003> . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'individuals', 'who', 'have', '``', 'Sonny', 'Bono', ""''"", 'as', 'their', 'father', 'and', '``', 'Sh', 'cher', ""''"", 'as', 'their', 'mother', '?']"	['Кто', 'является', 'сыном', 'Сонни', 'и', 'Шэр', '?']	0.1745	0.104	0.0	109.0
317	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1009> <http://www.wikidata.org/prop/direct/P36> ?uri} 
 Где:
 http://www.wikidata.org/entity/Q1009 именуется как ""Камерун.""
 http://www.wikidata.org/prop/direct/P36 именуется как ""административный центр.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the administrative centers of Cameroon?	Столица Камеруна?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1009> <http://www.wikidata.org/prop/direct/P36> ?uri}	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'administrative', 'centers', 'of', 'Cameroon', '?']"	['Столица', 'Камеруна', '?']	0.1911	0.1219	0.0	68.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the administrative centers of Cameroon?	Какой город является столицей Камеруна?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1009> <http://www.wikidata.org/prop/direct/P36> ?uri}	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'administrative', 'centers', 'of', 'Cameroon', '?']"	['Какой', 'город', 'является', 'столицей', 'Камеруна', '?']	0.1911	0.1988	0.0	65.0
318	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q37876 wdt:P19 ?uri . ?uri wdt:P17 wd:Q30 . } 
 Где:
 wd:Q37876 именуется как ""Натали Портман.""
 wdt:P19 именуется как ""место рождения.""
 wdt:P17 именуется как ""государство.""
 wd:Q30 именуется как ""США.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the country of birth of Natali Portman?	Натали Портман родилась в США?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q37876 wdt:P19 ?uri . ?uri wdt:P17 wd:Q30 . }	['What', 'is', 'the', 'country', 'of', 'birth', 'of', 'Natali', 'Portman', '?']	['Натали', 'Портман', 'родилась', 'в', 'США', '?']	0.1955	0.2585	0.0	42.0
320	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q873 wdt:P40 ?uri . ?uri wdt:P569 ?date . } ORDER BY ASC(?date) LIMIT 1 
 Где:
 wd:Q873 именуется как ""Мерил Стрип.""
 wdt:P40 именуется как ""дети.""
 wdt:P569 именуется как ""дата рождения.""
