id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Does ""Во все тяжкие"" have more episodes than ""Игра престолов""?"	Действительно ли Во всех тяжких больше серий чем в Игре Престолов?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1079 wdt:P1113 ?nBbEpisodes . wd:Q23572 wdt:P1113 ?nGotEpisodes . FILTER(?nBbEpisodes > ?nGotEpisodes) }	"['Does', '``', 'Во', 'все', 'тяжкие', ""''"", 'have', 'more', 'episodes', 'than', '``', 'Игра', 'престолов', ""''"", '?']"	['Действительно', 'ли', 'Во', 'всех', 'тяжких', 'больше', 'серий', 'чем', 'в', 'Игре', 'Престолов', '?']	0.2239	0.478	0.0	45.0
339	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q5582> <http://www.wikidata.org/prop/direct/P737> ?uri . } 
 Где:
 http://www.wikidata.org/entity/Q5582 именуется как ""Винсент Ван Гог.""
 http://www.wikidata.org/prop/direct/P737 именуется как ""испытал влияние от.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that have influenced Vincent Van Gogh as described by the property ""P737: испытал влияние от"" in Wikidata?"	Кем вдохновлялся Винсент ван Гог?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q5582> <http://www.wikidata.org/prop/direct/P737> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'have', 'influenced', 'Vincent', 'Van', 'Gogh', 'as', 'described', 'by', 'the', 'property', '``', 'P737', ':', 'испытал', 'влияние', 'от', ""''"", 'in', 'Wikidata', '?']"	['Кем', 'вдохновлялся', 'Винсент', 'ван', 'Гог', '?']	0.1726	0.0891	0.0	147.0
340	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q12495 wdt:P1101 ?bkFloors . ?uri wdt:P1101 ?otherFloors . FILTER (?otherFloors > ?bkFloors) } ORDER BY ?otherFloors LIMIT 1 
 Где:
 wd:Q12495 именуется как ""Бурдж-Халифа.""
 wdt:P1101 именуется как ""количество этажей.""
 wdt:P1101 именуется как ""количество этажей.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which building, specifically ""Burj Khalifa"" (wd:Q12495), has more floors than another building, and what is the number of the other building's floors?"	Какое здание имеет болше всего этажей после Бурдж-Халифа?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q12495 wdt:P1101 ?bkFloors . ?uri wdt:P1101 ?otherFloors . FILTER (?otherFloors > ?bkFloors) } ORDER BY ?otherFloors LIMIT 1	"['Which', 'building', ',', 'specifically', '``', 'Burj', 'Khalifa', ""''"", '(', 'wd', ':', 'Q12495', ')', ',', 'has', 'more', 'floors', 'than', 'another', 'building', ',', 'and', 'what', 'is', 'the', 'number', 'of', 'the', 'other', 'building', ""'s"", 'floors', '?']"	['Какое', 'здание', 'имеет', 'болше', 'всего', 'этажей', 'после', 'Бурдж-Халифа', '?']	0.1693	0.0961	0.0	142.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which building, specifically ""Burj Khalifa"" (wd:Q12495), has more floors than another building, and what is the number of the other building's floors?"	Какое здание после Бурдж Халифы имеет больше всего этажей?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q12495 wdt:P1101 ?bkFloors . ?uri wdt:P1101 ?otherFloors . FILTER (?otherFloors > ?bkFloors) } ORDER BY ?otherFloors LIMIT 1	"['Which', 'building', ',', 'specifically', '``', 'Burj', 'Khalifa', ""''"", '(', 'wd', ':', 'Q12495', ')', ',', 'has', 'more', 'floors', 'than', 'another', 'building', ',', 'and', 'what', 'is', 'the', 'number', 'of', 'the', 'other', 'building', ""'s"", 'floors', '?']"	['Какое', 'здание', 'после', 'Бурдж', 'Халифы', 'имеет', 'больше', 'всего', 'этажей', '?']	0.1693	0.1007	0.0	141.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct values for the ""value"" variable that have the property ""price"" (P2130) for the entity ""Criminal Literature"" (wd:Q104123)?"	"Сколько стоит ""Криминальное чтиво""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?value WHERE { wd:Q104123 wdt:P2130 ?value . }	"['What', 'are', 'the', 'distinct', 'values', 'for', 'the', '``', 'value', ""''"", 'variable', 'that', 'have', 'the', 'property', '``', 'price', ""''"", '(', 'P2130', ')', 'for', 'the', 'entity', '``', 'Criminal', 'Literature', ""''"", '(', 'wd', ':', 'Q104123', ')', '?']"	"['Сколько', 'стоит', '``', 'Криминальное', 'чтиво', ""''"", '?']"	0.2217	0.2477	0.0	137.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct values for the ""value"" variable that have the property ""price"" (P2130) for the entity ""Criminal Literature"" (wd:Q104123)?"	Сколько стоило Криминальное чтиво?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?value WHERE { wd:Q104123 wdt:P2130 ?value . }	"['What', 'are', 'the', 'distinct', 'values', 'for', 'the', '``', 'value', ""''"", 'variable', 'that', 'have', 'the', 'property', '``', 'price', ""''"", '(', 'P2130', ')', 'for', 'the', 'entity', '``', 'Criminal', 'Literature', ""''"", '(', 'wd', ':', 'Q104123', ')', '?']"	['Сколько', 'стоило', 'Криминальное', 'чтиво', '?']	0.1685	0.0683	0.0	139.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct values for the ""value"" variable that have the property ""price"" (P2130) for the entity ""Criminal Literature"" (wd:Q104123)?"	"Стоимость кино ""Криминальное чтиво""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?value WHERE { wd:Q104123 wdt:P2130 ?value . }	"['What', 'are', 'the', 'distinct', 'values', 'for', 'the', '``', 'value', ""''"", 'variable', 'that', 'have', 'the', 'property', '``', 'price', ""''"", '(', 'P2130', ')', 'for', 'the', 'entity', '``', 'Criminal', 'Literature', ""''"", '(', 'wd', ':', 'Q104123', ')', '?']"	"['Стоимость', 'кино', '``', 'Криминальное', 'чтиво', ""''"", '?']"	0.2217	0.2477	0.0	137.0
343	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q426173 wdt:P31/wdt:P279* wd:Q8054 . } 
 Где:
 wd:Q426173 именуется как ""Проинсулин.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q8054 именуется как ""белки.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Is there a protein (wd:Q426173) that is a subclass of the broader concept of proteins (wd:Q8054)?	Проинсулин это протеин?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q426173 wdt:P31/wdt:P279* wd:Q8054 . }	['Is', 'there', 'a', 'protein', '(', 'wd', ':', 'Q426173', ')', 'that', 'is', 'a', 'subclass', 'of', 'the', 'broader', 'concept', 'of', 'proteins', '(', 'wd', ':', 'Q8054', ')', '?']	['Проинсулин', 'это', 'протеин', '?']	0.1764	0.08	0.0	94.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Is there a protein (wd:Q426173) that is a subclass of the broader concept of proteins (wd:Q8054)?	Является ли проинсулин протеином?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q426173 wdt:P31/wdt:P279* wd:Q8054 . }	['Is', 'there', 'a', 'protein', '(', 'wd', ':', 'Q426173', ')', 'that', 'is', 'a', 'subclass', 'of', 'the', 'broader', 'concept', 'of', 'proteins', '(', 'wd', ':', 'Q8054', ')', '?']	['Является', 'ли', 'проинсулин', 'протеином', '?']	0.1764	0.0929	0.0	93.0
344	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1617 wdt:P279 ?uri . wd:Q9168 wdt:P279 ?uri . } 
 Где:
 wd:Q1617 именуется как ""урду.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q9168 именуется как ""персидский язык.""
 wdt:P279 именуется как ""подкласс от.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What Wikidata entities have the property ""subclass of"" with the value ""urdu"" and also have the property ""subclass of"" with the value ""Persian language""?"	У урду и персидского языков общие корни?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1617 wdt:P279 ?uri . wd:Q9168 wdt:P279 ?uri . }	"['What', 'Wikidata', 'entities', 'have', 'the', 'property', '``', 'subclass', 'of', ""''"", 'with', 'the', 'value', '``', 'urdu', ""''"", 'and', 'also', 'have', 'the', 'property', '``', 'subclass', 'of', ""''"", 'with', 'the', 'value', '``', 'Persian', 'language', ""''"", '?']"	['У', 'урду', 'и', 'персидского', 'языков', 'общие', 'корни', '?']	0.1693	0.0909	0.0	145.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What Wikidata entities have the property ""subclass of"" with the value ""urdu"" and also have the property ""subclass of"" with the value ""Persian language""?"	Имеют ли одинаковые происождения языки Урду и Персидский?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1617 wdt:P279 ?uri . wd:Q9168 wdt:P279 ?uri . }	"['What', 'Wikidata', 'entities', 'have', 'the', 'property', '``', 'subclass', 'of', ""''"", 'with', 'the', 'value', '``', 'urdu', ""''"", 'and', 'also', 'have', 'the', 'property', '``', 'subclass', 'of', ""''"", 'with', 'the', 'value', '``', 'Persian', 'language', ""''"", '?']"	['Имеют', 'ли', 'одинаковые', 'происождения', 'языки', 'Урду', 'и', 'Персидский', '?']	0.1693	0.0961	0.0	144.0
345	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?movie wdt:P31 wd:Q11424 ; wdt:P162 wd:Q193668 ; wdt:P495 wd:Q29 ; wdt:P161 ?uri . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q11424 именуется как ""фильм.""
 wdt:P162 именуется как ""продюсер.""
 wd:Q193668 именуется как ""Бенисио дель Торо.""
 wdt:P495 именуется как ""страна происхождения.""
 wd:Q29 именуется как ""Испания.""
 wdt:P161 именуется как ""в ролях.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of movies that are of the type ""film"", have a producer named ""Бенисио дель Торо"", are from the country ""Испания"", and have actors in the roles?"	Кто снимался в испанских фильмах cпродюсированных Бенисио дель Торо?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?movie wdt:P31 wd:Q11424 ; wdt:P162 wd:Q193668 ; wdt:P495 wd:Q29 ; wdt:P161 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'movies', 'that', 'are', 'of', 'the', 'type', '``', 'film', ""''"", ',', 'have', 'a', 'producer', 'named', '``', 'Бенисио', 'дель', 'Торо', ""''"", ',', 'are', 'from', 'the', 'country', '``', 'Испания', ""''"", ',', 'and', 'have', 'actors', 'in', 'the', 'roles', '?']"	['Кто', 'снимался', 'в', 'испанских', 'фильмах', 'cпродюсированных', 'Бенисио', 'дель', 'Торо', '?']	0.0719	0.3164	0.0606	147.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of movies that are of the type ""film"", have a producer named ""Бенисио дель Торо"", are from the country ""Испания"", and have actors in the roles?"	Кто снимается в испанских фильмах, спродюссированых Бенисио дель Торо?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?movie wdt:P31 wd:Q11424 ; wdt:P162 wd:Q193668 ; wdt:P495 wd:Q29 ; wdt:P161 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'movies', 'that', 'are', 'of', 'the', 'type', '``', 'film', ""''"", ',', 'have', 'a', 'producer', 'named', '``', 'Бенисио', 'дель', 'Торо', ""''"", ',', 'are', 'from', 'the', 'country', '``', 'Испания', ""''"", ',', 'and', 'have', 'actors', 'in', 'the', 'roles', '?']"	['Кто', 'снимается', 'в', 'испанских', 'фильмах', ',', 'спродюссированых', 'Бенисио', 'дель', 'Торо', '?']	0.0761	0.4118	0.0606	146.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""Какое озеро имеет большую площадь, чем Большое Медвежье озеро?""

Translated SPARQL query to natural language question:

""Which lake has a larger area than Lake Big Bear (Bolshoy Medvedyatoye Ozero or Big Brown Bear Lake)?"""	Больше ли Байкал Великого Медвежьего озера?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q5513> <http://www.wikidata.org/prop/direct/P2046> ?area1 . <http://www.wikidata.org/entity/Q5525> <http://www.wikidata.org/prop/direct/P2046> ?area2 . FILTER(?area1 > ?area2) }	"['``', 'Какое', 'озеро', 'имеет', 'большую', 'площадь', ',', 'чем', 'Большое', 'Медвежье', 'озеро', '?', ""''"", 'Translated', 'SPARQL', 'query', 'to', 'natural', 'language', 'question', ':', ""''"", 'Which', 'lake', 'has', 'a', 'larger', 'area', 'than', 'Lake', 'Big', 'Bear', '(', 'Bolshoy', 'Medvedyatoye', 'Ozero', 'or', 'Big', 'Brown', 'Bear', 'Lake', ')', '?', ""''""]"	['Больше', 'ли', 'Байкал', 'Великого', 'Медвежьего', 'озера', '?']	0.1616	0.0638	0.0	200.0
""Which lake has a larger area than Lake Big Bear (Bolshoy Medvedyatoye Ozero or Big Brown Bear Lake)?"""	Озеро Байкал больше Большого Медвежьего озера?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q5513> <http://www.wikidata.org/prop/direct/P2046> ?area1 . <http://www.wikidata.org/entity/Q5525> <http://www.wikidata.org/prop/direct/P2046> ?area2 . FILTER(?area1 > ?area2) }	"['``', 'Какое', 'озеро', 'имеет', 'большую', 'площадь', ',', 'чем', 'Большое', 'Медвежье', 'озеро', '?', ""''"", 'Translated', 'SPARQL', 'query', 'to', 'natural', 'language', 'question', ':', ""''"", 'Which', 'lake', 'has', 'a', 'larger', 'area', 'than', 'Lake', 'Big', 'Bear', '(', 'Bolshoy', 'Medvedyatoye', 'Ozero', 'or', 'Big', 'Brown', 'Bear', 'Lake', ')', '?', ""''""]"	['Озеро', 'Байкал', 'больше', 'Большого', 'Медвежьего', 'озера', '?']	0.1616	0.0638	0.0	193.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's that represent the foundations and are connected to the property ""состоит из"" of the entity with the label ""Основание"" (Q1564644) in Wikidata?"	Перечислите все книги в серии Азимова Основание?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1564644> <http://www.wikidata.org/prop/direct/P527> ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'that', 'represent', 'the', 'foundations', 'and', 'are', 'connected', 'to', 'the', 'property', '``', 'состоит', 'из', ""''"", 'of', 'the', 'entity', 'with', 'the', 'label', '``', 'Основание', ""''"", '(', 'Q1564644', ')', 'in', 'Wikidata', '?']"	['Перечислите', 'все', 'книги', 'в', 'серии', 'Азимова', 'Основание', '?']	0.1994	0.1714	0.0	151.0
348	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1339 wdt:P19 ?uri . } 
 Где:
 wd:Q1339 именуется как ""Иоганн Себастьян Бах.""
 wdt:P19 именуется как ""место рождения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI labels for the entities described as having been the birthplace of Johannes Sebastian Bach (wd:Q1339)?	Когда родился Бах?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1339 wdt:P19 ?uri . }	['What', 'are', 'the', 'distinct', 'URI', 'labels', 'for', 'the', 'entities', 'described', 'as', 'having', 'been', 'the', 'birthplace', 'of', 'Johannes', 'Sebastian', 'Bach', '(', 'wd', ':', 'Q1339', ')', '?']	['Когда', 'родился', 'Бах', '?']	0.1764	0.08	0.0	125.0
349	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?metro wdt:P31 wd:Q5503 ; wdt:P571 ?inception ; wdt:P131 ?uri . } ORDER BY ?inception LIMIT 1 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q5503 именуется как ""метрополитен.""
 wdt:P571 именуется как ""дата основания / создания / возникновения.""
 wdt:P131 именуется как ""административно-территориальная единица.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the administrative unit with the earliest founding date that is a type of metro (metroystem)?	В каком городе самое старое действующее метро?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?metro wdt:P31 wd:Q5503 ; wdt:P571 ?inception ; wdt:P131 ?uri . } ORDER BY ?inception LIMIT 1	['What', 'is', 'the', 'administrative', 'unit', 'with', 'the', 'earliest', 'founding', 'date', 'that', 'is', 'a', 'type', 'of', 'metro', '(', 'metroystem', ')', '?']	['В', 'каком', 'городе', 'самое', 'старое', 'действующее', 'метро', '?']	0.1818	0.15	0.0	94.0
350	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q125006 wdt:P287 ?uri . } 
 Где:
 wd:Q125006 именуется как ""Бруклинский мост.""
 wdt:P287 именуется как ""проектировщик.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the entities that were designed by the Brooklyn Bridge (wd:Q125006)?	Когда спроектировал Бруклинский мост?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q125006 wdt:P287 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'were', 'designed', 'by', 'the', 'Brooklyn', 'Bridge', '(', 'wd', ':', 'Q125006', ')', '?']"	['Когда', 'спроектировал', 'Бруклинский', 'мост', '?']	0.1796	0.1055	0.0	95.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the entities that were designed by the Brooklyn Bridge (wd:Q125006)?	Кто спроектировал Бруклинский мост?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q125006 wdt:P287 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'were', 'designed', 'by', 'the', 'Brooklyn', 'Bridge', '(', 'wd', ':', 'Q125006', ')', '?']"	['Кто', 'спроектировал', 'Бруклинский', 'мост', '?']	0.1796	0.1055	0.0	95.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the population size of Eurasia? (Return distinct population sizes)	Численность населения Евразии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q5401 wdt:P1082 ?val . }	['What', 'is', 'the', 'population', 'size', 'of', 'Eurasia', '?', '(', 'Return', 'distinct', 'population', 'sizes', ')']	['Численность', 'населения', 'Евразии', '?']	0.1897	0.1429	0.0	71.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the population size of Melbourne?	Какова численность населения Мельбурна, штат Флорида?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q949779 wdt:P1082 ?val . }	['What', 'is', 'the', 'population', 'size', 'of', 'Melbourne', '?']	['Какова', 'численность', 'населения', 'Мельбурна', ',', 'штат', 'Флорида', '?']	0.1982	0.375	0.0	49.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the population size of Melbourne?	Какова общая численность населения Мельбурна, Флорида?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q949779 wdt:P1082 ?val . }	['What', 'is', 'the', 'population', 'size', 'of', 'Melbourne', '?']	['Какова', 'общая', 'численность', 'населения', 'Мельбурна', ',', 'Флорида', '?']	0.1982	0.375	0.0	50.0
354	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q513 wdt:P17 ?uri . } 
 Где:
 wd:Q513 именуется как ""Джомолунгма.""
 wdt:P17 именуется как ""государство.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct countries associated with ""Jomolungma"" (Mount Everest)?"	В какой стране Эверест?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q513 wdt:P17 ?uri . }	"['What', 'are', 'the', 'distinct', 'countries', 'associated', 'with', '``', 'Jomolungma', ""''"", '(', 'Mount', 'Everest', ')', '?']"	['В', 'какой', 'стране', 'Эверест', '?']	0.1883	0.1548	0.0	73.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the schools or movements that were founded by the creators of ""The Three Dancers"" (wd:Q3235867)?"	К какому художественному направлению принадлежит автор Трех танцовщиц?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q3235867 wdt:P170 ?painter . ?painter wdt:P135 ?uri . }	"['What', 'are', 'the', 'schools', 'or', 'movements', 'that', 'were', 'founded', 'by', 'the', 'creators', 'of', '``', 'The', 'Three', 'Dancers', ""''"", '(', 'wd', ':', 'Q3235867', ')', '?']"	['К', 'какому', 'художественному', 'направлению', 'принадлежит', 'автор', 'Трех', 'танцовщиц', '?']	0.1774	0.1321	0.0	97.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the schools or movements that were founded by the creators of ""The Three Dancers"" (wd:Q3235867)?"	К какому художественному течению принадлежал художник Трех танцоров?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q3235867 wdt:P170 ?painter . ?painter wdt:P135 ?uri . }	"['What', 'are', 'the', 'schools', 'or', 'movements', 'that', 'were', 'founded', 'by', 'the', 'creators', 'of', '``', 'The', 'Three', 'Dancers', ""''"", '(', 'wd', ':', 'Q3235867', ')', '?']"	['К', 'какому', 'художественному', 'течению', 'принадлежал', 'художник', 'Трех', 'танцоров', '?']	0.1774	0.1321	0.0	97.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the schools or movements that were founded by the creators of ""The Three Dancers"" (wd:Q3235867)?"	"К какой художественной школе принадлежит художник, нарисовавший картину ""Три танцора""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q3235867 wdt:P170 ?painter . ?painter wdt:P135 ?uri . }	"['What', 'are', 'the', 'schools', 'or', 'movements', 'that', 'were', 'founded', 'by', 'the', 'creators', 'of', '``', 'The', 'Three', 'Dancers', ""''"", '(', 'wd', ':', 'Q3235867', ')', '?']"	"['К', 'какой', 'художественной', 'школе', 'принадлежит', 'художник', ',', 'нарисовавший', 'картину', '``', 'Три', 'танцора', ""''"", '?']"	0.2335	0.4759	0.0	96.0
356	"Имея следующий SPARQL запрос: SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q8641370> <http://www.wikidata.org/prop/direct/P580> ?date  . } 
 Где:
 http://www.wikidata.org/entity/Q8641370 именуется как ""Нормандская операция.""
 http://www.wikidata.org/prop/direct/P580 именуется как ""дата начала.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct dates that the ""Normandska operacijaa"" (Normandian Operation) began?"	Когда началась Нормандская операция	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q8641370> <http://www.wikidata.org/prop/direct/P580> ?date  . }	"['What', 'are', 'the', 'distinct', 'dates', 'that', 'the', '``', 'Normandska', 'operacijaa', ""''"", '(', 'Normandian', 'Operation', ')', 'began', '?']"	['Когда', 'началась', 'Нормандская', 'операция']	0.0	0.0	0.0	87.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which is the longest bridge in terms of length, specified in unified units ( meters or miles), for a given type of bridge that is a subclass of a ""moor"" (wd:Q12280), and has the property ""largest span"" (p:P2787)?"	Какой мост имеет самый длинный пролет?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q12280 ; p:P2787 ?statement . ?statement psv:P2787 ?value . ?value wikibase:quantityAmount ?len . ?value wikibase:quantityUnit ?unit . BIND(IF(?unit = wd:Q11573, ?len, IF(?unit = wd:Q3710,?len*0.3048, IF(?unit = wd:Q253276,?len*1609.34,IF(?unit = wd:Q828224,?len*1000, ?len)))) AS ?lenUnified) } ORDER BY DESC(?lenUnified) LIMIT 1	"['Which', 'is', 'the', 'longest', 'bridge', 'in', 'terms', 'of', 'length', ',', 'specified', 'in', 'unified', 'units', '(', 'meters', 'or', 'miles', ')', ',', 'for', 'a', 'given', 'type', 'of', 'bridge', 'that', 'is', 'a', 'subclass', 'of', 'a', '``', 'moor', ""''"", '(', 'wd', ':', 'Q12280', ')', ',', 'and', 'has', 'the', 'property', '``', 'largest', 'span', ""''"", '(', 'p', ':', 'P2787', ')', '?']"	['Какой', 'мост', 'имеет', 'самый', 'длинный', 'пролет', '?']	0.1556	0.051	0.0	206.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Does a URI exist that is an instance of the concept ""computer game"" and has the label ""Battle Chess"" in English?"	Есть ли видеоигра под названием Battle Chess	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	"prefix rdfs:   <http://www.w3.org/2000/01/rdf-schema#>  ASK WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q7889> . ?uri rdfs:label ""Battle Chess""@en }"	"['Does', 'a', 'URI', 'exist', 'that', 'is', 'an', 'instance', 'of', 'the', 'concept', '``', 'computer', 'game', ""''"", 'and', 'has', 'the', 'label', '``', 'Battle', 'Chess', ""''"", 'in', 'English', '?']"	['Есть', 'ли', 'видеоигра', 'под', 'названием', 'Battle', 'Chess']	0.1177	0.216	0.0	95.0
359	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P119 wd:Q3411252 . } 
 Где:
 wdt:P119 именуется как ""место погребения.""
 wd:Q3411252 именуется как ""Пирамида G1-a.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of the places with the property ""Place of burial"" that have the value ""Piramida G1-a"" for this property?"	Кто был похоронен в Великой пирамиде Гизы	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P119 wd:Q3411252 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'the', 'places', 'with', 'the', 'property', '``', 'Place', 'of', 'burial', ""''"", 'that', 'have', 'the', 'value', '``', 'Piramida', 'G1-a', ""''"", 'for', 'this', 'property', '?']"	['Кто', 'был', 'похоронен', 'в', 'Великой', 'пирамиде', 'Гизы']	0.0	0.0	0.0	136.0
361	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q868 wdt:P737 wd:Q913 . } 
 Где:
 wd:Q868 именуется как ""Аристотель.""
 wdt:P737 именуется как ""испытал влияние от.""
 wd:Q913 именуется как ""Сократ.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""Получить ли мне информацию, что либо Арistoтель (wd:Q868), либо кто-то из него, опытал влияние от Сократ (wd:Q913)?"""	Влиял ли Сократ на Аристотеля	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q868 wdt:P737 wd:Q913 . }	"['``', 'Получить', 'ли', 'мне', 'информацию', ',', 'что', 'либо', 'Арistoтель', '(', 'wd', ':', 'Q868', ')', ',', 'либо', 'кто-то', 'из', 'него', ',', 'опытал', 'влияние', 'от', 'Сократ', '(', 'wd', ':', 'Q913', ')', '?', ""''""]"	['Влиял', 'ли', 'Сократ', 'на', 'Аристотеля']	0.2032	0.1498	0.1905	97.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""Сколько раз личность с ID wd:Q34969 (""Бенджамин Франклин"") является родителями?"""	Сколько детей было у Бенджамина Франклина	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { wd:Q34969 wdt:P40 ?uri . }	"['``', 'Сколько', 'раз', 'личность', 'с', 'ID', 'wd', ':', 'Q34969', '(', '``', 'Бенджамин', 'Франклин', ""''"", ')', 'является', 'родителями', '?', ""''""]"	['Сколько', 'детей', 'было', 'у', 'Бенджамина', 'Франклина']	0.1831	0.1361	0.0	53.0
