id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the number of distinct politicans who studied at institutions, including Columbia University?	Сколько политиков закончили Колумбийский университет?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P69 wd:Q49088 . }	['What', 'is', 'the', 'number', 'of', 'distinct', 'politicans', 'who', 'studied', 'at', 'institutions', ',', 'including', 'Columbia', 'University', '?']	['Сколько', 'политиков', 'закончили', 'Колумбийский', 'университет', '?']	0.1869	0.1616	0.0	96.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the number of distinct politicans who studied at institutions, including Columbia University?	Сколько политиков выпустилось из Колумбийского университета?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P69 wd:Q49088 . }	['What', 'is', 'the', 'number', 'of', 'distinct', 'politicans', 'who', 'studied', 'at', 'institutions', ',', 'including', 'Columbia', 'University', '?']	['Сколько', 'политиков', 'выпустилось', 'из', 'Колумбийского', 'университета', '?']	0.1869	0.1755	0.0	95.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the distinct birth date for the actors in the ""Enchanted"" production?"	Перечислите дни рождения актеров телевизионного шоу Зачарованные.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q162371> <http://www.wikidata.org/prop/direct/P161>/<http://www.wikidata.org/prop/direct/P569> ?date . }	"['What', 'is', 'the', 'distinct', 'birth', 'date', 'for', 'the', 'actors', 'in', 'the', '``', 'Enchanted', ""''"", 'production', '?']"	['Перечислите', 'дни', 'рождения', 'актеров', 'телевизионного', 'шоу', 'Зачарованные', '.']	0.0	0.0	0.0	73.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of organizations that are a subclass of ""организация"" and have the property ""это частный случай понятия"" with value ""организация в электросвязи"" or are directly assigned the property ""организация в электросвязи"", and are located in the country ""Бельгия""?"	Какие телекоммуникационные организации находятся в Бельгии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q43229> } UNION { ?uri <http://www.wikidata.org/prop/direct/P31>/(<http://www.wikidata.org/prop/direct/P279>*) <http://www.wikidata.org/entity/Q43229> } . ?uri <http://www.wikidata.org/prop/direct/P452> <http://www.wikidata.org/entity/Q418> .  ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q31> . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'organizations', 'that', 'are', 'a', 'subclass', 'of', '``', 'организация', ""''"", 'and', 'have', 'the', 'property', '``', 'это', 'частный', 'случай', 'понятия', ""''"", 'with', 'value', '``', 'организация', 'в', 'электросвязи', ""''"", 'or', 'are', 'directly', 'assigned', 'the', 'property', '``', 'организация', 'в', 'электросвязи', ""''"", ',', 'and', 'are', 'located', 'in', 'the', 'country', '``', 'Бельгия', ""''"", '?']"	['Какие', 'телекоммуникационные', 'организации', 'находятся', 'в', 'Бельгии', '?']	0.1851	0.1021	0.0541	245.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of organizations that are a subclass of ""организация"" and have the property ""это частный случай понятия"" with value ""организация в электросвязи"" or are directly assigned the property ""организация в электросвязи"", and are located in the country ""Бельгия""?"	Какие телекоммуникационные компании расположены в Бельгии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q43229> } UNION { ?uri <http://www.wikidata.org/prop/direct/P31>/(<http://www.wikidata.org/prop/direct/P279>*) <http://www.wikidata.org/entity/Q43229> } . ?uri <http://www.wikidata.org/prop/direct/P452> <http://www.wikidata.org/entity/Q418> .  ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q31> . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'organizations', 'that', 'are', 'a', 'subclass', 'of', '``', 'организация', ""''"", 'and', 'have', 'the', 'property', '``', 'это', 'частный', 'случай', 'понятия', ""''"", 'with', 'value', '``', 'организация', 'в', 'электросвязи', ""''"", 'or', 'are', 'directly', 'assigned', 'the', 'property', '``', 'организация', 'в', 'электросвязи', ""''"", ',', 'and', 'are', 'located', 'in', 'the', 'country', '``', 'Бельгия', ""''"", '?']"	['Какие', 'телекоммуникационные', 'компании', 'расположены', 'в', 'Бельгии', '?']	0.1851	0.1021	0.0541	251.0
143	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q23397 ; wdt:P17 wd:Q35 . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q23397 именуется как ""озеро.""
 wdt:P17 именуется как ""государство.""
 wd:Q35 именуется как ""Дания.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct uris of lakes that are located in Denmark?	Перечислите список всех озер Дании.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q23397 ; wdt:P17 wd:Q35 . }	['What', 'are', 'the', 'distinct', 'uris', 'of', 'lakes', 'that', 'are', 'located', 'in', 'Denmark', '?']	['Перечислите', 'список', 'всех', 'озер', 'Дании', '.']	0.0	0.0	0.0	60.0
[How many distinct children does the entity with ID wd:Q43874 (Eddie Murphy) have?]"	Сколько детей имеет Эдди Мерфи?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { wd:Q43874 wdt:P40 ?uri . }	"['``', '[', 'How', 'many', 'distinct', 'children', 'does', 'Eddie', 'Murphy', 'have', '?', ']', ""''"", 'Here', 'is', 'the', 'SPARQL', 'query', 'transformed', 'into', 'a', 'natural', 'language', 'question', ':', '[', 'How', 'many', 'distinct', 'children', 'does', 'the', 'entity', 'with', 'ID', 'wd', ':', 'Q43874', '(', 'Eddie', 'Murphy', ')', 'have', '?', ']']"	['Сколько', 'детей', 'имеет', 'Эдди', 'Мерфи', '?']	0.161	0.0574	0.0	206.0
145	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?type wdt:P279* wd:Q176483 . ?uri wdt:P149 ?type ; wdt:P7959 wd:Q67479626 . } 
 Где:
 wdt:P279 именуется как ""подкласс от.""
 wd:Q176483 именуется как ""готическая архитектура.""
 wdt:P149 именуется как ""архитектурный стиль.""
 wdt:P7959 именуется как ""историческое графство.""
 wd:Q67479626 именуется как ""Кент.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI identifiers of the architectural styles that belong to the class ""Gothic architecture"" and have been used in historical counties with the name ""Kent""?"	Покажите все здания Кента в стиле английской готики.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?type wdt:P279* wd:Q176483 . ?uri wdt:P149 ?type ; wdt:P7959 wd:Q67479626 . }	"['What', 'are', 'the', 'URI', 'identifiers', 'of', 'the', 'architectural', 'styles', 'that', 'belong', 'to', 'the', 'class', '``', 'Gothic', 'architecture', ""''"", 'and', 'have', 'been', 'used', 'in', 'historical', 'counties', 'with', 'the', 'name', '``', 'Kent', ""''"", '?']"	['Покажите', 'все', 'здания', 'Кента', 'в', 'стиле', 'английской', 'готики', '.']	0.0	0.0	0.0	160.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of the entities that have the property ""denomination of money"" with the value ""Fранк КФА BCEAO (Q861690)""?"	В каких странах можно расплачиваться франком западноафриканской CFA?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P38 wd:Q861690 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'the', 'entities', 'that', 'have', 'the', 'property', '``', 'denomination', 'of', 'money', ""''"", 'with', 'the', 'value', '``', 'Fранк', 'КФА', 'BCEAO', '(', 'Q861690', ')', ""''"", '?']"	['В', 'каких', 'странах', 'можно', 'расплачиваться', 'франком', 'западноафриканской', 'CFA', '?']	0.1717	0.1057	0.0	132.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of the entities that have the property ""denomination of money"" with the value ""Fранк КФА BCEAO (Q861690)""?"	В каких странах вы можете расплачиваться КФА франком Западной Африки?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P38 wd:Q861690 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'the', 'entities', 'that', 'have', 'the', 'property', '``', 'denomination', 'of', 'money', ""''"", 'with', 'the', 'value', '``', 'Fранк', 'КФА', 'BCEAO', '(', 'Q861690', ')', ""''"", '?']"	['В', 'каких', 'странах', 'вы', 'можете', 'расплачиваться', 'КФА', 'франком', 'Западной', 'Африки', '?']	0.2042	0.2306	0.069	131.0
148	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q1445650 . ?uri wdt:P31 ?type . } 
 Где:
 wdt:P279 именуется как ""подкласс от.""
 wd:Q1445650 именуется как ""праздник.""
 wdt:P31 именуется как ""это частный случай понятия.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the entities that are subclasses of the ""przdnik."" concept (wd:Q1445650) and represent a ""particular case"" of some other concept (P31)?"	Какие праздники отмечают во всем мире?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q1445650 . ?uri wdt:P31 ?type . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'are', 'subclasses', 'of', 'the', '``', 'przdnik', '.', ""''"", 'concept', '(', 'wd', ':', 'Q1445650', ')', 'and', 'represent', 'a', '``', 'particular', 'case', ""''"", 'of', 'some', 'other', 'concept', '(', 'P31', ')', '?']"	['Какие', 'праздники', 'отмечают', 'во', 'всем', 'мире', '?']	0.1648	0.072	0.0	160.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the entities that are subclasses of the ""przdnik."" concept (wd:Q1445650) and represent a ""particular case"" of some other concept (P31)?"	Какие праздники отмечаются во всем мире?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q1445650 . ?uri wdt:P31 ?type . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'are', 'subclasses', 'of', 'the', '``', 'przdnik', '.', ""''"", 'concept', '(', 'wd', ':', 'Q1445650', ')', 'and', 'represent', 'a', '``', 'particular', 'case', ""''"", 'of', 'some', 'other', 'concept', '(', 'P31', ')', '?']"	['Какие', 'праздники', 'отмечаются', 'во', 'всем', 'мире', '?']	0.1648	0.072	0.0	160.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the entities that are subclasses of the ""przdnik."" concept (wd:Q1445650) and represent a ""particular case"" of some other concept (P31)?"	Какие прадзники отмечаются в мире?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q1445650 . ?uri wdt:P31 ?type . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'are', 'subclasses', 'of', 'the', '``', 'przdnik', '.', ""''"", 'concept', '(', 'wd', ':', 'Q1445650', ')', 'and', 'represent', 'a', '``', 'particular', 'case', ""''"", 'of', 'some', 'other', 'concept', '(', 'P31', ')', '?']"	['Какие', 'прадзники', 'отмечаются', 'в', 'мире', '?']	0.1648	0.0663	0.0	161.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which river has the longest length, in meters, according to Wikidata, with a known length value and an available conversion to meters, if such information is available?	Самая длинная река?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	"PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4022 . ?uri p:P2043 ?stmnode. ?stmnode psv:P2043 ?valuenode . ?valuenode wikibase:quantityAmount ?length . ?valuenode wikibase:quantityUnit ?unit . ?valuenode wikibase:quantityLowerBound ?lowerbound. ?valuenode wikibase:quantityUpperBound ?upperbound. BIND((?upperbound-?lowerbound)/2 AS ?precision). BIND(IF(?precision=0, ?length, (CONCAT(str(?length), ""±"", str(?precision)))) AS ?length2). ?unit p:P2370 ?unitstmnode . ?unitstmnode psv:P2370 ?unitvaluenode . ?unitvaluenode wikibase:quantityAmount ?conversion . ?unitvaluenode wikibase:quantityUnit wd:Q11573 . BIND(?length * ?conversion AS ?length_in_m) . } ORDER BY DESC(?length_in_m) LIMIT 1"	['Which', 'river', 'has', 'the', 'longest', 'length', ',', 'in', 'meters', ',', 'according', 'to', 'Wikidata', ',', 'with', 'a', 'known', 'length', 'value', 'and', 'an', 'available', 'conversion', 'to', 'meters', ',', 'if', 'such', 'information', 'is', 'available', '?']	['Самая', 'длинная', 'река', '?']	0.1701	0.0625	0.0	165.0
150	"Имея следующий SPARQL запрос: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?sub WHERE { ?sub wdt:P571 ?year . ?sub wdt:P31/wdt:P131* wd:Q43229 . FILTER(year(?year) = 1930) . }  
 Где:
 wdt:P571 именуется как ""дата основания / создания / возникновения.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P131 именуется как ""административно-территориальная единица.""
 wd:Q43229 именуется как ""организация.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What organizations were founded or established in the year 1930 and are subclasses of administrative units or part of organizations that are administrative units?	Какие организации были основаны в 1930 году?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?sub WHERE { ?sub wdt:P571 ?year . ?sub wdt:P31/wdt:P131* wd:Q43229 . FILTER(year(?year) = 1930) . } 	['What', 'organizations', 'were', 'founded', 'or', 'established', 'in', 'the', 'year', '1930', 'and', 'are', 'subclasses', 'of', 'administrative', 'units', 'or', 'part', 'of', 'organizations', 'that', 'are', 'administrative', 'units', '?']	['Какие', 'организации', 'были', 'основаны', 'в', '1930', 'году', '?']	0.2098	0.24	0.0769	152.0
151	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?name WHERE { wd:Q567 wdt:P1477 ?name . }  
 Где:
 wd:Q567 именуется как ""Ангела Меркель.""
 wdt:P1477 именуется как ""имя при рождении.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinctive birth names for Angela Merkel?	Какое имя при рождении было у Ангелы Меркель	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?name WHERE { wd:Q567 wdt:P1477 ?name . } 	['What', 'are', 'the', 'distinctive', 'birth', 'names', 'for', 'Angela', 'Merkel', '?']	['Какое', 'имя', 'при', 'рождении', 'было', 'у', 'Ангелы', 'Меркель']	0.0	0.0	0.0	49.0
152	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?o1 WHERE { wd:Q37079 wdt:P26 ?o1 . } 
 Где:
 wd:Q37079 именуется как ""Том Круз.""
 wdt:P26 именуется как ""супруг(а).""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct individuals who are the spouses of ""Tom Cruise"" (wd:Q37079)?"	На ком был женат Том Круз	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?o1 WHERE { wd:Q37079 wdt:P26 ?o1 . }	"['What', 'are', 'the', 'distinct', 'individuals', 'who', 'are', 'the', 'spouses', 'of', '``', 'Tom', 'Cruise', ""''"", '(', 'wd', ':', 'Q37079', ')', '?']"	['На', 'ком', 'был', 'женат', 'Том', 'Круз']	0.0	0.0	0.0	77.0
153	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P176 wd:Q152815 . ?res wdt:P279*/wdt:P31 wd:Q15142889 . }  
 Где:
 wdt:P176 именуется как ""производитель.""
 wd:Q152815 именуется как ""Heckler & Koch.""
 wdt:P279 именуется как ""подкласс от.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q15142889 именуется как ""класс вооружений.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Whichresourschavethemanufacturer""Heckler & Koch""andbelongto class""weapons""asasubclassor directinstanceofaclass?"	Какое оружие разработали Heckler & Koch?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P176 wd:Q152815 . ?res wdt:P279*/wdt:P31 wd:Q15142889 . } 	"['Whichresourschavethemanufacturer', ""''"", 'Heckler', '&', 'Koch', ""''"", 'andbelongto', 'class', ""''"", 'weapons', ""''"", 'asasubclassor', 'directinstanceofaclass', '?']"	['Какое', 'оружие', 'разработали', 'Heckler', '&', 'Koch', '?']	0.1654	0.8021	0.1818	96.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Whichresourschavethemanufacturer""Heckler & Koch""andbelongto class""weapons""asasubclassor directinstanceofaclass?"	Какие виды оружия производит Хеклер и Кох?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P176 wd:Q152815 . ?res wdt:P279*/wdt:P31 wd:Q15142889 . } 	"['Whichresourschavethemanufacturer', ""''"", 'Heckler', '&', 'Koch', ""''"", 'andbelongto', 'class', ""''"", 'weapons', ""''"", 'asasubclassor', 'directinstanceofaclass', '?']"	['Какие', 'виды', 'оружия', 'производит', 'Хеклер', 'и', 'Кох', '?']	0.1897	0.2143	0.0	107.0
154	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P17 wd:Q183 . ?res wdt:P31/wdt:P279* wd:Q515 . ?res wdt:P1082 ?inhabitants . } ORDER BY ?inhabitants LIMIt 1 
 Где:
 wdt:P17 именуется как ""государство.""
 wd:Q183 именуется как ""Германия.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q515 именуется как ""город.""
 wdt:P1082 именуется как ""численность населения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the city with the largest population in a state or country that is a subclass of Germany and has at least one city?

Note: This question assumes that the ""P17 wd:Q183"" condition in the original query is meant to filter results to only those that represent a state or country that is Germany. If this is not the case, then the question may need further refinement."	Какой самый маленький по площади город в Германии	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P17 wd:Q183 . ?res wdt:P31/wdt:P279* wd:Q515 . ?res wdt:P1082 ?inhabitants . } ORDER BY ?inhabitants LIMIt 1	"['What', 'is', 'the', 'city', 'with', 'the', 'largest', 'population', 'in', 'a', 'state', 'or', 'country', 'that', 'is', 'a', 'subclass', 'of', 'Germany', 'and', 'has', 'at', 'least', 'one', 'city', '?', 'Note', ':', 'This', 'question', 'assumes', 'that', 'the', '``', 'P17', 'wd', ':', 'Q183', ""''"", 'condition', 'in', 'the', 'original', 'query', 'is', 'meant', 'to', 'filter', 'results', 'to', 'only', 'those', 'that', 'represent', 'a', 'state', 'or', 'country', 'that', 'is', 'Germany', '.', 'If', 'this', 'is', 'not', 'the', 'case', ',', 'then', 'the', 'question', 'may', 'need', 'further', 'refinement', '.']"	['Какой', 'самый', 'маленький', 'по', 'площади', 'город', 'в', 'Германии']	0.0	0.0	0.0	364.0
Note: This question assumes that the ""P17 wd:Q183"" condition in the original query is meant to filter results to only those that represent a state or country that is Germany. If this is not the case, then the question may need further refinement."	Какой город Германии имеет наименьшую площадь?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P17 wd:Q183 . ?res wdt:P31/wdt:P279* wd:Q515 . ?res wdt:P1082 ?inhabitants . } ORDER BY ?inhabitants LIMIt 1	"['What', 'is', 'the', 'city', 'with', 'the', 'largest', 'population', 'in', 'a', 'state', 'or', 'country', 'that', 'is', 'a', 'subclass', 'of', 'Germany', 'and', 'has', 'at', 'least', 'one', 'city', '?', 'Note', ':', 'This', 'question', 'assumes', 'that', 'the', '``', 'P17', 'wd', ':', 'Q183', ""''"", 'condition', 'in', 'the', 'original', 'query', 'is', 'meant', 'to', 'filter', 'results', 'to', 'only', 'those', 'that', 'represent', 'a', 'state', 'or', 'country', 'that', 'is', 'Germany', '.', 'If', 'this', 'is', 'not', 'the', 'case', ',', 'then', 'the', 'question', 'may', 'need', 'further', 'refinement', '.']"	['Какой', 'город', 'Германии', 'имеет', 'наименьшую', 'площадь', '?']	0.1466	0.0365	0.0	365.0
155	"Имея следующий SPARQL запрос: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?res WHERE { ?mayor wdt:P31 wd:Q5 . ?mayor p:P39 _:a ._:a ps:P39 wd:Q43185970 ._:a pq:P580 ?date . ?mayor wdt:P102 ?res . } ORDER BY DESC(?date) LIMIT 1 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q5 именуется как ""человек.""
 p:P39 именуется как ""занимаемая должность.""
 ps:P39 именуется как ""занимаемая должность.""
 wd:Q43185970 именуется как ""мэр Лиссабона.""
 pq:P580 именуется как ""дата начала.""
 wdt:P102 именуется как ""член политической партии.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which person, who is a human and has been the mayor of Lisbon, held the position of mayor with the latest start date, and is also a member of a political party?	Какая правящая партия в Лиссабоне	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?res WHERE { ?mayor wdt:P31 wd:Q5 . ?mayor p:P39 _:a ._:a ps:P39 wd:Q43185970 ._:a pq:P580 ?date . ?mayor wdt:P102 ?res . } ORDER BY DESC(?date) LIMIT 1	['Which', 'person', ',', 'who', 'is', 'a', 'human', 'and', 'has', 'been', 'the', 'mayor', 'of', 'Lisbon', ',', 'held', 'the', 'position', 'of', 'mayor', 'with', 'the', 'latest', 'start', 'date', ',', 'and', 'is', 'also', 'a', 'member', 'of', 'a', 'political', 'party', '?']	['Какая', 'правящая', 'партия', 'в', 'Лиссабоне']	0.0	0.0	0.0	156.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which person, who is a human and has been the mayor of Lisbon, held the position of mayor with the latest start date, and is also a member of a political party?	Какая партия ялвяется ведущей в Лиссабоне?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?res WHERE { ?mayor wdt:P31 wd:Q5 . ?mayor p:P39 _:a ._:a ps:P39 wd:Q43185970 ._:a pq:P580 ?date . ?mayor wdt:P102 ?res . } ORDER BY DESC(?date) LIMIT 1	['Which', 'person', ',', 'who', 'is', 'a', 'human', 'and', 'has', 'been', 'the', 'mayor', 'of', 'Lisbon', ',', 'held', 'the', 'position', 'of', 'mayor', 'with', 'the', 'latest', 'start', 'date', ',', 'and', 'is', 'also', 'a', 'member', 'of', 'a', 'political', 'party', '?']	['Какая', 'партия', 'ялвяется', 'ведущей', 'в', 'Лиссабоне', '?']	0.167	0.078	0.0	154.0
156	"Имея следующий SPARQL запрос: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?mass WHERE { ?res wdt:P31 wd:Q61702557 . ?res wdt:P2067 ?mass . } ORDER BY ?mass LIMIT 1 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q61702557 именуется как ""спутник Юпитера.""
 wdt:P2067 именуется как ""масса.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the mass of a satellite of Jupiter, identified as the given resource, listed first in the result set?	Сколько весит самый легкий спутник Юпитера	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?mass WHERE { ?res wdt:P31 wd:Q61702557 . ?res wdt:P2067 ?mass . } ORDER BY ?mass LIMIT 1	['What', 'is', 'the', 'mass', 'of', 'a', 'satellite', 'of', 'Jupiter', ',', 'identified', 'as', 'the', 'given', 'resource', ',', 'listed', 'first', 'in', 'the', 'result', 'set', '?']	['Сколько', 'весит', 'самый', 'легкий', 'спутник', 'Юпитера']	0.0	0.0	0.0	104.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""Какое число сотрудников имеет сущность с ID ""IBM"" (IBM.com) в Wikidata?"""	Сколько сотрудников у IBM	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?emloyees WHERE { wd:Q37156 wdt:P1128 ?emloyees . } 	"['``', 'Какое', 'число', 'сотрудников', 'имеет', 'сущность', 'с', 'ID', '``', 'IBM', ""''"", '(', 'IBM.com', ')', 'в', 'Wikidata', '?', ""''""]"	['Сколько', 'сотрудников', 'у', 'IBM']	0.2192	0.2222	0.125	52.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""Какое число сотрудников имеет сущность с ID ""IBM"" (IBM.com) в Wikidata?"""	Сколько людей работает в IBM?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?emloyees WHERE { wd:Q37156 wdt:P1128 ?emloyees . } 	"['``', 'Какое', 'число', 'сотрудников', 'имеет', 'сущность', 'с', 'ID', '``', 'IBM', ""''"", '(', 'IBM.com', ')', 'в', 'Wikidata', '?', ""''""]"	['Сколько', 'людей', 'работает', 'в', 'IBM', '?']	0.2425	0.4308	0.1176	57.0
158	"Имея следующий SPARQL запрос: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT (COUNT(?episode) AS ?count) WHERE { ?episode wdt:P4908 wd:Q5274359 . } 
 Где:
 wdt:P4908 именуется как ""сезон.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the number of seasons for the entity with ID wd:Q5274359?	Перечислите все серии первого сезона телесериала HBO «Клан Сопрано»	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT (COUNT(?episode) AS ?count) WHERE { ?episode wdt:P4908 wd:Q5274359 . }	['What', 'is', 'the', 'number', 'of', 'seasons', 'for', 'the', 'entity', 'with', 'ID', 'wd', ':', 'Q5274359', '?']	['Перечислите', 'все', 'серии', 'первого', 'сезона', 'телесериала', 'HBO', '«', 'Клан', 'Сопрано', '»']	0.0	0.0	0.0	62.0
160	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q237072 wdt:P1113 ?newNumOfEpisodes . wd:Q2367132 wdt:P1113 ?oldNumOfEpisodes . FILTER (?newNumOfEpisodes > ?oldNumOfEpisodes) } 
 Где:
 wd:Q237072 именуется как ""Звёздный крейсер «Галактика».""
 wdt:P1113 именуется как ""количество серий или эпизодов.""
 wd:Q2367132 именуется как ""Звёздный крейсер «Галактика».""
 wdt:P1113 именуется как ""количество серий или эпизодов.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the new number of episodes for ""Звёздный крейсер «Галактика»"" greater than the old number of episodes?"	"В ремейке телесериала ""Звездный крейсер «Галактика»"" больше эпизодов, чем в старом сериале?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q237072 wdt:P1113 ?newNumOfEpisodes . wd:Q2367132 wdt:P1113 ?oldNumOfEpisodes . FILTER (?newNumOfEpisodes > ?oldNumOfEpisodes) }	"['What', 'is', 'the', 'new', 'number', 'of', 'episodes', 'for', '``', 'Звёздный', 'крейсер', '«', 'Галактика', '»', ""''"", 'greater', 'than', 'the', 'old', 'number', 'of', 'episodes', '?']"	"['В', 'ремейке', 'телесериала', '``', 'Звездный', 'крейсер', '«', 'Галактика', '»', ""''"", 'больше', 'эпизодов', ',', 'чем', 'в', 'старом', 'сериале', '?']"	0.1677	1.2691	0.1481	73.0
