id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the city with the largest population, represented as a subclass of the concept ""city"" (wd:Q515), according to Wikidata?"	Какой город самый многонаселенный?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:279* wd:Q515 ; wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1	"['What', 'is', 'the', 'city', 'with', 'the', 'largest', 'population', ',', 'represented', 'as', 'a', 'subclass', 'of', 'the', 'concept', '``', 'city', ""''"", '(', 'wd', ':', 'Q515', ')', ',', 'according', 'to', 'Wikidata', '?']"	['Какой', 'город', 'самый', 'многонаселенный', '?']	0.1726	0.0801	0.0	123.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the city with the largest population, represented as a subclass of the concept ""city"" (wd:Q515), according to Wikidata?"	В каком городе наибольшее количество жителей?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:279* wd:Q515 ; wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1	"['What', 'is', 'the', 'city', 'with', 'the', 'largest', 'population', ',', 'represented', 'as', 'a', 'subclass', 'of', 'the', 'concept', '``', 'city', ""''"", '(', 'wd', ':', 'Q515', ')', ',', 'according', 'to', 'Wikidata', '?']"	['В', 'каком', 'городе', 'наибольшее', 'количество', 'жителей', '?']	0.1726	0.0968	0.0	121.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the city with the largest population, represented as a subclass of the concept ""city"" (wd:Q515), according to Wikidata?"	В каком городе больше всего жителей?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:279* wd:Q515 ; wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1	"['What', 'is', 'the', 'city', 'with', 'the', 'largest', 'population', ',', 'represented', 'as', 'a', 'subclass', 'of', 'the', 'concept', '``', 'city', ""''"", '(', 'wd', ':', 'Q515', ')', ',', 'according', 'to', 'Wikidata', '?']"	['В', 'каком', 'городе', 'больше', 'всего', 'жителей', '?']	0.1726	0.0968	0.0	121.0
280	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P488 wd:Q22686 ; wdt:P31/wdt:P279* wd:Q4830453 . MINUS { ?uri wdt:P576 ?closed } } 
 Где:
 wdt:P488 именуется как ""руководитель.""
 wd:Q22686 именуется как ""Дональд Трамп.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q4830453 именуется как ""бизнес-предприятие.""
 wdt:P576 именуется как ""дата прекращения существования.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of businesses that Donald Trump headed but are not marked as closed? (Note: A business is a type of entity, and can be a subclass of a business entity.)	Какое направление бизнеса является главным для Дональда Трампа?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P488 wd:Q22686 ; wdt:P31/wdt:P279* wd:Q4830453 . MINUS { ?uri wdt:P576 ?closed } }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'businesses', 'that', 'Donald', 'Trump', 'headed', 'but', 'are', 'not', 'marked', 'as', 'closed', '?', '(', 'Note', ':', 'A', 'business', 'is', 'a', 'type', 'of', 'entity', ',', 'and', 'can', 'be', 'a', 'subclass', 'of', 'a', 'business', 'entity', '.', ')']"	['Какое', 'направление', 'бизнеса', 'является', 'главным', 'для', 'Дональда', 'Трампа', '?']	0.1635	0.0773	0.0	172.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of businesses that Donald Trump headed but are not marked as closed? (Note: A business is a type of entity, and can be a subclass of a business entity.)	Основной бизнес Дональда Трампа?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P488 wd:Q22686 ; wdt:P31/wdt:P279* wd:Q4830453 . MINUS { ?uri wdt:P576 ?closed } }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'businesses', 'that', 'Donald', 'Trump', 'headed', 'but', 'are', 'not', 'marked', 'as', 'closed', '?', '(', 'Note', ':', 'A', 'business', 'is', 'a', 'type', 'of', 'entity', ',', 'and', 'can', 'be', 'a', 'subclass', 'of', 'a', 'business', 'entity', '.', ')']"	['Основной', 'бизнес', 'Дональда', 'Трампа', '?']	0.1635	0.0566	0.0	176.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of businesses that Donald Trump headed but are not marked as closed? (Note: A business is a type of entity, and can be a subclass of a business entity.)	Какой основной бизнес Дональда Трампа?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P488 wd:Q22686 ; wdt:P31/wdt:P279* wd:Q4830453 . MINUS { ?uri wdt:P576 ?closed } }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'businesses', 'that', 'Donald', 'Trump', 'headed', 'but', 'are', 'not', 'marked', 'as', 'closed', '?', '(', 'Note', ':', 'A', 'business', 'is', 'a', 'type', 'of', 'entity', ',', 'and', 'can', 'be', 'a', 'subclass', 'of', 'a', 'business', 'entity', '.', ')']"	['Какой', 'основной', 'бизнес', 'Дональда', 'Трампа', '?']	0.1635	0.063	0.0	175.0
281	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q170645 wdt:P3967 ?finalEvent . ?finalEvent wdt:P580 ?val . } 
 Где:
 wd:Q170645 именуется как ""чемпионат мира по футболу 2018.""
 wdt:P3967 именуется как ""финальная часть.""
 wdt:P580 именуется как ""дата начала.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the distinct starting date for each final event in the 2018 World Cup Championship?	Когда начнется финальный матч чемпионата мира по футболу 2018?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q170645 wdt:P3967 ?finalEvent . ?finalEvent wdt:P580 ?val . }	['What', 'is', 'the', 'distinct', 'starting', 'date', 'for', 'each', 'final', 'event', 'in', 'the', '2018', 'World', 'Cup', 'Championship', '?']	['Когда', 'начнется', 'финальный', 'матч', 'чемпионата', 'мира', 'по', 'футболу', '2018', '?']	0.2207	0.3908	0.0	82.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the distinct starting date for each final event in the 2018 World Cup Championship?	Когда был начат финальный матч чемпионата мира по футболу 2018 года?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q170645 wdt:P3967 ?finalEvent . ?finalEvent wdt:P580 ?val . }	['What', 'is', 'the', 'distinct', 'starting', 'date', 'for', 'each', 'final', 'event', 'in', 'the', '2018', 'World', 'Cup', 'Championship', '?']	['Когда', 'был', 'начат', 'финальный', 'матч', 'чемпионата', 'мира', 'по', 'футболу', '2018', 'года', '?']	0.2207	0.4218	0.0769	80.0
282	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q2001>} 
 Где:
 http://www.wikidata.org/prop/direct/P57 именуется как ""режиссёр.""
 http://www.wikidata.org/entity/Q2001 именуется как ""Стэнли Кубрик.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the individuals who have been the director for Stanley Kubrick?	Какие фильмы срежессировал Стенли Кубрик?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q2001>}	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'individuals', 'who', 'have', 'been', 'the', 'director', 'for', 'Stanley', 'Kubrick', '?']"	['Какие', 'фильмы', 'срежессировал', 'Стенли', 'Кубрик', '?']	0.1843	0.1436	0.0	89.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the individuals who have been the director for Stanley Kubrick?	Какие фильмы снял Стэнли Кубрик?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q2001>}	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'individuals', 'who', 'have', 'been', 'the', 'director', 'for', 'Stanley', 'Kubrick', '?']"	['Какие', 'фильмы', 'снял', 'Стэнли', 'Кубрик', '?']	0.1843	0.1436	0.0	89.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the individuals who have been the director for Stanley Kubrick?	Какие фильмы срежисировал Стэнли Кубрик?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q2001>}	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'individuals', 'who', 'have', 'been', 'the', 'director', 'for', 'Stanley', 'Kubrick', '?']"	['Какие', 'фильмы', 'срежисировал', 'Стэнли', 'Кубрик', '?']	0.1843	0.1436	0.0	89.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the population size of ""Iraq"" described by the property ""P1082: численность населения""?"	Какова численность населения Ирака?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q796 wdt:P1082 ?val . }	"['What', 'is', 'the', 'population', 'size', 'of', '``', 'Iraq', ""''"", 'described', 'by', 'the', 'property', '``', 'P1082', ':', 'численность', 'населения', ""''"", '?']"	['Какова', 'численность', 'населения', 'Ирака', '?']	0.1465	0.3483	0.1176	77.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the population size of ""Iraq"" described by the property ""P1082: численность населения""?"	Каково население Ирака?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q796 wdt:P1082 ?val . }	"['What', 'is', 'the', 'population', 'size', 'of', '``', 'Iraq', ""''"", 'described', 'by', 'the', 'property', '``', 'P1082', ':', 'численность', 'населения', ""''"", '?']"	['Каково', 'население', 'Ирака', '?']	0.1818	0.1	0.0	89.0
284	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { ?uri wdt:P17 wd:Q16 ; wdt:P31/wdt:P279* wd:Q515 ; wdt:P1082 ?val } ORDER BY DESC(?val) LIMIT 1 
 Где:
 wdt:P17 именуется как ""государство.""
 wd:Q16 именуется как ""Канада.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q515 именуется как ""город.""
 wdt:P1082 именуется как ""численность населения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the population-sized city (with the highest population) that is a subclass of a city and is located in a country called Canada, and is also a part of a state or territory?

(Note: In SPARQL, the query is selecting the city with the highest population among all cities that are subclasses of a city, and are located in the country called Canada (wd:Q16), and are also parts of a state or territory (wd:Q515). The result is ordered in descending order of population size, and only the top result is returned.)"	Какова численность населения крупнейшего города Канады?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { ?uri wdt:P17 wd:Q16 ; wdt:P31/wdt:P279* wd:Q515 ; wdt:P1082 ?val } ORDER BY DESC(?val) LIMIT 1	['What', 'is', 'the', 'population-sized', 'city', '(', 'with', 'the', 'highest', 'population', ')', 'that', 'is', 'a', 'subclass', 'of', 'a', 'city', 'and', 'is', 'located', 'in', 'a', 'country', 'called', 'Canada', ',', 'and', 'is', 'also', 'a', 'part', 'of', 'a', 'state', 'or', 'territory', '?', '(', 'Note', ':', 'In', 'SPARQL', ',', 'the', 'query', 'is', 'selecting', 'the', 'city', 'with', 'the', 'highest', 'population', 'among', 'all', 'cities', 'that', 'are', 'subclasses', 'of', 'a', 'city', ',', 'and', 'are', 'located', 'in', 'the', 'country', 'called', 'Canada', '(', 'wd', ':', 'Q16', ')', ',', 'and', 'are', 'also', 'parts', 'of', 'a', 'state', 'or', 'territory', '(', 'wd', ':', 'Q515', ')', '.', 'The', 'result', 'is', 'ordered', 'in', 'descending', 'order', 'of', 'population', 'size', ',', 'and', 'only', 'the', 'top', 'result', 'is', 'returned', '.', ')']	['Какова', 'численность', 'населения', 'крупнейшего', 'города', 'Канады', '?']	0.1364	0.0248	0.0	509.0
(Note: In SPARQL, the query is selecting the city with the highest population among all cities that are subclasses of a city, and are located in the country called Canada (wd:Q16), and are also parts of a state or territory (wd:Q515). The result is ordered in descending order of population size, and only the top result is returned.)"	Какое количество жителей в самом большом городе Канады?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { ?uri wdt:P17 wd:Q16 ; wdt:P31/wdt:P279* wd:Q515 ; wdt:P1082 ?val } ORDER BY DESC(?val) LIMIT 1	['What', 'is', 'the', 'population-sized', 'city', '(', 'with', 'the', 'highest', 'population', ')', 'that', 'is', 'a', 'subclass', 'of', 'a', 'city', 'and', 'is', 'located', 'in', 'a', 'country', 'called', 'Canada', ',', 'and', 'is', 'also', 'a', 'part', 'of', 'a', 'state', 'or', 'territory', '?', '(', 'Note', ':', 'In', 'SPARQL', ',', 'the', 'query', 'is', 'selecting', 'the', 'city', 'with', 'the', 'highest', 'population', 'among', 'all', 'cities', 'that', 'are', 'subclasses', 'of', 'a', 'city', ',', 'and', 'are', 'located', 'in', 'the', 'country', 'called', 'Canada', '(', 'wd', ':', 'Q16', ')', ',', 'and', 'are', 'also', 'parts', 'of', 'a', 'state', 'or', 'territory', '(', 'wd', ':', 'Q515', ')', '.', 'The', 'result', 'is', 'ordered', 'in', 'descending', 'order', 'of', 'population', 'size', ',', 'and', 'only', 'the', 'top', 'result', 'is', 'returned', '.', ')']	['Какое', 'количество', 'жителей', 'в', 'самом', 'большом', 'городе', 'Канады', '?']	0.1364	0.0281	0.0	507.0
(Note: In SPARQL, the query is selecting the city with the highest population among all cities that are subclasses of a city, and are located in the country called Canada (wd:Q16), and are also parts of a state or territory (wd:Q515). The result is ordered in descending order of population size, and only the top result is returned.)"	Сколько жителей проживает в крупнейшем городе Канады?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { ?uri wdt:P17 wd:Q16 ; wdt:P31/wdt:P279* wd:Q515 ; wdt:P1082 ?val } ORDER BY DESC(?val) LIMIT 1	['What', 'is', 'the', 'population-sized', 'city', '(', 'with', 'the', 'highest', 'population', ')', 'that', 'is', 'a', 'subclass', 'of', 'a', 'city', 'and', 'is', 'located', 'in', 'a', 'country', 'called', 'Canada', ',', 'and', 'is', 'also', 'a', 'part', 'of', 'a', 'state', 'or', 'territory', '?', '(', 'Note', ':', 'In', 'SPARQL', ',', 'the', 'query', 'is', 'selecting', 'the', 'city', 'with', 'the', 'highest', 'population', 'among', 'all', 'cities', 'that', 'are', 'subclasses', 'of', 'a', 'city', ',', 'and', 'are', 'located', 'in', 'the', 'country', 'called', 'Canada', '(', 'wd', ':', 'Q16', ')', ',', 'and', 'are', 'also', 'parts', 'of', 'a', 'state', 'or', 'territory', '(', 'wd', ':', 'Q515', ')', '.', 'The', 'result', 'is', 'ordered', 'in', 'descending', 'order', 'of', 'population', 'size', ',', 'and', 'only', 'the', 'top', 'result', 'is', 'returned', '.', ')']	['Сколько', 'жителей', 'проживает', 'в', 'крупнейшем', 'городе', 'Канады', '?']	0.1364	0.0265	0.0	508.0
285	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q30971 wdt:P36 ?capital . ?capital wdt:P6 ?uri . } 
 Где:
 wd:Q30971 именуется как ""Французская Полинезия.""
 wdt:P36 именуется как ""административный центр.""
 wdt:P6 именуется как ""глава правительства.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the capitals of French Polynesia that have a head of government?	Кто является мэром столицы Французской Полинезии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q30971 wdt:P36 ?capital . ?capital wdt:P6 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'capitals', 'of', 'French', 'Polynesia', 'that', 'have', 'a', 'head', 'of', 'government', '?']"	['Кто', 'является', 'мэром', 'столицы', 'Французской', 'Полинезии', '?']	0.1831	0.1478	0.0	89.0
286	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?movie wdt:P31 wd:Q11424 ; wdt:P57 wd:Q16297  ; wdt:P161 ?uri . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q11424 именуется как ""фильм.""
 wdt:P57 именуется как ""режиссёр.""
 wd:Q16297 именуется как ""Шетнер, Уильям.""
 wdt:P161 именуется как ""в ролях.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinctive films where William Shatner (wd:Q16297) acted in the roles?	Назови мне всех актеров, которые снимались в фильмах cпродюсированных Уильямом Шетнером?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?movie wdt:P31 wd:Q11424 ; wdt:P57 wd:Q16297  ; wdt:P161 ?uri . }	['What', 'are', 'the', 'distinctive', 'films', 'where', 'William', 'Shatner', '(', 'wd', ':', 'Q16297', ')', 'acted', 'in', 'the', 'roles', '?']	['Назови', 'мне', 'всех', 'актеров', ',', 'которые', 'снимались', 'в', 'фильмах', 'cпродюсированных', 'Уильямом', 'Шетнером', '?']	0.1843	0.2056	0.0	83.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinctive films where William Shatner (wd:Q16297) acted in the roles?	Перечислите все актеров, снимавшихся в фильмах, где режиссером является Уильям Шатнер?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?movie wdt:P31 wd:Q11424 ; wdt:P57 wd:Q16297  ; wdt:P161 ?uri . }	['What', 'are', 'the', 'distinctive', 'films', 'where', 'William', 'Shatner', '(', 'wd', ':', 'Q16297', ')', 'acted', 'in', 'the', 'roles', '?']	['Перечислите', 'все', 'актеров', ',', 'снимавшихся', 'в', 'фильмах', ',', 'где', 'режиссером', 'является', 'Уильям', 'Шатнер', '?']	0.1843	0.2115	0.0	81.0
287	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q76717 wdt:P2048 ?val . } 
 Где:
 wd:Q76717 именуется как ""Клаудия Шиффер.""
 wdt:P2048 именуется как ""высота/рост.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the height or rost of Claudia Schiffer? (Return distinct height or rost values for Claudia Schiffer)	Какой рост у Клаудии Шиффер?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q76717 wdt:P2048 ?val . }	['What', 'is', 'the', 'height', 'or', 'rost', 'of', 'Claudia', 'Schiffer', '?', '(', 'Return', 'distinct', 'height', 'or', 'rost', 'values', 'for', 'Claudia', 'Schiffer', ')']	['Какой', 'рост', 'у', 'Клаудии', 'Шиффер', '?']	0.1807	0.1231	0.0	103.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the height or rost of Claudia Schiffer? (Return distinct height or rost values for Claudia Schiffer)	Какой рост Клаудии Шиффер?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q76717 wdt:P2048 ?val . }	['What', 'is', 'the', 'height', 'or', 'rost', 'of', 'Claudia', 'Schiffer', '?', '(', 'Return', 'distinct', 'height', 'or', 'rost', 'values', 'for', 'Claudia', 'Schiffer', ')']	['Какой', 'рост', 'Клаудии', 'Шиффер', '?']	0.1807	0.1106	0.0	104.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the count of distinct countries where the population density is greater than the population density of Germany?

289	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P17 wd:Q38 ; wdt:P2044 ?elevation . } ORDER BY DESC(?elevation) LIMIT 1 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q8502 именуется как ""гора.""
 wdt:P17 именуется как ""государство.""
 wd:Q38 именуется как ""Италия.""
 wdt:P2044 именуется как ""высота над уровнем моря.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the highest mountain in Italy in terms of elevation?	Какая самая высокая гора в Италии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P17 wd:Q38 ; wdt:P2044 ?elevation . } ORDER BY DESC(?elevation) LIMIT 1	['What', 'is', 'the', 'highest', 'mountain', 'in', 'Italy', 'in', 'terms', 'of', 'elevation', '?']	['Какая', 'самая', 'высокая', 'гора', 'в', 'Италии', '?']	0.1926	0.2339	0.0	54.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the highest mountain in Italy in terms of elevation?	Какая самая высокая гора Италии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P17 wd:Q38 ; wdt:P2044 ?elevation . } ORDER BY DESC(?elevation) LIMIT 1	['What', 'is', 'the', 'highest', 'mountain', 'in', 'Italy', 'in', 'terms', 'of', 'elevation', '?']	['Какая', 'самая', 'высокая', 'гора', 'Италии', '?']	0.1926	0.2154	0.0	55.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that are instances of a game and have a publisher, which is a subclass of ""thing"" (instance of wd:Q11410) and have a publisher (instance of wd:Q928726) as a subclass?"	Назови все игры студии GMT.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q11410 ; wdt:P123 wd:Q928726 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'are', 'instances', 'of', 'a', 'game', 'and', 'have', 'a', 'publisher', ',', 'which', 'is', 'a', 'subclass', 'of', '``', 'thing', ""''"", '(', 'instance', 'of', 'wd', ':', 'Q11410', ')', 'and', 'have', 'a', 'publisher', '(', 'instance', 'of', 'wd', ':', 'Q928726', ')', 'as', 'a', 'subclass', '?']"	['Назови', 'все', 'игры', 'студии', 'GMT', '.']	0.0	0.0	0.0	202.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the entities that have ""Surinam"" as their official language?"	Какой официальный язык в Суринам?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q730> <http://www.wikidata.org/prop/direct/P37> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'have', '``', 'Surinam', ""''"", 'as', 'their', 'official', 'language', '?']"	['Какой', 'официальный', 'язык', 'в', 'Суринам', '?']	0.1831	0.1361	0.0	86.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the entities that have ""Surinam"" as their official language?"	Какая официальный язык Суринама?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q730> <http://www.wikidata.org/prop/direct/P37> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'have', '``', 'Surinam', ""''"", 'as', 'their', 'official', 'language', '?']"	['Какая', 'официальный', 'язык', 'Суринама', '?']	0.1831	0.1222	0.0	87.0
292	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q214622> <http://www.wikidata.org/prop/direct/P20> ?uri } 
 Где:
 http://www.wikidata.org/entity/Q214622 именуется как ""Никос Казандзакис.""
 http://www.wikidata.org/prop/direct/P20 именуется как ""место смерти.""
293	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q14169302> <http://www.wikidata.org/prop/direct/P527> ?uri} 
 Где:
 http://www.wikidata.org/prop/direct/P527 именуется как ""состоит из.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI entities that the entity with ID Q14169302 ""consists of""?"	Какой состав шоколадного печенья?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q14169302> <http://www.wikidata.org/prop/direct/P527> ?uri}	"['What', 'are', 'the', 'distinct', 'URI', 'entities', 'that', 'the', 'entity', 'with', 'ID', 'Q14169302', '``', 'consists', 'of', ""''"", '?']"	['Какой', 'состав', 'шоколадного', 'печенья', '?']	0.1856	0.1366	0.0	79.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI entities that the entity with ID Q14169302 ""consists of""?"	Что входит в состав печенья с шоколадной крошкой?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q14169302> <http://www.wikidata.org/prop/direct/P527> ?uri}	"['What', 'are', 'the', 'distinct', 'URI', 'entities', 'that', 'the', 'entity', 'with', 'ID', 'Q14169302', '``', 'consists', 'of', ""''"", '?']"	['Что', 'входит', 'в', 'состав', 'печенья', 'с', 'шоколадной', 'крошкой', '?']	0.1856	0.1865	0.0	75.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the countries that Q6386177 (a specific entity on Wikidata) is the capital city of?	В какой стране находится озеро Лимерик?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q6386177> <http://www.wikidata.org/prop/direct/P17> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'countries', 'that', 'Q6386177', '(', 'a', 'specific', 'entity', 'on', 'Wikidata', ')', 'is', 'the', 'capital', 'city', 'of', '?']"	['В', 'какой', 'стране', 'находится', 'озеро', 'Лимерик', '?']	0.1774	0.117	0.0	108.0
296	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P463 wd:Q7256860 . } 
 Где:
 wdt:P463 именуется как ""участник организации или коллектива.""
 wd:Q7256860 именуется как ""The Prodigy.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers for entities that are participants of ""The Prodigy"" organization or collective, according to Wikidata, using property ""участник организации или коллектива"" (P463)?"	Перечислите всех участников Prodigy.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P463 wd:Q7256860 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'for', 'entities', 'that', 'are', 'participants', 'of', '``', 'The', 'Prodigy', ""''"", 'organization', 'or', 'collective', ',', 'according', 'to', 'Wikidata', ',', 'using', 'property', '``', 'участник', 'организации', 'или', 'коллектива', ""''"", '(', 'P463', ')', '?']"	['Перечислите', 'всех', 'участников', 'Prodigy', '.']	0.167	0.0645	0.0	189.0
297	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q220> <http://www.wikidata.org/prop/direct/P421> ?uri } 
 Где:
 http://www.wikidata.org/entity/Q220 именуется как ""Рим.""
 http://www.wikidata.org/prop/direct/P421 именуется как ""часовой пояс.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URLs (?uri) for entities that have the ""часовой пояс"" (P421) property with a value connected to the entity with the label ""Рим"" (Q220)?"	В каком часовом поясе Рим?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q220> <http://www.wikidata.org/prop/direct/P421> ?uri }	"['What', 'are', 'the', 'distinct', 'URLs', '(', '?', 'uri', ')', 'for', 'entities', 'that', 'have', 'the', '``', 'часовой', 'пояс', ""''"", '(', 'P421', ')', 'property', 'with', 'a', 'value', 'connected', 'to', 'the', 'entity', 'with', 'the', 'label', '``', 'Рим', ""''"", '(', 'Q220', ')', '?']"	['В', 'каком', 'часовом', 'поясе', 'Рим', '?']	0.196	0.1326	0.0	139.0
299	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q151114 wdt:P658 ?track . ?track wdt:P162 ?uri . } 
 Где:
 wd:Q151114 именуется как ""The Wall.""
 wdt:P658 именуется как ""композиции.""
 wdt:P162 именуется как ""продюсер.""
