id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the first U-Bahn system, along with the date of its establishment, that is administratively located in a particular entity?	Welche Stadt hat die älteste noch fahrende U-Bahn?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?metro wdt:P31 wd:Q5503 ; wdt:P571 ?inception ; wdt:P131 ?uri . } ORDER BY ?inception LIMIT 1	['What', 'is', 'the', 'first', 'U-Bahn', 'system', ',', 'along', 'with', 'the', 'date', 'of', 'its', 'establishment', ',', 'that', 'is', 'administratively', 'located', 'in', 'a', 'particular', 'entity', '?']	['Welche', 'Stadt', 'hat', 'die', 'älteste', 'noch', 'fahrende', 'U-Bahn', '?']	0.211	0.2642	0.0	102.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct designers of the Brooklyn Bridge?	Wer hat die Brookly Brücke entworfen?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q125006 wdt:P287 ?uri . }	['What', 'are', 'the', 'distinct', 'designers', 'of', 'the', 'Brooklyn', 'Bridge', '?']	['Wer', 'hat', 'die', 'Brookly', 'Brücke', 'entworfen', '?']	0.1955	0.2807	0.0	40.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What is the population size for Melbourne? (In SPARQL: SELECT DISTINCT ?val WHERE { wd: ""Melbourne"" wdt:P1082 ?val . })"	Wie viele Einwohner hat Melbourne in Florida?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q949779 wdt:P1082 ?val . }	"['What', 'is', 'the', 'population', 'size', 'for', 'Melbourne', '?', '(', 'In', 'SPARQL', ':', 'SELECT', 'DISTINCT', '?', 'val', 'WHERE', '{', 'wd', ':', '``', 'Melbourne', ""''"", 'wdt', ':', 'P1082', '?', 'val', '.', '}', ')']"	['Wie', 'viele', 'Einwohner', 'hat', 'Melbourne', 'in', 'Florida', '?']	0.2032	0.1935	0.0	94.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which countries does Mount Everest belong to?	In welchem Land liegt der Mount Everest?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q513 wdt:P17 ?uri . }	['Which', 'countries', 'does', 'Mount', 'Everest', 'belong', 'to', '?']	['In', 'welchem', 'Land', 'liegt', 'der', 'Mount', 'Everest', '?']	0.2178	1.125	0.1429	28.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of the artists who have produced works in the genre?

Given that:
<wdt:P170> has the label ""Creator""
<wdt:P135> has the label ""Art Style""

Therefore, the query in natural language would be:

Find distinct URI's of artists whose works have a particular art style."	Zu welcher Künstlerbewegung gehört der Maler von den drei Tänzerinnen?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q3235867 wdt:P170 ?painter . ?painter wdt:P135 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'artists', 'who', 'have', 'produced', 'works', 'in', 'the', 'genre', '?', 'Given', 'that', ':', '<', 'wdt', ':', 'P170', '>', 'has', 'the', 'label', '``', 'Creator', ""''"", '<', 'wdt', ':', 'P135', '>', 'has', 'the', 'label', '``', 'Art', 'Style', ""''"", 'Therefore', ',', 'the', 'query', 'in', 'natural', 'language', 'would', 'be', ':', 'Find', 'distinct', 'URI', ""'s"", 'of', 'artists', 'whose', 'works', 'have', 'a', 'particular', 'art', 'style', '.']"	['Zu', 'welcher', 'Künstlerbewegung', 'gehört', 'der', 'Maler', 'von', 'den', 'drei', 'Tänzerinnen', '?']	0.1503	0.0516	0.0	249.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the distinct start time point for Operation Overlord?	Wann startete die Operation Overlord?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q8641370> <http://www.wikidata.org/prop/direct/P580> ?date  . }	['What', 'is', 'the', 'distinct', 'start', 'time', 'point', 'for', 'Operation', 'Overlord', '?']	['Wann', 'startete', 'die', 'Operation', 'Overlord', '?']	0.1858	0.705	0.2667	28.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which is the bridge with the longest span (in meters) among all bridges that have a known length?	Wie heißt die längste Brücke?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q12280 ; p:P2787 ?statement . ?statement psv:P2787 ?value . ?value wikibase:quantityAmount ?len . ?value wikibase:quantityUnit ?unit . BIND(IF(?unit = wd:Q11573, ?len, IF(?unit = wd:Q3710,?len*0.3048, IF(?unit = wd:Q253276,?len*1609.34,IF(?unit = wd:Q828224,?len*1000, ?len)))) AS ?lenUnified) } ORDER BY DESC(?lenUnified) LIMIT 1	['Which', 'is', 'the', 'bridge', 'with', 'the', 'longest', 'span', '(', 'in', 'meters', ')', 'among', 'all', 'bridges', 'that', 'have', 'a', 'known', 'length', '?']	['Wie', 'heißt', 'die', 'längste', 'Brücke', '?']	0.1807	0.1231	0.0	76.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What is the label of a resource that is a subclass of ""is a. Computer Game"" and has the label ""Battle Chess"" in English?"	Gibt es eine Videospiel, das Ballte Chess heißt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	"prefix rdfs:   <http://www.w3.org/2000/01/rdf-schema#>  ASK WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q7889> . ?uri rdfs:label ""Battle Chess""@en }"	"['What', 'is', 'the', 'label', 'of', 'a', 'resource', 'that', 'is', 'a', 'subclass', 'of', '``', 'is', 'a', '.', 'Computer', 'Game', ""''"", 'and', 'has', 'the', 'label', '``', 'Battle', 'Chess', ""''"", 'in', 'English', '?']"	['Gibt', 'es', 'eine', 'Videospiel', ',', 'das', 'Ballte', 'Chess', 'heißt', '?']	0.2042	0.2215	0.0	89.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of resources that have the property ""Burial place"" with value ""Q3411252"" (Religion, Christianity)?"	Wer wurde in der Großen Pyramide von Gizeh bestattet?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P119 wd:Q3411252 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'resources', 'that', 'have', 'the', 'property', '``', 'Burial', 'place', ""''"", 'with', 'value', '``', 'Q3411252', ""''"", '(', 'Religion', ',', 'Christianity', ')', '?']"	['Wer', 'wurde', 'in', 'der', 'Großen', 'Pyramide', 'von', 'Gizeh', 'bestattet', '?']	0.1745	0.123	0.0	99.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"""Frage: Hat Aristoteles beeinflusst Sokrates?"""	Hat Socrates Aristoteles beeinflusst?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q868 wdt:P737 wd:Q913 . }	"['``', 'Frage', ':', 'Hat', 'Aristoteles', 'beeinflusst', 'Sokrates', '?', ""''""]"	['Hat', 'Socrates', 'Aristoteles', 'beeinflusst', '?']	0.2228	1.032	0.4444	21.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct headquarter locations of the Secret Intelligence Service?	In welcher britischen Stadt hat das MI6 sein Hauptquartier?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q184560> <http://www.wikidata.org/prop/direct/P159> ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q515> . }	['What', 'are', 'the', 'distinct', 'headquarter', 'locations', 'of', 'the', 'Secret', 'Intelligence', 'Service', '?']	['In', 'welcher', 'britischen', 'Stadt', 'hat', 'das', 'MI6', 'sein', 'Hauptquartier', '?']	0.1926	0.2768	0.0	57.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of the creators of ""Family Guy""?"	Wer hat Family Guy erfunden?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q5930> <http://www.wikidata.org/prop/direct/P170> ?uri}	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'creators', 'of', '``', 'Family', 'Guy', ""''"", '?']"	['Wer', 'hat', 'Family', 'Guy', 'erfunden', '?']	0.1664	0.517	0.0	48.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct entities that are the children of Elvis Presley?	Wie heißen die Enkelkinder von Elvis Presley?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT DISTINCT ?o2 WHERE { <http://www.wikidata.org/entity/Q303>  <http://www.wikidata.org/prop/direct/P40>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P40> ?o2 }	['What', 'are', 'the', 'distinct', 'entities', 'that', 'are', 'the', 'children', 'of', 'Elvis', 'Presley', '?']	['Wie', 'heißen', 'die', 'Enkelkinder', 'von', 'Elvis', 'Presley', '?']	0.163	0.6923	0.2353	39.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the distinct date of the auction of the Ming Empire?	Wann hat sich die Ming Dynastie aufgelöst?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q9903> <http://www.wikidata.org/prop/direct/P576> ?date . }	['What', 'is', 'the', 'distinct', 'date', 'of', 'the', 'auction', 'of', 'the', 'Ming', 'Empire', '?']	['Wann', 'hat', 'sich', 'die', 'Ming', 'Dynastie', 'aufgelöst', '?']	0.2273	0.4615	0.125	42.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the official website and place of death for Abraham Lincoln?	Hat der Sterbeort von Abraham Lincoln eine Internetseite?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q91>  <http://www.wikidata.org/prop/direct/P20>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P856>  ?o2 .  }  	['What', 'is', 'the', 'official', 'website', 'and', 'place', 'of', 'death', 'for', 'Abraham', 'Lincoln', '?']	['Hat', 'der', 'Sterbeort', 'von', 'Abraham', 'Lincoln', 'eine', 'Internetseite', '?']	0.1771	0.7315	0.1	54.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of the cities where Sylvester Stallone lives?	In welcher Stadt lebt Sylvester Stallone?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q40026> <http://www.wikidata.org/prop/direct/P551> ?uri . ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'cities', 'where', 'Sylvester', 'Stallone', 'lives', '?']"	['In', 'welcher', 'Stadt', 'lebt', 'Sylvester', 'Stallone', '?']	0.1715	0.6016	0.1176	44.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinct publishers have published a work that is authored by Jack Kerouac and belongs to the literary genre?	Welche Bücher von Kerouac wurden von Viking Press veröffentlicht?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT DISTINCT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P123>  <http://www.wikidata.org/entity/Q921536> . ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q47461344> . ?s1  <http://www.wikidata.org/prop/direct/P50>  <http://www.wikidata.org/entity/Q160534> . }	['Which', 'distinct', 'publishers', 'have', 'published', 'a', 'work', 'that', 'is', 'authored', 'by', 'Jack', 'Kerouac', 'and', 'belongs', 'to', 'the', 'literary', 'genre', '?']	['Welche', 'Bücher', 'von', 'Kerouac', 'wurden', 'von', 'Viking', 'Press', 'veröffentlicht', '?']	0.2163	0.3322	0.0741	90.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the distinct capital city of Canada?	Wie heißt die Hauptstadt von Kanada?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q16>  <http://www.wikidata.org/prop/direct/P36>  ?o1 .  }	['What', 'is', 'the', 'distinct', 'capital', 'city', 'of', 'Canada', '?']	['Wie', 'heißt', 'die', 'Hauptstadt', 'von', 'Kanada', '?']	0.1969	0.3119	0.0	25.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinct URI represent a book written by Muhammad Ali?	Zeige mir das Buch, das Mahammad Ali geschrieben hat.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q571> . ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q36107> . }	['Which', 'distinct', 'URI', 'represent', 'a', 'book', 'written', 'by', 'Muhammad', 'Ali', '?']	['Zeige', 'mir', 'das', 'Buch', ',', 'das', 'Mahammad', 'Ali', 'geschrieben', 'hat', '.']	0.1941	0.3145	0.0	50.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which key event involved the first ascent of Mount Everest?	Wer war der erste, der den Mount Everest bestiegen hat?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?s WHERE { ?b ps:P793   <http://www.wikidata.org/entity/Q1194369> . ?b pq:P642 <http://www.wikidata.org/entity/Q513> . ?s p:P793 ?b   . }	['Which', 'key', 'event', 'involved', 'the', 'first', 'ascent', 'of', 'Mount', 'Everest', '?']	['Wer', 'war', 'der', 'erste', ',', 'der', 'den', 'Mount', 'Everest', 'bestiegen', 'hat', '?']	0.1738	0.947	0.1053	45.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Who is the actor Mickey Rourke in a film he acted in, and who is the director of that film, Guy Ritchie?	In welchen Filmen mit Mickey Rourke hat Guy Ritchie Regie geführt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P161>  <http://www.wikidata.org/entity/Q178552> .  ?s1  <http://www.wikidata.org/prop/direct/P57>  <http://www.wikidata.org/entity/Q192990> . ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q11424> . }	['Who', 'is', 'the', 'actor', 'Mickey', 'Rourke', 'in', 'a', 'film', 'he', 'acted', 'in', ',', 'and', 'who', 'is', 'the', 'director', 'of', 'that', 'film', ',', 'Guy', 'Ritchie', '?']	['In', 'welchen', 'Filmen', 'mit', 'Mickey', 'Rourke', 'hat', 'Guy', 'Ritchie', 'Regie', 'geführt', '?']	0.1792	0.717	0.1935	76.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinct URIs represent films with Richard Gere and Julia Roberts as actors?	In welchen Filmen haben Julia Roberts und Richard Gere gemeinsam mitgespielt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q48410> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q40523> . }	['Which', 'distinct', 'URIs', 'represent', 'films', 'with', 'Richard', 'Gere', 'and', 'Julia', 'Roberts', 'as', 'actors', '?']	['In', 'welchen', 'Filmen', 'haben', 'Julia', 'Roberts', 'und', 'Richard', 'Gere', 'gemeinsam', 'mitgespielt', '?']	0.2317	1.2803	0.1667	61.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of works by Ernest Hemingway that belong to the genre of Autobiography?	Zeige mir die Autobiographie von Hemingway.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q23434> . ?uri <http://www.wikidata.org/prop/direct/P136> <http://www.wikidata.org/entity/Q4184> . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'works', 'by', 'Ernest', 'Hemingway', 'that', 'belong', 'to', 'the', 'genre', 'of', 'Autobiography', '?']"	['Zeige', 'mir', 'die', 'Autobiographie', 'von', 'Hemingway', '.']	0.1831	0.1478	0.0952	78.0
392	"Gegeben ist die SPARQL-Anfrage: SELECT ?o1 { <http://www.wikidata.org/entity/Q4740851> <http://www.wikidata.org/prop/direct/P2048>  ?o1 .  } 
 Dabei gilt:
 Die Bezeichnung von http://www.wikidata.org/entity/Q4740851 ist ""Erika Ervin.""
 Die Bezeichnung von http://www.wikidata.org/prop/direct/P2048 ist ""Höhe.""
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which Plattenlabels have the genre ""Grunge"" and are based in Canada?"	Liste alle kanadischen Grunge Plattenlabel auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT ?s1 WHERE { ?s1  wdt:P136  <http://www.wikidata.org/entity/Q11365> . ?s1  wdt:P31  <http://www.wikidata.org/entity/Q18127> . ?s1  wdt:P17 <http://www.wikidata.org/entity/Q16> . }	"['Which', 'Plattenlabels', 'have', 'the', 'genre', '``', 'Grunge', ""''"", 'and', 'are', 'based', 'in', 'Canada', '?']"	['Liste', 'alle', 'kanadischen', 'Grunge', 'Plattenlabel', 'auf', '.']	0.1897	0.2005	0.0	46.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the entity that was founded by Penguin Books?	Wer ist der Gründer von Penguin Books?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q1336200>  <http://www.wikidata.org/prop/direct/P112>  ?o1 .  }	['What', 'is', 'the', 'entity', 'that', 'was', 'founded', 'by', 'Penguin', 'Books', '?']	['Wer', 'ist', 'der', 'Gründer', 'von', 'Penguin', 'Books', '?']	0.1858	0.8182	0.2353	28.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of the composers of the ""Game of Thrones"" series?"	Wer hat die Titelmelodie von Game of Thrones geschrieben?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q23572> <http://www.wikidata.org/prop/direct/P86> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'composers', 'of', 'the', '``', 'Game', 'of', 'Thrones', ""''"", 'series', '?']"	['Wer', 'hat', 'die', 'Titelmelodie', 'von', 'Game', 'of', 'Thrones', 'geschrieben', '?']	0.1363	0.7382	0.1053	48.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the distinctive URI of each state or country that serves as the head of state for Eritrea?	Wie heißt der Präsident von Eritrea?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q986> <http://www.wikidata.org/prop/direct/P35> ?uri}	['What', 'is', 'the', 'distinctive', 'URI', 'of', 'each', 'state', 'or', 'country', 'that', 'serves', 'as', 'the', 'head', 'of', 'state', 'for', 'Eritrea', '?']	['Wie', 'heißt', 'der', 'Präsident', 'von', 'Eritrea', '?']	0.1324	0.2807	0.0909	72.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of cities where John F. Kennedy died and lies in the administrative unit of?	In welcher Stadt starb John F. Kennedy?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q9696> <http://www.wikidata.org/prop/direct/P20>/<http://www.wikidata.org/prop/direct/P131> ?uri . ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515>  .  } 	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'cities', 'where', 'John', 'F.', 'Kennedy', 'died', 'and', 'lies', 'in', 'the', 'administrative', 'unit', 'of', '?']"	['In', 'welcher', 'Stadt', 'starb', 'John', 'F.', 'Kennedy', '?']	0.1212	0.5714	0.16	77.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What is the tallest mountain on the continent of Australia? (This mountain has the highest value for the property ""Höhe über dem Meeresspiegel"")"	Wie heißt der höchste Berg in Australien?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q8502> . ?uri <http://www.wikidata.org/prop/direct/P30> <http://www.wikidata.org/entity/Q3960> . ?uri <http://www.wikidata.org/prop/direct/P2044> ?height. } ORDER BY DESC(?height) LIMIT 1	"['What', 'is', 'the', 'tallest', 'mountain', 'on', 'the', 'continent', 'of', 'Australia', '?', '(', 'This', 'mountain', 'has', 'the', 'highest', 'value', 'for', 'the', 'property', '``', 'Höhe', 'über', 'dem', 'Meeresspiegel', ""''"", ')']"	['Wie', 'heißt', 'der', 'höchste', 'Berg', 'in', 'Australien', '?']	0.1735	0.1071	0.0	120.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What is the currency of ""Volksrepublik China""?"	Wie heißt die chinesische Währung?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q148>  <http://www.wikidata.org/prop/direct/P38>  ?o1 .  } 	"['What', 'is', 'the', 'currency', 'of', '``', 'Volksrepublik', 'China', ""''"", '?']"	['Wie', 'heißt', 'die', 'chinesische', 'Währung', '?']	0.1955	0.2585	0.0	36.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What is the currency of ""Volksrepublik China""?"	Gib mir die chinesische Währung	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q148>  <http://www.wikidata.org/prop/direct/P38>  ?o1 .  } 	"['What', 'is', 'the', 'currency', 'of', '``', 'Volksrepublik', 'China', ""''"", '?']"	['Gib', 'mir', 'die', 'chinesische', 'Währung']	0.0	0.0	0.0	36.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which swedish person is a marine scientist?	Liste alle schwedischen Ozeanographen auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?s1 WHERE {   ?s1  <http://www.wikidata.org/prop/direct/P27>  <http://www.wikidata.org/entity/Q34> .   ?s1  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q3546255> .  }	['Which', 'swedish', 'person', 'is', 'a', 'marine', 'scientist', '?']	['Liste', 'alle', 'schwedischen', 'Ozeanographen', 'auf', '.']	0.0	0.0	0.0	36.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which cities does the UNO-Hauptquartier (UN Headquarters) lie in or is located as the main administrative unit, or as a subclass of?	In welcher Stadt haben die Vereinten Nationen ihren Sitz?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q11297> <http://www.wikidata.org/prop/direct/P131> ?uri . { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . } UNION {?uri <http://www.wikidata.org/prop/direct/P31>/<http://www.wikidata.org/prop/direct/P279> <http://www.wikidata.org/entity/Q515> . } }	['Which', 'cities', 'does', 'the', 'UNO-Hauptquartier', '(', 'UN', 'Headquarters', ')', 'lie', 'in', 'or', 'is', 'located', 'as', 'the', 'main', 'administrative', 'unit', ',', 'or', 'as', 'a', 'subclass', 'of', '?']	['In', 'welcher', 'Stadt', 'haben', 'die', 'Vereinten', 'Nationen', 'ihren', 'Sitz', '?']	0.1754	0.1278	0.0	104.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinct URI represents a Land that has Japanese as its official language?	In welchen Ländern sprechen die Menschen Japanisch?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256> . ?uri <http://www.wikidata.org/prop/direct/P37> <http://www.wikidata.org/entity/Q5287> . } 	['Which', 'distinct', 'URI', 'represents', 'a', 'Land', 'that', 'has', 'Japanese', 'as', 'its', 'official', 'language', '?']	['In', 'welchen', 'Ländern', 'sprechen', 'die', 'Menschen', 'Japanisch', '?']	0.1897	0.2143	0.0	62.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which film by Tim Burton has the highest budget?	Welcher Film von Tim Burton hatte das größte Budget?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT DISTINCT ?s1 WHERE {    ?s1  ?p1  <http://www.wikidata.org/entity/Q56008> . ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q11424> .  ?s1  <http://www.wikidata.org/prop/direct/P2769> ?o1 } order by ?o1 limit 1	['Which', 'film', 'by', 'Tim', 'Burton', 'has', 'the', 'highest', 'budget', '?']	['Welcher', 'Film', 'von', 'Tim', 'Burton', 'hatte', 'das', 'größte', 'Budget', '?']	0.1983	0.9966	0.2222	20.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What is the earliest release date for an Album by the Interpret ""Queen""?"	Wie hieß das erste Album von Queen?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q482994> . ?uri <http://www.wikidata.org/prop/direct/P175> <http://www.wikidata.org/entity/Q15862> . ?uri <http://www.wikidata.org/prop/direct/P577> ?date } ORDER BY ?date LIMIT 1	"['What', 'is', 'the', 'earliest', 'release', 'date', 'for', 'an', 'Album', 'by', 'the', 'Interpret', '``', 'Queen', ""''"", '?']"	['Wie', 'hieß', 'das', 'erste', 'Album', 'von', 'Queen', '?']	0.246	0.5625	0.1053	45.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which Film has the latest Veröffentlichungsdatum and stars Alec Guinness as one of its actors?	Wie hieß der letzte Film mit Alec Guiness?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q11424> . ?s1  <http://www.wikidata.org/prop/direct/P161>  <http://www.wikidata.org/entity/Q103894> . ?s1 <http://www.wikidata.org/prop/direct/P577> ?o1 . }  order by DESC(?o1)  limit 1	['Which', 'Film', 'has', 'the', 'latest', 'Veröffentlichungsdatum', 'and', 'stars', 'Alec', 'Guinness', 'as', 'one', 'of', 'its', 'actors', '?']	['Wie', 'hieß', 'der', 'letzte', 'Film', 'mit', 'Alec', 'Guiness', '?']	0.246	0.5944	0.1739	66.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which actor is associated with the movie ""Last Action Hero""?"	Liste alle Schauspieler auf, die in Last Action Hero mitgespielt haben.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q858840>  <http://www.wikidata.org/prop/direct/P161>  ?o1 .  } 	"['Which', 'actor', 'is', 'associated', 'with', 'the', 'movie', '``', 'Last', 'Action', 'Hero', ""''"", '?']"	['Liste', 'alle', 'Schauspieler', 'auf', ',', 'die', 'in', 'Last', 'Action', 'Hero', 'mitgespielt', 'haben', '.']	0.163	0.8539	0.0952	48.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which actor is associated with the movie ""Last Action Hero""?"	Gib mir alle Schauspieler die in Last Action Hero gespielt haben.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q858840>  <http://www.wikidata.org/prop/direct/P161>  ?o1 .  } 	"['Which', 'actor', 'is', 'associated', 'with', 'the', 'movie', '``', 'Last', 'Action', 'Hero', ""''"", '?']"	['Gib', 'mir', 'alle', 'Schauspieler', 'die', 'in', 'Last', 'Action', 'Hero', 'gespielt', 'haben', '.']	0.163	0.8273	0.0952	47.0
This query is looking for a person who is the discoverer or inventor of Pluto, according to Wikidata."	Wer hat den Pluto entdeckt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q339>  <http://www.wikidata.org/prop/direct/P61>  ?o1 .   ?o1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q5> .  } 	['Which', 'person', 'discovered', 'or', 'invented', 'Pluto', '?', '(', 'German', ':', 'Wer', 'entdeckte', 'oder', 'erfand', 'Pluto', '?', ')', 'This', 'query', 'is', 'looking', 'for', 'a', 'person', 'who', 'is', 'the', 'discoverer', 'or', 'inventor', 'of', 'Pluto', ',', 'according', 'to', 'Wikidata', '.']	['Wer', 'hat', 'den', 'Pluto', 'entdeckt', '?']	0.2188	0.2096	0.0625	163.0
