id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the birthdate of Meril Streep's children, listed in order from earliest to latest?	Кто старший ребенок Мерил Стрип?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q873 wdt:P40 ?uri . ?uri wdt:P569 ?date . } ORDER BY ASC(?date) LIMIT 1	"['What', 'is', 'the', 'birthdate', 'of', 'Meril', 'Streep', ""'s"", 'children', ',', 'listed', 'in', 'order', 'from', 'earliest', 'to', 'latest', '?']"	['Кто', 'старший', 'ребенок', 'Мерил', 'Стрип', '?']	0.1843	0.1436	0.0	85.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the birthdate of Meril Streep's children, listed in order from earliest to latest?	Кто является старшим ребенком Мерил Стрип?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q873 wdt:P40 ?uri . ?uri wdt:P569 ?date . } ORDER BY ASC(?date) LIMIT 1	"['What', 'is', 'the', 'birthdate', 'of', 'Meril', 'Streep', ""'s"", 'children', ',', 'listed', 'in', 'order', 'from', 'earliest', 'to', 'latest', '?']"	['Кто', 'является', 'старшим', 'ребенком', 'Мерил', 'Стрип', '?']	0.1843	0.156	0.0	84.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the birthdate of Meril Streep's children, listed in order from earliest to latest?	Кто является самым старшим ребёнком Мэрил Стрип?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q873 wdt:P40 ?uri . ?uri wdt:P569 ?date . } ORDER BY ASC(?date) LIMIT 1	"['What', 'is', 'the', 'birthdate', 'of', 'Meril', 'Streep', ""'s"", 'children', ',', 'listed', 'in', 'order', 'from', 'earliest', 'to', 'latest', '?']"	['Кто', 'является', 'самым', 'старшим', 'ребёнком', 'Мэрил', 'Стрип', '?']	0.1843	0.1667	0.0	83.0
321	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q7725310 ; wdt:P170 wd:Q8704 . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q7725310 именуется как ""серия произведений.""
 wdt:P170 именуется как ""создатель.""
 wd:Q8704 именуется как ""Уолт Дисней.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that are subclasses of ""серия произведений"" (wd:Q7725310) and have a ""создатель"" (wd:P170) with value ""Уолт Дисней"" (wd:Q8704)?"	Автором каких телевизионных шоу является Уолт Дисней?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q7725310 ; wdt:P170 wd:Q8704 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'are', 'subclasses', 'of', '``', 'серия', 'произведений', ""''"", '(', 'wd', ':', 'Q7725310', ')', 'and', 'have', 'a', '``', 'создатель', ""''"", '(', 'wd', ':', 'P170', ')', 'with', 'value', '``', 'Уолт', 'Дисней', ""''"", '(', 'wd', ':', 'Q8704', ')', '?']"	['Автором', 'каких', 'телевизионных', 'шоу', 'является', 'Уолт', 'Дисней', '?']	0.1025	0.2045	0.0	155.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that are subclasses of ""серия произведений"" (wd:Q7725310) and have a ""создатель"" (wd:P170) with value ""Уолт Дисней"" (wd:Q8704)?"	Какое телешоу создал Уолт Дисней?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q7725310 ; wdt:P170 wd:Q8704 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'are', 'subclasses', 'of', '``', 'серия', 'произведений', ""''"", '(', 'wd', ':', 'Q7725310', ')', 'and', 'have', 'a', '``', 'создатель', ""''"", '(', 'wd', ':', 'P170', ')', 'with', 'value', '``', 'Уолт', 'Дисней', ""''"", '(', 'wd', ':', 'Q8704', ')', '?']"	['Какое', 'телешоу', 'создал', 'Уолт', 'Дисней', '?']	0.1025	0.1762	0.0	153.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that are subclasses of ""серия произведений"" (wd:Q7725310) and have a ""создатель"" (wd:P170) with value ""Уолт Дисней"" (wd:Q8704)?"	Какое телевизионное шоу было создано Валтом Диснеем?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q7725310 ; wdt:P170 wd:Q8704 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'are', 'subclasses', 'of', '``', 'серия', 'произведений', ""''"", '(', 'wd', ':', 'Q7725310', ')', 'and', 'have', 'a', '``', 'создатель', ""''"", '(', 'wd', ':', 'P170', ')', 'with', 'value', '``', 'Уолт', 'Дисней', ""''"", '(', 'wd', ':', 'Q8704', ')', '?']"	['Какое', 'телевизионное', 'шоу', 'было', 'создано', 'Валтом', 'Диснеем', '?']	0.1616	0.0682	0.0	155.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that are subclasses of ""серия произведений"" (wd:Q7725310) and have a ""создатель"" (wd:P170) with value ""Уолт Дисней"" (wd:Q8704)?"	Какие телешоу были созданы Уолтом Диснеем?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q7725310 ; wdt:P170 wd:Q8704 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'are', 'subclasses', 'of', '``', 'серия', 'произведений', ""''"", '(', 'wd', ':', 'Q7725310', ')', 'and', 'have', 'a', '``', 'создатель', ""''"", '(', 'wd', ':', 'P170', ')', 'with', 'value', '``', 'Уолт', 'Дисней', ""''"", '(', 'wd', ':', 'Q8704', ')', '?']"	['Какие', 'телешоу', 'были', 'созданы', 'Уолтом', 'Диснеем', '?']	0.1616	0.0638	0.0	156.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the war or battle indicated by the property ""P607"" for the entity ""ANDREW JACKSON"" represented by <http://www.wikidata.org/entity/Q11817>?"	Президент США Джексон участвовал в войне?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q11817> <http://www.wikidata.org/prop/direct/P607> ?uri . }	"['What', 'is', 'the', 'war', 'or', 'battle', 'indicated', 'by', 'the', 'property', '``', 'P607', ""''"", 'for', 'the', 'entity', '``', 'ANDREW', 'JACKSON', ""''"", 'represented', 'by', '<', 'http', ':', '//www.wikidata.org/entity/Q11817', '>', '?']"	['Президент', 'США', 'Джексон', 'участвовал', 'в', 'войне', '?']	0.1735	0.1003	0.0	140.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the war or battle indicated by the property ""P607"" for the entity ""ANDREW JACKSON"" represented by <http://www.wikidata.org/entity/Q11817>?"	Президент США Джексон был вовлечен в войну?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q11817> <http://www.wikidata.org/prop/direct/P607> ?uri . }	"['What', 'is', 'the', 'war', 'or', 'battle', 'indicated', 'by', 'the', 'property', '``', 'P607', ""''"", 'for', 'the', 'entity', '``', 'ANDREW', 'JACKSON', ""''"", 'represented', 'by', '<', 'http', ':', '//www.wikidata.org/entity/Q11817', '>', '?']"	['Президент', 'США', 'Джексон', 'был', 'вовлечен', 'в', 'войну', '?']	0.1735	0.1071	0.0	139.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the war or battle indicated by the property ""P607"" for the entity ""ANDREW JACKSON"" represented by <http://www.wikidata.org/entity/Q11817>?"	Был ли президент США джексон вовлечен в войну?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q11817> <http://www.wikidata.org/prop/direct/P607> ?uri . }	"['What', 'is', 'the', 'war', 'or', 'battle', 'indicated', 'by', 'the', 'property', '``', 'P607', ""''"", 'for', 'the', 'entity', '``', 'ANDREW', 'JACKSON', ""''"", 'represented', 'by', '<', 'http', ':', '//www.wikidata.org/entity/Q11817', '>', '?']"	['Был', 'ли', 'президент', 'США', 'джексон', 'вовлечен', 'в', 'войну', '?']	0.1735	0.1132	0.0	138.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the war or battle indicated by the property ""P607"" for the entity ""ANDREW JACKSON"" represented by <http://www.wikidata.org/entity/Q11817>?"	Воевал ли президент США Джэксон?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q11817> <http://www.wikidata.org/prop/direct/P607> ?uri . }	"['What', 'is', 'the', 'war', 'or', 'battle', 'indicated', 'by', 'the', 'property', '``', 'P607', ""''"", 'for', 'the', 'entity', '``', 'ANDREW', 'JACKSON', ""''"", 'represented', 'by', '<', 'http', ':', '//www.wikidata.org/entity/Q11817', '>', '?']"	['Воевал', 'ли', 'президент', 'США', 'Джэксон', '?']	0.1735	0.0923	0.0	141.0
325	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?date WHERE { wd:Q25173 wdt:P729 ?date . } 
 Где:
 wd:Q25173 именуется как ""Титаник.""
 wdt:P729 именуется как ""дата принятия в эксплуатацию.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the distinct date when the Titanic was put into service?	"Когда было закончено создание ""Титаника""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?date WHERE { wd:Q25173 wdt:P729 ?date . }	['What', 'is', 'the', 'distinct', 'date', 'when', 'the', 'Titanic', 'was', 'put', 'into', 'service', '?']	"['Когда', 'было', 'закончено', 'создание', '``', 'Титаника', ""''"", '?']"	0.1911	0.2308	0.0	59.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the distinct date when the Titanic was put into service?	Когда Титаник был построен?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?date WHERE { wd:Q25173 wdt:P729 ?date . }	['What', 'is', 'the', 'distinct', 'date', 'when', 'the', 'Titanic', 'was', 'put', 'into', 'service', '?']	['Когда', 'Титаник', 'был', 'построен', '?']	0.1911	0.1786	0.0	60.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the distinct date when the Titanic was put into service?	Когда было закончено строительство Титаника?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?date WHERE { wd:Q25173 wdt:P729 ?date . }	['What', 'is', 'the', 'distinct', 'date', 'when', 'the', 'Titanic', 'was', 'put', 'into', 'service', '?']	['Когда', 'было', 'закончено', 'строительство', 'Титаника', '?']	0.1911	0.1988	0.0	59.0
326	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9036 wdt:P166 wd:Q38104 . } 
 Где:
 wd:Q9036 именуется как ""Никола Тесла.""
 wdt:P166 именуется как ""полученные награды.""
 wd:Q38104 именуется как ""Нобелевская премия по физике.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Did Nicolas Tesla (wd:Q9036) receive the Nobel Prize in Physics (wd:Q38104)?	Получал ли Тесла Нобелевсую премию по физике?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9036 wdt:P166 wd:Q38104 . }	['Did', 'Nicolas', 'Tesla', '(', 'wd', ':', 'Q9036', ')', 'receive', 'the', 'Nobel', 'Prize', 'in', 'Physics', '(', 'wd', ':', 'Q38104', ')', '?']	['Получал', 'ли', 'Тесла', 'Нобелевсую', 'премию', 'по', 'физике', '?']	0.1818	0.15	0.0	69.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Did Nicolas Tesla (wd:Q9036) receive the Nobel Prize in Physics (wd:Q38104)?	Тесла имел Нобелевскую премию по физике?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9036 wdt:P166 wd:Q38104 . }	['Did', 'Nicolas', 'Tesla', '(', 'wd', ':', 'Q9036', ')', 'receive', 'the', 'Nobel', 'Prize', 'in', 'Physics', '(', 'wd', ':', 'Q38104', ')', '?']	['Тесла', 'имел', 'Нобелевскую', 'премию', 'по', 'физике', '?']	0.1818	0.1404	0.0	70.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Did Nicolas Tesla (wd:Q9036) receive the Nobel Prize in Physics (wd:Q38104)?	Получал ли Тесла Нобелевскую премию по физике?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9036 wdt:P166 wd:Q38104 . }	['Did', 'Nicolas', 'Tesla', '(', 'wd', ':', 'Q9036', ')', 'receive', 'the', 'Nobel', 'Prize', 'in', 'Physics', '(', 'wd', ':', 'Q38104', ')', '?']	['Получал', 'ли', 'Тесла', 'Нобелевскую', 'премию', 'по', 'физике', '?']	0.1818	0.15	0.0	69.0
328	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P1344 wd:Q127050 . ?scientist wdt:P279* wd:Q901 . ?uri wdt:P106 ?scientist . ?uri wdt:P166 wd:Q35637 . } 
 Где:
 wdt:P1344 именуется как ""участвовал(а) в.""
 wd:Q127050 именуется как ""Манхэттенский проект.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q901 именуется как ""учёный.""
 wdt:P106 именуется как ""род занятий.""
 wdt:P166 именуется как ""полученные награды.""
 wd:Q35637 именуется как ""Нобелевская премия мира.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of individuals who participated in the Manhattan Project, have the occupation of a scientist, and received a Nobel Peace Prize?	Какой ученый известен как участник Манхэттенского проекта и обладатель Нобелевской премией мира?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P1344 wd:Q127050 . ?scientist wdt:P279* wd:Q901 . ?uri wdt:P106 ?scientist . ?uri wdt:P166 wd:Q35637 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'participated', 'in', 'the', 'Manhattan', 'Project', ',', 'have', 'the', 'occupation', 'of', 'a', 'scientist', ',', 'and', 'received', 'a', 'Nobel', 'Peace', 'Prize', '?']"	['Какой', 'ученый', 'известен', 'как', 'участник', 'Манхэттенского', 'проекта', 'и', 'обладатель', 'Нобелевской', 'премией', 'мира', '?']	0.1726	0.1276	0.0	143.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of individuals who participated in the Manhattan Project, have the occupation of a scientist, and received a Nobel Peace Prize?	Какие ученые известны Манхэттенским проектом и Нобелевской премией мира?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P1344 wd:Q127050 . ?scientist wdt:P279* wd:Q901 . ?uri wdt:P106 ?scientist . ?uri wdt:P166 wd:Q35637 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'participated', 'in', 'the', 'Manhattan', 'Project', ',', 'have', 'the', 'occupation', 'of', 'a', 'scientist', ',', 'and', 'received', 'a', 'Nobel', 'Peace', 'Prize', '?']"	['Какие', 'ученые', 'известны', 'Манхэттенским', 'проектом', 'и', 'Нобелевской', 'премией', 'мира', '?']	0.1726	0.1145	0.0	146.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of individuals who participated in the Manhattan Project, have the occupation of a scientist, and received a Nobel Peace Prize?	Какой учёный известен Манхэттанским проектом и Нобелевской премией мира?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P1344 wd:Q127050 . ?scientist wdt:P279* wd:Q901 . ?uri wdt:P106 ?scientist . ?uri wdt:P166 wd:Q35637 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'participated', 'in', 'the', 'Manhattan', 'Project', ',', 'have', 'the', 'occupation', 'of', 'a', 'scientist', ',', 'and', 'received', 'a', 'Nobel', 'Peace', 'Prize', '?']"	['Какой', 'учёный', 'известен', 'Манхэттанским', 'проектом', 'и', 'Нобелевской', 'премией', 'мира', '?']	0.1726	0.1145	0.0	146.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the Distinct Price for Lego 3D?

Or in other words,

Which are the different prices for Lego 3D?"	"Сколько стоил фильм ""Лего""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?val WHERE {  <http://www.wikidata.org/entity/Q2608065> <http://www.wikidata.org/prop/direct/P2130> ?val }	['What', 'is', 'the', 'Distinct', 'Price', 'for', 'Lego', '3D', '?', 'Or', 'in', 'other', 'words', ',', 'Which', 'are', 'the', 'different', 'prices', 'for', 'Lego', '3D', '?']	"['Сколько', 'стоил', 'фильм', '``', 'Лего', ""''"", '?']"	0.1785	0.1221	0.0	100.0
Which are the different prices for Lego 3D?"	Каковы затраты на Lego Movie?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?val WHERE {  <http://www.wikidata.org/entity/Q2608065> <http://www.wikidata.org/prop/direct/P2130> ?val }	['What', 'is', 'the', 'Distinct', 'Price', 'for', 'Lego', '3D', '?', 'Or', 'in', 'other', 'words', ',', 'Which', 'are', 'the', 'different', 'prices', 'for', 'Lego', '3D', '?']	['Каковы', 'затраты', 'на', 'Lego', 'Movie', '?']	0.2122	0.2248	0.0952	92.0
330	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q368577 wdt:P86 ?uri . } 
 Где:
 wd:Q368577 именуется как ""Гарольд и Мод.""
 wdt:P86 именуется как ""композитор.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the URI of the Composers that ""Harold and Mod"" (wd:Q368577) is associated with?"	Кто написал музыку для Гарольда и Мод?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q368577 wdt:P86 ?uri . }	"['What', 'is', 'the', 'URI', 'of', 'the', 'Composers', 'that', '``', 'Harold', 'and', 'Mod', ""''"", '(', 'wd', ':', 'Q368577', ')', 'is', 'associated', 'with', '?']"	['Кто', 'написал', 'музыку', 'для', 'Гарольда', 'и', 'Мод', '?']	0.1796	0.1364	0.0	80.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the URI of the Composers that ""Harold and Mod"" (wd:Q368577) is associated with?"	Кто сочинил музыку для Гарольда и Мод?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q368577 wdt:P86 ?uri . }	"['What', 'is', 'the', 'URI', 'of', 'the', 'Composers', 'that', '``', 'Harold', 'and', 'Mod', ""''"", '(', 'wd', ':', 'Q368577', ')', 'is', 'associated', 'with', '?']"	['Кто', 'сочинил', 'музыку', 'для', 'Гарольда', 'и', 'Мод', '?']	0.1796	0.1364	0.0	80.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of series tele serials that are a subclass of ""series tele serial"" and are a part of ""Q5274359""?"	Перечислите все эпизоды первого сезона сериала Клан Сопрано от HBO.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q21191270> . ?uri <http://www.wikidata.org/prop/direct/P361> <http://www.wikidata.org/entity/Q5274359> } 	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'series', 'tele', 'serials', 'that', 'are', 'a', 'subclass', 'of', '``', 'series', 'tele', 'serial', ""''"", 'and', 'are', 'a', 'part', 'of', '``', 'Q5274359', ""''"", '?']"	['Перечислите', 'все', 'эпизоды', 'первого', 'сезона', 'сериала', 'Клан', 'Сопрано', 'от', 'HBO', '.']	0.0	0.0	0.0	115.0
332	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/>  SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q515 ; wdt:P1082 ?population . } ORDER BY ?population LIMIT 1 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q515 именуется как ""город.""
 wdt:P1082 именуется как ""численность населения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the city with the lowest population among those that are instances of the ""city"" concept and have a recorded population figure?"	В каком городе наименьшее число жителей?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/>  SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q515 ; wdt:P1082 ?population . } ORDER BY ?population LIMIT 1	"['What', 'is', 'the', 'city', 'with', 'the', 'lowest', 'population', 'among', 'those', 'that', 'are', 'instances', 'of', 'the', '``', 'city', ""''"", 'concept', 'and', 'have', 'a', 'recorded', 'population', 'figure', '?']"	['В', 'каком', 'городе', 'наименьшее', 'число', 'жителей', '?']	0.1754	0.108	0.0	129.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the city with the lowest population among those that are instances of the ""city"" concept and have a recorded population figure?"	В каком городе наименьшее количество жителей?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/>  SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q515 ; wdt:P1082 ?population . } ORDER BY ?population LIMIT 1	"['What', 'is', 'the', 'city', 'with', 'the', 'lowest', 'population', 'among', 'those', 'that', 'are', 'instances', 'of', 'the', '``', 'city', ""''"", 'concept', 'and', 'have', 'a', 'recorded', 'population', 'figure', '?']"	['В', 'каком', 'городе', 'наименьшее', 'количество', 'жителей', '?']	0.1754	0.108	0.0	129.0
333	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q171684> <http://www.wikidata.org/prop/direct/P119> ?uri  . } 
 Где:
 http://www.wikidata.org/entity/Q171684 именуется как ""Ли Сын Ман.""
 http://www.wikidata.org/prop/direct/P119 именуется как ""место погребения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's representing the places of burial for ""Ли Сын Ман""?"	Где похоронен Сингман Ри?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q171684> <http://www.wikidata.org/prop/direct/P119> ?uri  . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'representing', 'the', 'places', 'of', 'burial', 'for', '``', 'Ли', 'Сын', 'Ман', ""''"", '?']"	['Где', 'похоронен', 'Сингман', 'Ри', '?']	0.1843	0.129	0.0	74.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's representing the places of burial for ""Ли Сын Ман""?"	Где погребён Ли Сын Ман?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q171684> <http://www.wikidata.org/prop/direct/P119> ?uri  . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'representing', 'the', 'places', 'of', 'burial', 'for', '``', 'Ли', 'Сын', 'Ман', ""''"", '?']"	['Где', 'погребён', 'Ли', 'Сын', 'Ман', '?']	0.1363	0.5744	0.1111	66.0
334	"Имея следующий SPARQL запрос: ASK WHERE {  <http://www.wikidata.org/entity/Q142794> <http://www.wikidata.org/prop/direct/P54> <http://www.wikidata.org/entity/Q8682>} 
 Где:
 http://www.wikidata.org/entity/Q142794 именуется как ""Неймар.""
 http://www.wikidata.org/prop/direct/P54 именуется как ""член спортивной команды.""
 http://www.wikidata.org/entity/Q8682 именуется как ""Реал Мадрид.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""ExISTs Neymar, who is labeled as ""Neymar"", and Real Madrid, who is labeled as ""Real Madrid"", such that Neymar is a member of the sports team represented by Real Madrid?"""	Играл ли Неймар за Real Madrid?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE {  <http://www.wikidata.org/entity/Q142794> <http://www.wikidata.org/prop/direct/P54> <http://www.wikidata.org/entity/Q8682>}	"['``', 'ExISTs', 'Neymar', ',', 'who', 'is', 'labeled', 'as', '``', 'Neymar', ""''"", ',', 'and', 'Real', 'Madrid', ',', 'who', 'is', 'labeled', 'as', '``', 'Real', 'Madrid', ""''"", ',', 'such', 'that', 'Neymar', 'is', 'a', 'member', 'of', 'the', 'sports', 'team', 'represented', 'by', 'Real', 'Madrid', '?', ""''""]"	['Играл', 'ли', 'Неймар', 'за', 'Real', 'Madrid', '?']	0.0682	0.2054	0.0667	154.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""ExISTs Neymar, who is labeled as ""Neymar"", and Real Madrid, who is labeled as ""Real Madrid"", such that Neymar is a member of the sports team represented by Real Madrid?"""	Неймар играет за Реал Мадрид?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE {  <http://www.wikidata.org/entity/Q142794> <http://www.wikidata.org/prop/direct/P54> <http://www.wikidata.org/entity/Q8682>}	"['``', 'ExISTs', 'Neymar', ',', 'who', 'is', 'labeled', 'as', '``', 'Neymar', ""''"", ',', 'and', 'Real', 'Madrid', ',', 'who', 'is', 'labeled', 'as', '``', 'Real', 'Madrid', ""''"", ',', 'such', 'that', 'Neymar', 'is', 'a', 'member', 'of', 'the', 'sports', 'team', 'represented', 'by', 'Real', 'Madrid', '?', ""''""]"	['Неймар', 'играет', 'за', 'Реал', 'Мадрид', '?']	0.1635	0.063	0.0	165.0
336	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q152316 wdt:P22 ?father ; wdt:P25 ?mother . wd:Q36812 wdt:P22 ?father ; wdt:P25 ?mother . } 
 Где:
 wd:Q152316 именуется как ""Гарри, герцог Сассекский.""
 wdt:P22 именуется как ""отец.""
 wd:Q152316 именуется как ""Гарри, герцог Сассекский.""
 wdt:P25 именуется как ""мать.""
 wd:Q36812 именуется как ""Уильям, принц Уэльский.""
 wdt:P22 именуется как ""отец.""
 wd:Q36812 именуется как ""Уильям, принц Уэльский.""
 wdt:P25 именуется как ""мать.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Who are the fathers and mothers of ""Гарри, герцог Сассекский"" (wd:Q152316) and ""Уильям, принц Уэльский"" (wd:Q36812)?"	У принца Гарри и Вильяма одни и те же родители?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q152316 wdt:P22 ?father ; wdt:P25 ?mother . wd:Q36812 wdt:P22 ?father ; wdt:P25 ?mother . }	"['Who', 'are', 'the', 'fathers', 'and', 'mothers', 'of', '``', 'Гарри', ',', 'герцог', 'Сассекский', ""''"", '(', 'wd', ':', 'Q152316', ')', 'and', '``', 'Уильям', ',', 'принц', 'Уэльский', ""''"", '(', 'wd', ':', 'Q36812', ')', '?']"	['У', 'принца', 'Гарри', 'и', 'Вильяма', 'одни', 'и', 'те', 'же', 'родители', '?']	0.2032	0.2232	0.0	96.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Who are the fathers and mothers of ""Гарри, герцог Сассекский"" (wd:Q152316) and ""Уильям, принц Уэльский"" (wd:Q36812)?"	У принца Гарри и принца Уильяма один родители?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q152316 wdt:P22 ?father ; wdt:P25 ?mother . wd:Q36812 wdt:P22 ?father ; wdt:P25 ?mother . }	"['Who', 'are', 'the', 'fathers', 'and', 'mothers', 'of', '``', 'Гарри', ',', 'герцог', 'Сассекский', ""''"", '(', 'wd', ':', 'Q152316', ')', 'and', '``', 'Уильям', ',', 'принц', 'Уэльский', ""''"", '(', 'wd', ':', 'Q36812', ')', '?']"	['У', 'принца', 'Гарри', 'и', 'принца', 'Уильяма', 'один', 'родители', '?']	0.2032	0.2045	0.0	93.0
337	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q937> <http://www.wikidata.org/prop/direct/P184> ?uri} 
 Где:
 http://www.wikidata.org/entity/Q937 именуется как ""Альберт Эйнштейн.""
 http://www.wikidata.org/prop/direct/P184 именуется как ""научный руководитель.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI identifiers of individuals who have Albert Einstein (<http://www.wikidata.org/entity/Q937>) as their scientific leader?	Кто был научным руководителем Альберта Эйнштейна?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q937> <http://www.wikidata.org/prop/direct/P184> ?uri}	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'individuals', 'who', 'have', 'Albert', 'Einstein', '(', '<', 'http', ':', '//www.wikidata.org/entity/Q937', '>', ')', 'as', 'their', 'scientific', 'leader', '?']	['Кто', 'был', 'научным', 'руководителем', 'Альберта', 'Эйнштейна', '?']	0.1774	0.117	0.0	139.0
338	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1079 wdt:P1113 ?nBbEpisodes . wd:Q23572 wdt:P1113 ?nGotEpisodes . FILTER(?nBbEpisodes > ?nGotEpisodes) } 
 Где:
 wd:Q1079 именуется как ""Во все тяжкие.""
 wdt:P1113 именуется как ""количество серий или эпизодов.""
 wd:Q23572 именуется как ""Игра престолов.""
 wdt:P1113 именуется как ""количество серий или эпизодов.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Does ""Во все тяжкие"" have more episodes than ""Игра престолов""?"	"У ""Во все тяжкие"" больше эпизодов чем у ""Игры пристолов""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1079 wdt:P1113 ?nBbEpisodes . wd:Q23572 wdt:P1113 ?nGotEpisodes . FILTER(?nBbEpisodes > ?nGotEpisodes) }	"['Does', '``', 'Во', 'все', 'тяжкие', ""''"", 'have', 'more', 'episodes', 'than', '``', 'Игра', 'престолов', ""''"", '?']"	"['У', '``', 'Во', 'все', 'тяжкие', ""''"", 'больше', 'эпизодов', 'чем', 'у', '``', 'Игры', 'пристолов', ""''"", '?']"	0.2926	1.9599	0.3	28.0
