id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the new number of episodes for ""Звёздный крейсер «Галактика»"" greater than the old number of episodes?"	"Имеет ли новая версия ""Звездного крейсера ""Галатика"""" больше эпизодов, чем старая?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q237072 wdt:P1113 ?newNumOfEpisodes . wd:Q2367132 wdt:P1113 ?oldNumOfEpisodes . FILTER (?newNumOfEpisodes > ?oldNumOfEpisodes) }	"['What', 'is', 'the', 'new', 'number', 'of', 'episodes', 'for', '``', 'Звёздный', 'крейсер', '«', 'Галактика', '»', ""''"", 'greater', 'than', 'the', 'old', 'number', 'of', 'episodes', '?']"	"['Имеет', 'ли', 'новая', 'версия', '``', 'Звездного', 'крейсера', '``', 'Галатика', ""''"", ""''"", 'больше', 'эпизодов', ',', 'чем', 'старая', '?']"	0.2349	0.4462	0.0	79.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of films that are of the type ""movie"" and have ""Hale Roach"" as their producer?"	Назовите все фильмы, снятые Хэлом Роучем.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?uri <http://www.wikidata.org/prop/direct/P162> <http://www.wikidata.org/entity/Q72792> . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'films', 'that', 'are', 'of', 'the', 'type', '``', 'movie', ""''"", 'and', 'have', '``', 'Hale', 'Roach', ""''"", 'as', 'their', 'producer', '?']"	['Назовите', 'все', 'фильмы', ',', 'снятые', 'Хэлом', 'Роучем', '.']	0.0	0.0	0.0	111.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of films that are of the type ""movie"" and have ""Hale Roach"" as their producer?"	Перечислите все фильмы, спродюссированные Hal Roach?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?uri <http://www.wikidata.org/prop/direct/P162> <http://www.wikidata.org/entity/Q72792> . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'films', 'that', 'are', 'of', 'the', 'type', '``', 'movie', ""''"", 'and', 'have', '``', 'Hale', 'Roach', ""''"", 'as', 'their', 'producer', '?']"	['Перечислите', 'все', 'фильмы', ',', 'спродюссированные', 'Hal', 'Roach', '?']	0.2086	0.2308	0.0	102.0
162	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?res WHERE { wd:Q83495 p:P161 _:a ._:a pq:P453 wd:Q2085488 ._:a ps:P161 ?res . } 
 Где:
 wd:Q83495 именуется как ""Матрица.""
 p:P161 именуется как ""в ролях.""
 pq:P453 именуется как ""играет роль персонажа.""
 wd:Q2085488 именуется как ""Агент Смит.""
 ps:P161 именуется как ""в ролях.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Who plays the role of Agent Smith in the movie ""The Matrix"" (wd:Q83495) and who else does he act alongside in the film?"	"Кто играл роль Агента Смита в фильме ""Матрица""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?res WHERE { wd:Q83495 p:P161 _:a ._:a pq:P453 wd:Q2085488 ._:a ps:P161 ?res . }	"['Who', 'plays', 'the', 'role', 'of', 'Agent', 'Smith', 'in', 'the', 'movie', '``', 'The', 'Matrix', ""''"", '(', 'wd', ':', 'Q83495', ')', 'and', 'who', 'else', 'does', 'he', 'act', 'alongside', 'in', 'the', 'film', '?']"	"['Кто', 'играл', 'роль', 'Агента', 'Смита', 'в', 'фильме', '``', 'Матрица', ""''"", '?']"	0.226	0.3459	0.0	109.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Who plays the role of Agent Smith in the movie ""The Matrix"" (wd:Q83495) and who else does he act alongside in the film?"	Кто играл Агента Смитта в фильме Матрица?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?res WHERE { wd:Q83495 p:P161 _:a ._:a pq:P453 wd:Q2085488 ._:a ps:P161 ?res . }	"['Who', 'plays', 'the', 'role', 'of', 'Agent', 'Smith', 'in', 'the', 'movie', '``', 'The', 'Matrix', ""''"", '(', 'wd', ':', 'Q83495', ')', 'and', 'who', 'else', 'does', 'he', 'act', 'alongside', 'in', 'the', 'film', '?']"	['Кто', 'играл', 'Агента', 'Смитта', 'в', 'фильме', 'Матрица', '?']	0.1717	0.1	0.0	112.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Who plays the role of Agent Smith in the movie ""The Matrix"" (wd:Q83495) and who else does he act alongside in the film?"	Кто играл Агента Смита в Матрице?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?res WHERE { wd:Q83495 p:P161 _:a ._:a pq:P453 wd:Q2085488 ._:a ps:P161 ?res . }	"['Who', 'plays', 'the', 'role', 'of', 'Agent', 'Smith', 'in', 'the', 'movie', '``', 'The', 'Matrix', ""''"", '(', 'wd', ':', 'Q83495', ')', 'and', 'who', 'else', 'does', 'he', 'act', 'alongside', 'in', 'the', 'film', '?']"	['Кто', 'играл', 'Агента', 'Смита', 'в', 'Матрице', '?']	0.1717	0.0936	0.0	113.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Who plays the role of Agent Smith in the movie ""The Matrix"" (wd:Q83495) and who else does he act alongside in the film?"	Кто сыграл агента Смита в Матрице?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?res WHERE { wd:Q83495 p:P161 _:a ._:a pq:P453 wd:Q2085488 ._:a ps:P161 ?res . }	"['Who', 'plays', 'the', 'role', 'of', 'Agent', 'Smith', 'in', 'the', 'movie', '``', 'The', 'Matrix', ""''"", '(', 'wd', ':', 'Q83495', ')', 'and', 'who', 'else', 'does', 'he', 'act', 'alongside', 'in', 'the', 'film', '?']"	['Кто', 'сыграл', 'агента', 'Смита', 'в', 'Матрице', '?']	0.1717	0.0936	0.0	113.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of political parties that are based in Greece and hold a pro-European ideology?	Какие из греческих партий являются про-европейскими?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7278 ; wdt:P17 wd:Q41 ; wdt:P1142 wd:Q3781399 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'political', 'parties', 'that', 'are', 'based', 'in', 'Greece', 'and', 'hold', 'a', 'pro-European', 'ideology', '?']"	['Какие', 'из', 'греческих', 'партий', 'являются', 'про-европейскими', '?']	0.1818	0.1404	0.0	100.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of political parties that are based in Greece and hold a pro-European ideology?	Какие греческие партии про-европейские?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7278 ; wdt:P17 wd:Q41 ; wdt:P1142 wd:Q3781399 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'political', 'parties', 'that', 'are', 'based', 'in', 'Greece', 'and', 'hold', 'a', 'pro-European', 'ideology', '?']"	['Какие', 'греческие', 'партии', 'про-европейские', '?']	0.1818	0.1161	0.0	102.0
164	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P106 wd:Q806349 . ?res wdt:P1303 wd:Q8338 . } 
 Где:
 wdt:P106 именуется как ""род занятий.""
 wd:Q806349 именуется как ""бэнд-лидер.""
 wdt:P1303 именуется как ""музыкальный инструмент.""
 wd:Q8338 именуется как ""труба.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the bands' leaders who play the trumpet as their occupation?	Список всех дирижеров, которые играют на трубе.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P106 wd:Q806349 . ?res wdt:P1303 wd:Q8338 . }	"['What', 'are', 'the', 'bands', ""'"", 'leaders', 'who', 'play', 'the', 'trumpet', 'as', 'their', 'occupation', '?']"	['Список', 'всех', 'дирижеров', ',', 'которые', 'играют', 'на', 'трубе', '.']	0.0	0.0	0.0	63.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the bands' leaders who play the trumpet as their occupation?	Перечислите список всех дирижеров, играющих на трубе?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P106 wd:Q806349 . ?res wdt:P1303 wd:Q8338 . }	"['What', 'are', 'the', 'bands', ""'"", 'leaders', 'who', 'play', 'the', 'trumpet', 'as', 'their', 'occupation', '?']"	['Перечислите', 'список', 'всех', 'дирижеров', ',', 'играющих', 'на', 'трубе', '?']	0.1897	0.2264	0.0	62.0
165	"Имея следующий SPARQL запрос: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?res WHERE { ?res wdt:P31/wdt:P279* wd:Q8502 . ?res wdt:P2044 ?elevation . ?res wdt:P30/wdt:P361 wd:Q2 . } ORDER BY DESC(?elevation) LIMIT 1 OFFSET 1 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q8502 именуется как ""гора.""
 wdt:P2044 именуется как ""высота над уровнем моря.""
 wdt:P30 именуется как ""часть света.""
 wdt:P361 именуется как ""является частью.""
 wd:Q2 именуется как ""Земля.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the highest mountain, other than Earth, with a known elevation above sea level that is a subclass of ""mountain"" (Q8502) and a part of some part of the world?"	Какая гора является второй по высоте на Земле?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?res WHERE { ?res wdt:P31/wdt:P279* wd:Q8502 . ?res wdt:P2044 ?elevation . ?res wdt:P30/wdt:P361 wd:Q2 . } ORDER BY DESC(?elevation) LIMIT 1 OFFSET 1	"['What', 'is', 'the', 'highest', 'mountain', ',', 'other', 'than', 'Earth', ',', 'with', 'a', 'known', 'elevation', 'above', 'sea', 'level', 'that', 'is', 'a', 'subclass', 'of', '``', 'mountain', ""''"", '(', 'Q8502', ')', 'and', 'a', 'part', 'of', 'some', 'part', 'of', 'the', 'world', '?']"	['Какая', 'гора', 'является', 'второй', 'по', 'высоте', 'на', 'Земле', '?']	0.1655	0.0834	0.0	157.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the highest mountain, other than Earth, with a known elevation above sea level that is a subclass of ""mountain"" (Q8502) and a part of some part of the world?"	Вторая наивысшая гора на земле?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?res WHERE { ?res wdt:P31/wdt:P279* wd:Q8502 . ?res wdt:P2044 ?elevation . ?res wdt:P30/wdt:P361 wd:Q2 . } ORDER BY DESC(?elevation) LIMIT 1 OFFSET 1	"['What', 'is', 'the', 'highest', 'mountain', ',', 'other', 'than', 'Earth', ',', 'with', 'a', 'known', 'elevation', 'above', 'sea', 'level', 'that', 'is', 'a', 'subclass', 'of', '``', 'mountain', ""''"", '(', 'Q8502', ')', 'and', 'a', 'part', 'of', 'some', 'part', 'of', 'the', 'world', '?']"	['Вторая', 'наивысшая', 'гора', 'на', 'земле', '?']	0.1655	0.068	0.0	160.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the highest mountain, other than Earth, with a known elevation above sea level that is a subclass of ""mountain"" (Q8502) and a part of some part of the world?"	Какая гора является второй по величине на Земле?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?res WHERE { ?res wdt:P31/wdt:P279* wd:Q8502 . ?res wdt:P2044 ?elevation . ?res wdt:P30/wdt:P361 wd:Q2 . } ORDER BY DESC(?elevation) LIMIT 1 OFFSET 1	"['What', 'is', 'the', 'highest', 'mountain', ',', 'other', 'than', 'Earth', ',', 'with', 'a', 'known', 'elevation', 'above', 'sea', 'level', 'that', 'is', 'a', 'subclass', 'of', '``', 'mountain', ""''"", '(', 'Q8502', ')', 'and', 'a', 'part', 'of', 'some', 'part', 'of', 'the', 'world', '?']"	['Какая', 'гора', 'является', 'второй', 'по', 'величине', 'на', 'Земле', '?']	0.1655	0.0834	0.0	157.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the highest mountain, other than Earth, with a known elevation above sea level that is a subclass of ""mountain"" (Q8502) and a part of some part of the world?"	Какая гора вторая по величине на Земле?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?res WHERE { ?res wdt:P31/wdt:P279* wd:Q8502 . ?res wdt:P2044 ?elevation . ?res wdt:P30/wdt:P361 wd:Q2 . } ORDER BY DESC(?elevation) LIMIT 1 OFFSET 1	"['What', 'is', 'the', 'highest', 'mountain', ',', 'other', 'than', 'Earth', ',', 'with', 'a', 'known', 'elevation', 'above', 'sea', 'level', 'that', 'is', 'a', 'subclass', 'of', '``', 'mountain', ""''"", '(', 'Q8502', ')', 'and', 'a', 'part', 'of', 'some', 'part', 'of', 'the', 'world', '?']"	['Какая', 'гора', 'вторая', 'по', 'величине', 'на', 'Земле', '?']	0.1655	0.0789	0.0	158.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the city with the largest population in Egypt, and what is the name of the country that is its administrative center?	Крупнейший город Египта является его столицей?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { { SELECT ?largest WHERE { ?largest <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . ?largest <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q79> . ?largest <http://www.wikidata.org/prop/direct/P1082> ?population . } ORDER BY DESC(?population) LIMIT 1 } <http://www.wikidata.org/entity/Q79> <http://www.wikidata.org/prop/direct/P36> ?largest . }	['What', 'is', 'the', 'city', 'with', 'the', 'largest', 'population', 'in', 'Egypt', ',', 'and', 'what', 'is', 'the', 'name', 'of', 'the', 'country', 'that', 'is', 'its', 'administrative', 'center', '?']	['Крупнейший', 'город', 'Египта', 'является', 'его', 'столицей', '?']	0.1764	0.1123	0.0	119.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the city with the largest population in Egypt, and what is the name of the country that is its administrative center?	Является ли самый большой город Египта его столицей?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { { SELECT ?largest WHERE { ?largest <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . ?largest <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q79> . ?largest <http://www.wikidata.org/prop/direct/P1082> ?population . } ORDER BY DESC(?population) LIMIT 1 } <http://www.wikidata.org/entity/Q79> <http://www.wikidata.org/prop/direct/P36> ?largest . }	['What', 'is', 'the', 'city', 'with', 'the', 'largest', 'population', 'in', 'Egypt', ',', 'and', 'what', 'is', 'the', 'name', 'of', 'the', 'country', 'that', 'is', 'its', 'administrative', 'center', '?']	['Является', 'ли', 'самый', 'большой', 'город', 'Египта', 'его', 'столицей', '?']	0.1764	0.1268	0.0	117.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the city with the largest population in Egypt, and what is the name of the country that is its administrative center?	Является ли крупнейший город Египта столицей?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { { SELECT ?largest WHERE { ?largest <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . ?largest <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q79> . ?largest <http://www.wikidata.org/prop/direct/P1082> ?population . } ORDER BY DESC(?population) LIMIT 1 } <http://www.wikidata.org/entity/Q79> <http://www.wikidata.org/prop/direct/P36> ?largest . }	['What', 'is', 'the', 'city', 'with', 'the', 'largest', 'population', 'in', 'Egypt', ',', 'and', 'what', 'is', 'the', 'name', 'of', 'the', 'country', 'that', 'is', 'its', 'administrative', 'center', '?']	['Является', 'ли', 'крупнейший', 'город', 'Египта', 'столицей', '?']	0.1764	0.1123	0.0	119.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the city with the largest population in Egypt, and what is the name of the country that is its administrative center?	Является ли крупнейший город Египта также и его столицей?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { { SELECT ?largest WHERE { ?largest <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . ?largest <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q79> . ?largest <http://www.wikidata.org/prop/direct/P1082> ?population . } ORDER BY DESC(?population) LIMIT 1 } <http://www.wikidata.org/entity/Q79> <http://www.wikidata.org/prop/direct/P36> ?largest . }	['What', 'is', 'the', 'city', 'with', 'the', 'largest', 'population', 'in', 'Egypt', ',', 'and', 'what', 'is', 'the', 'name', 'of', 'the', 'country', 'that', 'is', 'its', 'administrative', 'center', '?']	['Является', 'ли', 'крупнейший', 'город', 'Египта', 'также', 'и', 'его', 'столицей', '?']	0.1764	0.1329	0.0	116.0
167	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279* wd:Q41291 . ?uri wdt:P1427 wd:Q177477  . } 
 Где:
 wdt:P279 именуется как ""подкласс от.""
 wd:Q41291 именуется как ""ракета.""
 wdt:P1427 именуется как ""начало пути.""
 wd:Q177477 именуется как ""Байконур.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI's of the entities that are both a subclass of ""rocket"" and have a beginning path of ""Baikonur""?"	Какие ракеты были запущены с Байконура?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279* wd:Q41291 . ?uri wdt:P1427 wd:Q177477  . }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'are', 'both', 'a', 'subclass', 'of', '``', 'rocket', ""''"", 'and', 'have', 'a', 'beginning', 'path', 'of', '``', 'Baikonur', ""''"", '?']"	['Какие', 'ракеты', 'были', 'запущены', 'с', 'Байконура', '?']	0.1735	0.1003	0.0	118.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"How many distinct subclasses does the concept of ""programming language"" (wd:Q9143) have in the Wikidata database, where a subclass is a subclass relationship (wdt:P279) from a class that is an instance of the ""subclass of"" property (wdt:P31) for this concept?"	Сколько всего существует языков программирования?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?sub) AS ?count) WHERE { ?sub wdt:P31/wdt:P279* wd:Q9143 . }	"['How', 'many', 'distinct', 'subclasses', 'does', 'the', 'concept', 'of', '``', 'programming', 'language', ""''"", '(', 'wd', ':', 'Q9143', ')', 'have', 'in', 'the', 'Wikidata', 'database', ',', 'where', 'a', 'subclass', 'is', 'a', 'subclass', 'relationship', '(', 'wdt', ':', 'P279', ')', 'from', 'a', 'class', 'that', 'is', 'an', 'instance', 'of', 'the', '``', 'subclass', 'of', ""''"", 'property', '(', 'wdt', ':', 'P31', ')', 'for', 'this', 'concept', '?']"	['Сколько', 'всего', 'существует', 'языков', 'программирования', '?']	0.1542	0.0446	0.0	254.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"How many distinct subclasses does the concept of ""programming language"" (wd:Q9143) have in the Wikidata database, where a subclass is a subclass relationship (wdt:P279) from a class that is an instance of the ""subclass of"" property (wdt:P31) for this concept?"	Сколько существует языков программирования?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?sub) AS ?count) WHERE { ?sub wdt:P31/wdt:P279* wd:Q9143 . }	"['How', 'many', 'distinct', 'subclasses', 'does', 'the', 'concept', 'of', '``', 'programming', 'language', ""''"", '(', 'wd', ':', 'Q9143', ')', 'have', 'in', 'the', 'Wikidata', 'database', ',', 'where', 'a', 'subclass', 'is', 'a', 'subclass', 'relationship', '(', 'wdt', ':', 'P279', ')', 'from', 'a', 'class', 'that', 'is', 'an', 'instance', 'of', 'the', '``', 'subclass', 'of', ""''"", 'property', '(', 'wdt', ':', 'P31', ')', 'for', 'this', 'concept', '?']"	['Сколько', 'существует', 'языков', 'программирования', '?']	0.1542	0.04	0.0	255.0
169	"Имея следующий SPARQL запрос: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P19 _:a . ?uri wdt:P20 _:a . ?uri wdt:P106/wdt:P279* wd:Q10873124 . } 
 Где:
 wdt:P19 именуется как ""место рождения.""
 wdt:P20 именуется как ""место смерти.""
 wdt:P106 именуется как ""род занятий.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q10873124 именуется как ""шахматист.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of individuals that have been born in some place, died in another place, and have the profession ""шахматист"" or are descendants of someone with that occupation?"	Кто из шахматистов умер там же, где родился?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P19 _:a . ?uri wdt:P20 _:a . ?uri wdt:P106/wdt:P279* wd:Q10873124 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'that', 'have', 'been', 'born', 'in', 'some', 'place', ',', 'died', 'in', 'another', 'place', ',', 'and', 'have', 'the', 'profession', '``', 'шахматист', ""''"", 'or', 'are', 'descendants', 'of', 'someone', 'with', 'that', 'occupation', '?']"	['Кто', 'из', 'шахматистов', 'умер', 'там', 'же', ',', 'где', 'родился', '?']	0.1977	0.1796	0.0	171.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of individuals that have been born in some place, died in another place, and have the profession ""шахматист"" or are descendants of someone with that occupation?"	Какие игроки в шахматы умерли в том же городе, в котором и родились?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P19 _:a . ?uri wdt:P20 _:a . ?uri wdt:P106/wdt:P279* wd:Q10873124 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'that', 'have', 'been', 'born', 'in', 'some', 'place', ',', 'died', 'in', 'another', 'place', ',', 'and', 'have', 'the', 'profession', '``', 'шахматист', ""''"", 'or', 'are', 'descendants', 'of', 'someone', 'with', 'that', 'occupation', '?']"	['Какие', 'игроки', 'в', 'шахматы', 'умерли', 'в', 'том', 'же', 'городе', ',', 'в', 'котором', 'и', 'родились', '?']	0.1977	0.2112	0.0	172.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of individuals that have been born in some place, died in another place, and have the profession ""шахматист"" or are descendants of someone with that occupation?"	Какие шахматные игроки умерли там же, где родились?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P19 _:a . ?uri wdt:P20 _:a . ?uri wdt:P106/wdt:P279* wd:Q10873124 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'that', 'have', 'been', 'born', 'in', 'some', 'place', ',', 'died', 'in', 'another', 'place', ',', 'and', 'have', 'the', 'profession', '``', 'шахматист', ""''"", 'or', 'are', 'descendants', 'of', 'someone', 'with', 'that', 'occupation', '?']"	['Какие', 'шахматные', 'игроки', 'умерли', 'там', 'же', ',', 'где', 'родились', '?']	0.1977	0.1796	0.0	174.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of individuals that have been born in some place, died in another place, and have the profession ""шахматист"" or are descendants of someone with that occupation?"	Какие шахматные игроки умерли в том же месте, где и родились?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P19 _:a . ?uri wdt:P20 _:a . ?uri wdt:P106/wdt:P279* wd:Q10873124 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'that', 'have', 'been', 'born', 'in', 'some', 'place', ',', 'died', 'in', 'another', 'place', ',', 'and', 'have', 'the', 'profession', '``', 'шахматист', ""''"", 'or', 'are', 'descendants', 'of', 'someone', 'with', 'that', 'occupation', '?']"	['Какие', 'шахматные', 'игроки', 'умерли', 'в', 'том', 'же', 'месте', ',', 'где', 'и', 'родились', '?']	0.1977	0.2	0.0	174.0
170	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q380 wdt:P127 ?res . }  
 Где:
 wd:Q380 именуется как ""Meta Platforms.""
 wdt:P127 именуется как ""владельцем является.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the owner of Meta Platforms (wd:Q380)?	Кто владелец Facebook?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q380 wdt:P127 ?res . } 	['What', 'is', 'the', 'owner', 'of', 'Meta', 'Platforms', '(', 'wd', ':', 'Q380', ')', '?']	['Кто', 'владелец', 'Facebook', '?']	0.1911	0.1538	0.0	41.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the owner of Meta Platforms (wd:Q380)?	Кто является владельцем Фейсбука?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q380 wdt:P127 ?res . } 	['What', 'is', 'the', 'owner', 'of', 'Meta', 'Platforms', '(', 'wd', ':', 'Q380', ')', '?']	['Кто', 'является', 'владельцем', 'Фейсбука', '?']	0.1911	0.1786	0.0	42.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that have the property ""in the role of"" with the value ""Tom Cruise""?"	Назовите фильмы с Томом Крузом.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P161 wd:Q37079. }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'in', 'the', 'role', 'of', ""''"", 'with', 'the', 'value', '``', 'Tom', 'Cruise', ""''"", '?']"	['Назовите', 'фильмы', 'с', 'Томом', 'Крузом', '.']	0.0	0.0	0.0	114.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that have the property ""in the role of"" with the value ""Tom Cruise""?"	Выдай мне все фильмы с Томом Крузом.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P161 wd:Q37079. }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'in', 'the', 'role', 'of', ""''"", 'with', 'the', 'value', '``', 'Tom', 'Cruise', ""''"", '?']"	['Выдай', 'мне', 'все', 'фильмы', 'с', 'Томом', 'Крузом', '.']	0.0	0.0	0.0	112.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that have the property ""in the role of"" with the value ""Tom Cruise""?"	Назовите все фильмы с Томом Крузом.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P161 wd:Q37079. }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'in', 'the', 'role', 'of', ""''"", 'with', 'the', 'value', '``', 'Tom', 'Cruise', ""''"", '?']"	['Назовите', 'все', 'фильмы', 'с', 'Томом', 'Крузом', '.']	0.0	0.0	0.0	113.0
172	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q983650 wdt:P131+ ?res . ?res wdt:P31 wd:Q35657 . } 
 Где:
 wd:Q983650 именуется как ""Форт Нокс.""
 wdt:P131 именуется как ""административно-территориальная единица.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q35657 именуется как ""штат США.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the administrative units that are part of the United States and are under the jurisdiction of Fort Knox?	В каком штате США расположен Форт-Нокс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q983650 wdt:P131+ ?res . ?res wdt:P31 wd:Q35657 . }	['What', 'are', 'the', 'administrative', 'units', 'that', 'are', 'part', 'of', 'the', 'United', 'States', 'and', 'are', 'under', 'the', 'jurisdiction', 'of', 'Fort', 'Knox', '?']	['В', 'каком', 'штате', 'США', 'расположен', 'Форт-Нокс', '?']	0.1807	0.1337	0.0	107.0
