id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the distinct height or rost value for ""Michael Jordan"" (wd:Q41421) ?"	Какого роста Майкл Джордан	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q41421 wdt:P2048 ?val . }	"['What', 'is', 'the', 'distinct', 'height', 'or', 'rost', 'value', 'for', '``', 'Michael', 'Jordan', ""''"", '(', 'wd', ':', 'Q41421', ')', '?']"	['Какого', 'роста', 'Майкл', 'Джордан']	0.0	0.0	0.0	73.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the distinct height or rost value for ""Michael Jordan"" (wd:Q41421) ?"	Какой рост у Майкла Джордана?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q41421 wdt:P2048 ?val . }	"['What', 'is', 'the', 'distinct', 'height', 'or', 'rost', 'value', 'for', '``', 'Michael', 'Jordan', ""''"", '(', 'wd', ':', 'Q41421', ')', '?']"	['Какой', 'рост', 'у', 'Майкла', 'Джордана', '?']	0.1831	0.1361	0.0	71.0
364	"Имея следующий SPARQL запрос: SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q184560> <http://www.wikidata.org/prop/direct/P159> ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q515> . } 
 Где:
 http://www.wikidata.org/entity/Q184560 именуется как ""Секретная разведывательная служба.""
 http://www.wikidata.org/prop/direct/P159 именуется как ""расположение штаб-квартиры.""
 http://www.wikidata.org/prop/direct/P31 именуется как ""это частный случай понятия.""
 http://www.wikidata.org/entity/Q515 именуется как ""город.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinctive locations where the headquarters of the Secret Intelligence Service, identified by the Wikidata entity <http://www.wikidata.org/entity/Q184560>, are situated?	В каком городе Великобритании находится штаб-квартира МИ-6	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q184560> <http://www.wikidata.org/prop/direct/P159> ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q515> . }	['What', 'are', 'the', 'distinctive', 'locations', 'where', 'the', 'headquarters', 'of', 'the', 'Secret', 'Intelligence', 'Service', ',', 'identified', 'by', 'the', 'Wikidata', 'entity', '<', 'http', ':', '//www.wikidata.org/entity/Q184560', '>', ',', 'are', 'situated', '?']	['В', 'каком', 'городе', 'Великобритании', 'находится', 'штаб-квартира', 'МИ-6']	0.0	0.0	0.0	176.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinctive locations where the headquarters of the Secret Intelligence Service, identified by the Wikidata entity <http://www.wikidata.org/entity/Q184560>, are situated?	В каком городе Великобритании находится штаб-квартира MI6?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q184560> <http://www.wikidata.org/prop/direct/P159> ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q515> . }	['What', 'are', 'the', 'distinctive', 'locations', 'where', 'the', 'headquarters', 'of', 'the', 'Secret', 'Intelligence', 'Service', ',', 'identified', 'by', 'the', 'Wikidata', 'entity', '<', 'http', ':', '//www.wikidata.org/entity/Q184560', '>', ',', 'are', 'situated', '?']	['В', 'каком', 'городе', 'Великобритании', 'находится', 'штаб-квартира', 'MI6', '?']	0.1735	0.1071	0.0	175.0
365	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q5930> <http://www.wikidata.org/prop/direct/P170> ?uri} 
 Где:
 http://www.wikidata.org/entity/Q5930 именуется как ""Гриффины.""
 http://www.wikidata.org/prop/direct/P170 именуется как ""создатель.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of creators of Griffins as represented in Wikidata?

Translation:

Which are the URI's of the creators for Griffins in Wikidata?"	Кто создал Гриффинов	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q5930> <http://www.wikidata.org/prop/direct/P170> ?uri}	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'creators', 'of', 'Griffins', 'as', 'represented', 'in', 'Wikidata', '?', 'Translation', ':', 'Which', 'are', 'the', 'URI', ""'s"", 'of', 'the', 'creators', 'for', 'Griffins', 'in', 'Wikidata', '?']"	['Кто', 'создал', 'Гриффинов']	0.0	0.0	0.0	154.0
367	"Имея следующий SPARQL запрос:  SELECT DISTINCT ?o2 WHERE { <http://www.wikidata.org/entity/Q303>  <http://www.wikidata.org/prop/direct/P40>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P40> ?o2 } 
 Где:
 http://www.wikidata.org/entity/Q303 именуется как ""Элвис Пресли.""
 http://www.wikidata.org/prop/direct/P40 именуется как ""дети.""
 http://www.wikidata.org/prop/direct/P40 именуется как ""дети.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct children of Elvis Presley?	Назовите внуков Элвиса Пресли.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT DISTINCT ?o2 WHERE { <http://www.wikidata.org/entity/Q303>  <http://www.wikidata.org/prop/direct/P40>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P40> ?o2 }	['What', 'are', 'the', 'distinct', 'children', 'of', 'Elvis', 'Presley', '?']	['Назовите', 'внуков', 'Элвиса', 'Пресли', '.']	0.0	0.0	0.0	45.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct children of Elvis Presley?	Перечислите внуков Элвиса Пресли?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT DISTINCT ?o2 WHERE { <http://www.wikidata.org/entity/Q303>  <http://www.wikidata.org/prop/direct/P40>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P40> ?o2 }	['What', 'are', 'the', 'distinct', 'children', 'of', 'Elvis', 'Presley', '?']	['Перечислите', 'внуков', 'Элвиса', 'Пресли', '?']	0.1969	0.258	0.0	44.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the distinct date of the termination of existence for the ""Ming Dynasty"" (<http://www.wikidata.org/entity/Q9903>)?"	Когда произошел распад династии Мин?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q9903> <http://www.wikidata.org/prop/direct/P576> ?date . }	"['What', 'is', 'the', 'distinct', 'date', 'of', 'the', 'termination', 'of', 'existence', 'for', 'the', '``', 'Ming', 'Dynasty', ""''"", '(', '<', 'http', ':', '//www.wikidata.org/entity/Q9903', '>', ')', '?']"	['Когда', 'произошел', 'распад', 'династии', 'Мин', '?']	0.1774	0.1077	0.0	117.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the distinct date of the termination of existence for the ""Ming Dynasty"" (<http://www.wikidata.org/entity/Q9903>)?"	Когда распалась династия Мин?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q9903> <http://www.wikidata.org/prop/direct/P576> ?date . }	"['What', 'is', 'the', 'distinct', 'date', 'of', 'the', 'termination', 'of', 'existence', 'for', 'the', '``', 'Ming', 'Dynasty', ""''"", '(', '<', 'http', ':', '//www.wikidata.org/entity/Q9903', '>', ')', '?']"	['Когда', 'распалась', 'династия', 'Мин', '?']	0.1774	0.0967	0.0	118.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the distinct date of the termination of existence for the ""Ming Dynasty"" (<http://www.wikidata.org/entity/Q9903>)?"	Когда прервалась династия Мин?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q9903> <http://www.wikidata.org/prop/direct/P576> ?date . }	"['What', 'is', 'the', 'distinct', 'date', 'of', 'the', 'termination', 'of', 'existence', 'for', 'the', '``', 'Ming', 'Dynasty', ""''"", '(', '<', 'http', ':', '//www.wikidata.org/entity/Q9903', '>', ')', '?']"	['Когда', 'прервалась', 'династия', 'Мин', '?']	0.1774	0.0967	0.0	118.0
369	"Имея следующий SPARQL запрос:  SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q170596>  <http://www.wikidata.org/prop/direct/P607>  ?o1 .  }  
 Где:
 http://www.wikidata.org/entity/Q170596 именуется как ""Лоуренс, Томас Эдвард.""
 http://www.wikidata.org/prop/direct/P607 именуется как ""война/сражение.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct battles or wars that Thomas Edward Lawrence, with the ID <http://www.wikidata.org/entity/Q170596>, was involved in?	В каких военных конфликтах участвовал Лоуренс Аравийский?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q170596>  <http://www.wikidata.org/prop/direct/P607>  ?o1 .  } 	['What', 'are', 'the', 'distinct', 'battles', 'or', 'wars', 'that', 'Thomas', 'Edward', 'Lawrence', ',', 'with', 'the', 'ID', '<', 'http', ':', '//www.wikidata.org/entity/Q170596', '>', ',', 'was', 'involved', 'in', '?']	['В', 'каких', 'военных', 'конфликтах', 'участвовал', 'Лоуренс', 'Аравийский', '?']	0.1764	0.12	0.0	130.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct battles or wars that Thomas Edward Lawrence, with the ID <http://www.wikidata.org/entity/Q170596>, was involved in?	В каких вооруженных конфликтах учавствовал Лоуренс Аравийский?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q170596>  <http://www.wikidata.org/prop/direct/P607>  ?o1 .  } 	['What', 'are', 'the', 'distinct', 'battles', 'or', 'wars', 'that', 'Thomas', 'Edward', 'Lawrence', ',', 'with', 'the', 'ID', '<', 'http', ':', '//www.wikidata.org/entity/Q170596', '>', ',', 'was', 'involved', 'in', '?']	['В', 'каких', 'вооруженных', 'конфликтах', 'учавствовал', 'Лоуренс', 'Аравийский', '?']	0.1764	0.12	0.0	130.0
370	"Имея следующий SPARQL запрос:  SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q187893>  <http://www.wikidata.org/prop/direct/P421>  ?o1 .  }  
 Где:
 http://www.wikidata.org/entity/Q187893 именуется как ""Сан-Педро-де-Атакама.""
 http://www.wikidata.org/prop/direct/P421 именуется как ""часовой пояс.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which distinct cities have a time zone designation in Wikidata with the entity ""San Pedro de Atacama""?"	В каком часовом поясе находится Сан-Педро-де-Атакама?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q187893>  <http://www.wikidata.org/prop/direct/P421>  ?o1 .  } 	"['Which', 'distinct', 'cities', 'have', 'a', 'time', 'zone', 'designation', 'in', 'Wikidata', 'with', 'the', 'entity', '``', 'San', 'Pedro', 'de', 'Atacama', ""''"", '?']"	['В', 'каком', 'часовом', 'поясе', 'находится', 'Сан-Педро-де-Атакама', '?']	0.1818	0.1404	0.0	96.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which distinct cities have a time zone designation in Wikidata with the entity ""San Pedro de Atacama""?"	Какой часовой пояс в Сан-Педро-де-Атакама?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q187893>  <http://www.wikidata.org/prop/direct/P421>  ?o1 .  } 	"['Which', 'distinct', 'cities', 'have', 'a', 'time', 'zone', 'designation', 'in', 'Wikidata', 'with', 'the', 'entity', '``', 'San', 'Pedro', 'de', 'Atacama', ""''"", '?']"	['Какой', 'часовой', 'пояс', 'в', 'Сан-Педро-де-Атакама', '?']	0.1818	0.1292	0.0	97.0
372	"Имея следующий SPARQL запрос: SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q4977246>  <http://www.wikidata.org/prop/direct/P509>  ?o1 .  } 
 Где:
 http://www.wikidata.org/prop/direct/P509 именуется как ""причина смерти.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct entities that are the cause of death for Q4977246? (Only the question is translated, not the SPARQL query itself.)	Причина смерти Брюса Карвера?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q4977246>  <http://www.wikidata.org/prop/direct/P509>  ?o1 .  }	['What', 'are', 'the', 'distinct', 'entities', 'that', 'are', 'the', 'cause', 'of', 'death', 'for', 'Q4977246', '?', '(', 'Only', 'the', 'question', 'is', 'translated', ',', 'not', 'the', 'SPARQL', 'query', 'itself', '.', ')']	['Причина', 'смерти', 'Брюса', 'Карвера', '?']	0.1735	0.0829	0.0	132.0
374	"Имея следующий SPARQL запрос: ASK WHERE { <http://www.wikidata.org/entity/Q91>  <http://www.wikidata.org/prop/direct/P20>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P856>  ?o2 .  }   
 Где:
 http://www.wikidata.org/entity/Q91 именуется как ""Авраам Линкольн.""
 http://www.wikidata.org/prop/direct/P20 именуется как ""место смерти.""
 http://www.wikidata.org/prop/direct/P856 именуется как ""официальный сайт.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the official website and place of death of Abraham Lincoln?	Есть ли веб-сайт у места смерти Авраама Линкольна?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q91>  <http://www.wikidata.org/prop/direct/P20>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P856>  ?o2 .  }  	['What', 'is', 'the', 'official', 'website', 'and', 'place', 'of', 'death', 'of', 'Abraham', 'Lincoln', '?']	['Есть', 'ли', 'веб-сайт', 'у', 'места', 'смерти', 'Авраама', 'Линкольна', '?']	0.1911	0.2438	0.0	60.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the official website and place of death of Abraham Lincoln?	У места сметри Авраама Линкольна есть веб-сайт?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q91>  <http://www.wikidata.org/prop/direct/P20>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P856>  ?o2 .  }  	['What', 'is', 'the', 'official', 'website', 'and', 'place', 'of', 'death', 'of', 'Abraham', 'Lincoln', '?']	['У', 'места', 'сметри', 'Авраама', 'Линкольна', 'есть', 'веб-сайт', '?']	0.1911	0.2308	0.0	60.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the official website and place of death of Abraham Lincoln?	Существует ли сайт у места смерти Абрахама Линкольна?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q91>  <http://www.wikidata.org/prop/direct/P20>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P856>  ?o2 .  }  	['What', 'is', 'the', 'official', 'website', 'and', 'place', 'of', 'death', 'of', 'Abraham', 'Lincoln', '?']	['Существует', 'ли', 'сайт', 'у', 'места', 'смерти', 'Абрахама', 'Линкольна', '?']	0.1911	0.2438	0.0	60.0
375	"Имея следующий SPARQL запрос: ASK WHERE { <http://www.wikidata.org/entity/Q303> <http://www.wikidata.org/prop/direct/P40> ?uri } 
 Где:
 http://www.wikidata.org/entity/Q303 именуется как ""Элвис Пресли.""
 http://www.wikidata.org/prop/direct/P40 именуется как ""дети.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the children of Elvis Presley? (Transformed SPARQL query: ASK WHERE { <http://www.wikidata.org/entity/Q303> ?child <http://www.wikidata.org/prop/direct/P40> . } )	У Элвиса Пресли были дети?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q303> <http://www.wikidata.org/prop/direct/P40> ?uri }	['What', 'are', 'the', 'children', 'of', 'Elvis', 'Presley', '?', '(', 'Transformed', 'SPARQL', 'query', ':', 'ASK', 'WHERE', '{', '<', 'http', ':', '//www.wikidata.org/entity/Q303', '>', '?', 'child', '<', 'http', ':', '//www.wikidata.org/prop/direct/P40', '>', '.', '}', ')']	['У', 'Элвиса', 'Пресли', 'были', 'дети', '?']	0.1709	0.0834	0.0	166.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the children of Elvis Presley? (Transformed SPARQL query: ASK WHERE { <http://www.wikidata.org/entity/Q303> ?child <http://www.wikidata.org/prop/direct/P40> . } )	У Елвиса Пресли были дети?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q303> <http://www.wikidata.org/prop/direct/P40> ?uri }	['What', 'are', 'the', 'children', 'of', 'Elvis', 'Presley', '?', '(', 'Transformed', 'SPARQL', 'query', ':', 'ASK', 'WHERE', '{', '<', 'http', ':', '//www.wikidata.org/entity/Q303', '>', '?', 'child', '<', 'http', ':', '//www.wikidata.org/prop/direct/P40', '>', '.', '}', ')']	['У', 'Елвиса', 'Пресли', 'были', 'дети', '?']	0.1709	0.0834	0.0	166.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the children of Elvis Presley? (Transformed SPARQL query: ASK WHERE { <http://www.wikidata.org/entity/Q303> ?child <http://www.wikidata.org/prop/direct/P40> . } )	Имел ли Элвис Пресли детей?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q303> <http://www.wikidata.org/prop/direct/P40> ?uri }	['What', 'are', 'the', 'children', 'of', 'Elvis', 'Presley', '?', '(', 'Transformed', 'SPARQL', 'query', ':', 'ASK', 'WHERE', '{', '<', 'http', ':', '//www.wikidata.org/entity/Q303', '>', '?', 'child', '<', 'http', ':', '//www.wikidata.org/prop/direct/P40', '>', '.', '}', ')']	['Имел', 'ли', 'Элвис', 'Пресли', 'детей', '?']	0.1709	0.0834	0.0	166.0
376	"Имея следующий SPARQL запрос: ASK WHERE { <http://www.wikidata.org/entity/Q76>  <http://www.wikidata.org/prop/direct/P26>  <http://www.wikidata.org/entity/Q13133> . } 
 Где:
 http://www.wikidata.org/entity/Q76 именуется как ""Барак Обама.""
 http://www.wikidata.org/prop/direct/P26 именуется как ""супруг(а).""
 http://www.wikidata.org/entity/Q13133 именуется как ""Мишель Обама.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Is there a statement that Michelle Obama is the spouse of Barack Obama in Wikidata?	Является ли Мишель Обама женой Барака Обамы?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q76>  <http://www.wikidata.org/prop/direct/P26>  <http://www.wikidata.org/entity/Q13133> . }	['Is', 'there', 'a', 'statement', 'that', 'Michelle', 'Obama', 'is', 'the', 'spouse', 'of', 'Barack', 'Obama', 'in', 'Wikidata', '?']	['Является', 'ли', 'Мишель', 'Обама', 'женой', 'Барака', 'Обамы', '?']	0.1869	0.1875	0.0	76.0
377	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q40026> <http://www.wikidata.org/prop/direct/P551> ?uri . ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . } 
 Где:
 http://www.wikidata.org/entity/Q40026 именуется как ""Сильвестр Сталлоне.""
 http://www.wikidata.org/prop/direct/P551 именуется как ""место жительства.""
 http://www.wikidata.org/prop/direct/P31 именуется как ""это частный случай понятия.""
 http://www.wikidata.org/entity/Q515 именуется как ""город.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the cities where Sylvester Stallone resides?	В каком городе живет Сильвестр Сталлоне?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q40026> <http://www.wikidata.org/prop/direct/P551> ?uri . ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'cities', 'where', 'Sylvester', 'Stallone', 'resides', '?']"	['В', 'каком', 'городе', 'живет', 'Сильвестр', 'Сталлоне', '?']	0.1897	0.2005	0.0	69.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct literature works that were published by Viking Press and have Jack Kerouac as their author?	Какие книги Керуака были опубликованы в Viking Press?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT DISTINCT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P123>  <http://www.wikidata.org/entity/Q921536> . ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q47461344> . ?s1  <http://www.wikidata.org/prop/direct/P50>  <http://www.wikidata.org/entity/Q160534> . }	['What', 'are', 'the', 'distinct', 'literature', 'works', 'that', 'were', 'published', 'by', 'Viking', 'Press', 'and', 'have', 'Jack', 'Kerouac', 'as', 'their', 'author', '?']	['Какие', 'книги', 'Керуака', 'были', 'опубликованы', 'в', 'Viking', 'Press', '?']	0.1465	0.4755	0.0741	94.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct literature works that were published by Viking Press and have Jack Kerouac as their author?	Какие книги Керуака были опубликованы в Викинг Пресс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT DISTINCT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P123>  <http://www.wikidata.org/entity/Q921536> . ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q47461344> . ?s1  <http://www.wikidata.org/prop/direct/P50>  <http://www.wikidata.org/entity/Q160534> . }	['What', 'are', 'the', 'distinct', 'literature', 'works', 'that', 'were', 'published', 'by', 'Viking', 'Press', 'and', 'have', 'Jack', 'Kerouac', 'as', 'their', 'author', '?']	['Какие', 'книги', 'Керуака', 'были', 'опубликованы', 'в', 'Викинг', 'Пресс', '?']	0.1818	0.1585	0.0	105.0
379	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q780394> <http://www.wikidata.org/prop/direct/P86> ?uri} 
 Где:
 http://www.wikidata.org/entity/Q780394 именуется как ""Hotel California.""
 http://www.wikidata.org/prop/direct/P86 именуется как ""композитор.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which distinct URIs represent the composers of the music associated with the ""Hotel California"" entity?"	Кто написал песню Отель Калифорния?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q780394> <http://www.wikidata.org/prop/direct/P86> ?uri}	"['Which', 'distinct', 'URIs', 'represent', 'the', 'composers', 'of', 'the', 'music', 'associated', 'with', 'the', '``', 'Hotel', 'California', ""''"", 'entity', '?']"	['Кто', 'написал', 'песню', 'Отель', 'Калифорния', '?']	0.1843	0.1436	0.0	98.0
380	"Имея следующий SPARQL запрос: SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q16>  <http://www.wikidata.org/prop/direct/P36>  ?o1 .  } 
 Где:
 http://www.wikidata.org/entity/Q16 именуется как ""Канада.""
 http://www.wikidata.org/prop/direct/P36 именуется как ""административный центр.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the administrative center of Canada denoted by ?o1 in the following query?:

SELECT DISTINCT ?o1 WHERE {
  <http://www.wikidata.org/entity/Q16>  <http://www.wikidata.org/prop/direct/P36>  ?o1 . 
}"	Столица Канады?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q16>  <http://www.wikidata.org/prop/direct/P36>  ?o1 .  }	['What', 'is', 'the', 'administrative', 'center', 'of', 'Canada', 'denoted', 'by', '?', 'o1', 'in', 'the', 'following', 'query', '?', ':', 'SELECT', 'DISTINCT', '?', 'o1', 'WHERE', '{', '<', 'http', ':', '//www.wikidata.org/entity/Q16', '>', '<', 'http', ':', '//www.wikidata.org/prop/direct/P36', '>', '?', 'o1', '.', '}']	['Столица', 'Канады', '?']	0.1662	0.0428	0.0	202.0
}"	Какая столица у Канады?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q16>  <http://www.wikidata.org/prop/direct/P36>  ?o1 .  }	['What', 'is', 'the', 'administrative', 'center', 'of', 'Canada', 'denoted', 'by', '?', 'o1', 'in', 'the', 'following', 'query', '?', ':', 'SELECT', 'DISTINCT', '?', 'o1', 'WHERE', '{', '<', 'http', ':', '//www.wikidata.org/entity/Q16', '>', '<', 'http', ':', '//www.wikidata.org/prop/direct/P36', '>', '?', 'o1', '.', '}']	['Какая', 'столица', 'у', 'Канады', '?']	0.1662	0.0628	0.0	200.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that have ""Tel-Aviv"" as the head of government?

Translation of the given SPARQL query into a natural language question: Which are the distinct entities that have ""Tel-Aviv"" as their head of government?"	Кто является мэром Тель-Авива?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q33935> <http://www.wikidata.org/prop/direct/P6> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', '``', 'Tel-Aviv', ""''"", 'as', 'the', 'head', 'of', 'government', '?', 'Translation', 'of', 'the', 'given', 'SPARQL', 'query', 'into', 'a', 'natural', 'language', 'question', ':', 'Which', 'are', 'the', 'distinct', 'entities', 'that', 'have', '``', 'Tel-Aviv', ""''"", 'as', 'their', 'head', 'of', 'government', '?']"	['Кто', 'является', 'мэром', 'Тель-Авива', '?']	0.1598	0.0494	0.0	237.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that have the property ""форма правления"" with value different from Russia and have not the property ""дата окончания""?"	Какая политическая система в России?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q159> <http://www.wikidata.org/prop/P122> ?q . ?q <http://www.wikidata.org/prop/statement/P122> ?uri . FILTER NOT EXISTS { ?q <http://www.wikidata.org/prop/qualifier/P582> ?x }} 	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'форма', 'правления', ""''"", 'with', 'value', 'different', 'from', 'Russia', 'and', 'have', 'not', 'the', 'property', '``', 'дата', 'окончания', ""''"", '?']"	['Какая', 'политическая', 'система', 'в', 'России', '?']	0.1709	0.0834	0.0	147.0
383	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q571> . ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q36107> . } 
 Где:
 http://www.wikidata.org/prop/direct/P31 именуется как ""это частный случай понятия.""
 http://www.wikidata.org/entity/Q571 именуется как ""книга.""
 http://www.wikidata.org/prop/direct/P50 именуется как ""автор.""
 http://www.wikidata.org/entity/Q36107 именуется как ""Мухаммед Али.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of books that have the property ""this is an instance of"" with the value ""book"" (Q571 in Wikidata), and have the property ""author"" with the value ""Мухаммед Али"" (Q36107 in Wikidata)?"	Покажите мне книгу, которую написал Мухаммед Али.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q571> . ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q36107> . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'books', 'that', 'have', 'the', 'property', '``', 'this', 'is', 'an', 'instance', 'of', ""''"", 'with', 'the', 'value', '``', 'book', ""''"", '(', 'Q571', 'in', 'Wikidata', ')', ',', 'and', 'have', 'the', 'property', '``', 'author', ""''"", 'with', 'the', 'value', '``', 'Мухаммед', 'Али', ""''"", '(', 'Q36107', 'in', 'Wikidata', ')', '?']"	['Покажите', 'мне', 'книгу', ',', 'которую', 'написал', 'Мухаммед', 'Али', '.']	0.0958	0.1865	0.0	191.0
384	"Имея следующий SPARQL запрос: SELECT ?s WHERE { ?b ps:P793   <http://www.wikidata.org/entity/Q1194369> . ?b pq:P642 <http://www.wikidata.org/entity/Q513> . ?s p:P793 ?b   . } 
 Где:
 ps:P793 именуется как ""ключевое событие.""
 http://www.wikidata.org/entity/Q1194369 именуется как ""первое восхождение.""
 pq:P642 именуется как ""относится к.""
 http://www.wikidata.org/entity/Q513 именуется как ""Джомолунгма.""
 p:P793 именуется как ""ключевое событие.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the key event for the first ascent of Mount Everest (Jomo lungma), which is related to?	Кто первый покорил Эверест?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?s WHERE { ?b ps:P793   <http://www.wikidata.org/entity/Q1194369> . ?b pq:P642 <http://www.wikidata.org/entity/Q513> . ?s p:P793 ?b   . }	['What', 'is', 'the', 'key', 'event', 'for', 'the', 'first', 'ascent', 'of', 'Mount', 'Everest', '(', 'Jomo', 'lungma', ')', ',', 'which', 'is', 'related', 'to', '?']	['Кто', 'первый', 'покорил', 'Эверест', '?']	0.1796	0.1055	0.0	91.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the key event for the first ascent of Mount Everest (Jomo lungma), which is related to?	Кто первым забрался на Эверест?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?s WHERE { ?b ps:P793   <http://www.wikidata.org/entity/Q1194369> . ?b pq:P642 <http://www.wikidata.org/entity/Q513> . ?s p:P793 ?b   . }	['What', 'is', 'the', 'key', 'event', 'for', 'the', 'first', 'ascent', 'of', 'Mount', 'Everest', '(', 'Jomo', 'lungma', ')', ',', 'which', 'is', 'related', 'to', '?']	['Кто', 'первым', 'забрался', 'на', 'Эверест', '?']	0.1796	0.1175	0.0	90.0
2. Classified as a ""язык"" (according to property ""это частный случай понятия"" with value ""Q34770"")."	На сколких языках говорят в Колумбии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT (COUNT(?s1) as ?c) WHERE { ?s1  ?p1  <http://www.wikidata.org/entity/Q739> . ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q34770> .  }	"['What', 'is', 'the', 'number', 'of', 'entities', 'that', 'are', 'both', ':', '1', '.', 'Mentioned', 'as', '``', 'Колумбия', ""''"", '.', '2', '.', 'Classified', 'as', 'a', '``', 'язык', ""''"", '(', 'according', 'to', 'property', '``', 'это', 'частный', 'случай', 'понятия', ""''"", 'with', 'value', '``', 'Q34770', ""''"", ')', '.']"	['На', 'сколких', 'языках', 'говорят', 'в', 'Колумбии', '?']	0.0	0.0	0.0	157.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's representing the currencies of Czechia?	Какая вылюта у Чешской республики?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q213> <http://www.wikidata.org/prop/direct/P38> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'representing', 'the', 'currencies', 'of', 'Czechia', '?']"	['Какая', 'вылюта', 'у', 'Чешской', 'республики', '?']	0.1926	0.2154	0.0	62.0
388	"Имея следующий SPARQL запрос: SELECT DISTINCT ?date WHERE {  <http://www.wikidata.org/entity/Q76334> <http://www.wikidata.org/prop/P106>/<http://www.wikidata.org/prop/qualifier/P582> ?date } 
 Где:
 http://www.wikidata.org/entity/Q76334 именуется как ""Борис Беккер.""
 http://www.wikidata.org/prop/P106 именуется как ""род занятий.""
 http://www.wikidata.org/prop/qualifier/P582 именуется как ""дата окончания.""
