id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI values for entities that have been developed by ""World of Warcraft"" (wd:Q131007)?"	Кто разработал игру «Мир военного ремесла»?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q131007 wdt:P178 ?uri . }	"['What', 'are', 'the', 'distinctive', 'URI', 'values', 'for', 'entities', 'that', 'have', 'been', 'developed', 'by', '``', 'World', 'of', 'Warcraft', ""''"", '(', 'wd', ':', 'Q131007', ')', '?']"	['Кто', 'разработал', 'игру', '«', 'Мир', 'военного', 'ремесла', '»', '?']	0.1774	0.1321	0.0	104.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI values for entities that have been developed by ""World of Warcraft"" (wd:Q131007)?"	Кто является создателем видео игры World of Warcraft?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q131007 wdt:P178 ?uri . }	"['What', 'are', 'the', 'distinctive', 'URI', 'values', 'for', 'entities', 'that', 'have', 'been', 'developed', 'by', '``', 'World', 'of', 'Warcraft', ""''"", '(', 'wd', ':', 'Q131007', ')', '?']"	['Кто', 'является', 'создателем', 'видео', 'игры', 'World', 'of', 'Warcraft', '?']	0.1096	0.5283	0.08	87.0
233	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?name WHERE { wd:Q23215 wdt:P1477 ?name. } 
 Где:
 wd:Q23215 именуется как ""Адель.""
 wdt:P1477 именуется как ""имя при рождении.""
234	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q85 wdt:P1082 ?val . } 
 Где:
 wd:Q85 именуется как ""Каир.""
 wdt:P1082 именуется как ""численность населения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the population size of Kair (wd:Q85)?	Какой размер населения в Каире?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q85 wdt:P1082 ?val . }	['What', 'is', 'the', 'population', 'size', 'of', 'Kair', '(', 'wd', ':', 'Q85', ')', '?']	['Какой', 'размер', 'населения', 'в', 'Каире', '?']	0.1911	0.1988	0.0	41.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the population size of Kair (wd:Q85)?	Сколько людей проживает в Каире?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q85 wdt:P1082 ?val . }	['What', 'is', 'the', 'population', 'size', 'of', 'Kair', '(', 'wd', ':', 'Q85', ')', '?']	['Сколько', 'людей', 'проживает', 'в', 'Каире', '?']	0.1911	0.1988	0.0	41.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Does the entity with the label ""Frank Herbert"" have a property ""date of death"" that is not bound to any value?"	Жив ли до сих пор Фрэнк Герберт?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q7934> <http://www.wikidata.org/prop/direct/P570> ?date . FILTER(!BOUND(?date)) }	"['Does', 'the', 'entity', 'with', 'the', 'label', '``', 'Frank', 'Herbert', ""''"", 'have', 'a', 'property', '``', 'date', 'of', 'death', ""''"", 'that', 'is', 'not', 'bound', 'to', 'any', 'value', '?']"	['Жив', 'ли', 'до', 'сих', 'пор', 'Фрэнк', 'Герберт', '?']	0.1754	0.1154	0.0	103.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Does the entity with the label ""Frank Herbert"" have a property ""date of death"" that is not bound to any value?"	Жив ли Фрэнк Герберт?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q7934> <http://www.wikidata.org/prop/direct/P570> ?date . FILTER(!BOUND(?date)) }	"['Does', 'the', 'entity', 'with', 'the', 'label', '``', 'Frank', 'Herbert', ""''"", 'have', 'a', 'property', '``', 'date', 'of', 'death', ""''"", 'that', 'is', 'not', 'bound', 'to', 'any', 'value', '?']"	['Жив', 'ли', 'Фрэнк', 'Герберт', '?']	0.1754	0.0893	0.0	106.0
236	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P50 wd:Q7345 ; wdt:P577 ?date . } ORDER BY DESC(?date) LIMIT 1 
 Где:
 wdt:P50 именуется как ""автор.""
 wd:Q7345 именуется как ""Дэн Браун.""
 wdt:P577 именуется как ""дата публикации.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the most recent publication date for an author with the name ""Dan Brown""?"	Какое последние произведение Дэна Брауна?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P50 wd:Q7345 ; wdt:P577 ?date . } ORDER BY DESC(?date) LIMIT 1	"['What', 'is', 'the', 'most', 'recent', 'publication', 'date', 'for', 'an', 'author', 'with', 'the', 'name', '``', 'Dan', 'Brown', ""''"", '?']"	['Какое', 'последние', 'произведение', 'Дэна', 'Брауна', '?']	0.1843	0.1436	0.0	76.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the most recent publication date for an author with the name ""Dan Brown""?"	Какая книга написана Дэном Брауном последней?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P50 wd:Q7345 ; wdt:P577 ?date . } ORDER BY DESC(?date) LIMIT 1	"['What', 'is', 'the', 'most', 'recent', 'publication', 'date', 'for', 'an', 'author', 'with', 'the', 'name', '``', 'Dan', 'Brown', ""''"", '?']"	['Какая', 'книга', 'написана', 'Дэном', 'Брауном', 'последней', '?']	0.1843	0.156	0.0	75.0
237	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { VALUES ?p { wdt:P17 wdt:P276 wdt:P131 } wd:Q41085 ?p ?uri . } 
 Где:
 wdt:P17 именуется как ""государство.""
 wdt:P276 именуется как ""местонахождение.""
 wdt:P131 именуется как ""административно-территориальная единица.""
 wd:Q41085 именуется как ""Университет Сонгюнгван.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that have the following properties:

1. are a 'государство' (P17);
2. have a 'местонахождение' (P276);
3. are an 'административно-территориальная единица' (P131);
4. contain the University ""Сонгюнгван"" (wd:Q41085)?"	Где находится университет Сонгюнгван?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { VALUES ?p { wdt:P17 wdt:P276 wdt:P131 } wd:Q41085 ?p ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'the', 'following', 'properties', ':', '1.', 'are', 'a', ""'государство"", ""'"", '(', 'P17', ')', ';', '2.', 'have', 'a', ""'местонахождение"", ""'"", '(', 'P276', ')', ';', '3.', 'are', 'an', ""'административно-территориальная"", 'единица', ""'"", '(', 'P131', ')', ';', '4.', 'contain', 'the', 'University', '``', 'Сонгюнгван', ""''"", '(', 'wd', ':', 'Q41085', ')', '?']"	['Где', 'находится', 'университет', 'Сонгюнгван', '?']	0.1851	0.0844	0.0	225.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of authors for the entity with the label ""Толкование сновидений.""?"	"Кто автор ""Толкование сновидений""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q726382 wdt:P50 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'authors', 'for', 'the', 'entity', 'with', 'the', 'label', '``', 'Толкование', 'сновидений', '.', '``', '?']"	"['Кто', 'автор', '``', 'Толкование', 'сновидений', ""''"", '?']"	0.1258	0.5615	0.1111	68.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of authors for the entity with the label ""Толкование сновидений.""?"	Кто является основателем толкования снов?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q726382 wdt:P50 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'authors', 'for', 'the', 'entity', 'with', 'the', 'label', '``', 'Толкование', 'сновидений', '.', '``', '?']"	['Кто', 'является', 'основателем', 'толкования', 'снов', '?']	0.1818	0.1292	0.0	77.0
239	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q692 wdt:P570 ?uri . } 
 Где:
 wd:Q692 именуется как ""Уильям Шекспир.""
 wdt:P570 именуется как ""дата смерти.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the entities that have the property ""date of death"" with value for the entity ""William Shakespeare"" (wd:Q692)?"	Когда умер Шекспир?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q692 wdt:P570 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'have', 'the', 'property', '``', 'date', 'of', 'death', ""''"", 'with', 'value', 'for', 'the', 'entity', '``', 'William', 'Shakespeare', ""''"", '(', 'wd', ':', 'Q692', ')', '?']"	['Когда', 'умер', 'Шекспир', '?']	0.1693	0.0606	0.0	138.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the entities that produce Slack (a messaging app)?	Кто создал Слак?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P1056> <http://www.wikidata.org/entity/Q17130715>}	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'produce', 'Slack', '(', 'a', 'messaging', 'app', ')', '?']"	['Кто', 'создал', 'Слак', '?']	0.1843	0.1111	0.0	78.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the distinct year of birth for Rachel Stevens (wd:Q241665)?	В каком году родился Рэйчел Стивенс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?year WHERE { wd:Q241665 wdt:P569 ?date . BIND(YEAR(?date) as ?year) }	['What', 'is', 'the', 'distinct', 'year', 'of', 'birth', 'for', 'Rachel', 'Stevens', '(', 'wd', ':', 'Q241665', ')', '?']	['В', 'каком', 'году', 'родился', 'Рэйчел', 'Стивенс', '?']	0.1869	0.1755	0.0	61.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the distinct year of birth for Rachel Stevens (wd:Q241665)?	В каком году родился Рейчел Стивенс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?year WHERE { wd:Q241665 wdt:P569 ?date . BIND(YEAR(?date) as ?year) }	['What', 'is', 'the', 'distinct', 'year', 'of', 'birth', 'for', 'Rachel', 'Stevens', '(', 'wd', ':', 'Q241665', ')', '?']	['В', 'каком', 'году', 'родился', 'Рейчел', 'Стивенс', '?']	0.1869	0.1755	0.0	61.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Вопрос: ""Сколько diferent people were married to Jane Fonda?"""	Сколько раз Джейн Фонда выходила замуж?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { wd:Q41142 wdt:P26 ?uri . }	"['Вопрос', ':', '``', 'Сколько', 'diferent', 'people', 'were', 'married', 'to', 'Jane', 'Fonda', '?', ""''""]"	['Сколько', 'раз', 'Джейн', 'Фонда', 'выходила', 'замуж', '?']	0.2273	0.4319	0.0	49.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Вопрос: ""Сколько diferent people were married to Jane Fonda?"""	Как часто Джейн Фонда выходила замуж?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { wd:Q41142 wdt:P26 ?uri . }	"['Вопрос', ':', '``', 'Сколько', 'diferent', 'people', 'were', 'married', 'to', 'Jane', 'Fonda', '?', ""''""]"	['Как', 'часто', 'Джейн', 'Фонда', 'выходила', 'замуж', '?']	0.1911	0.216	0.0	54.0
245	"Имея следующий SPARQL запрос: ASK WHERE { <http://www.wikidata.org/entity/Q91> <http://www.wikidata.org/prop/direct/P26> ?spouse .  ?spouse <http://www.w3.org/2000/01/rdf-schema#label> ?name .  FILTER(regex(?name,'Mary')) } 
 Где:
 http://www.wikidata.org/entity/Q91 именуется как ""Авраам Линкольн.""
 http://www.wikidata.org/prop/direct/P26 именуется как ""супруг(а).""
 http://www.w3.org/2000/01/rdf-schema#label именуется как ""label.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the label of the wife of Abraham Lincoln labeled with the name ""Mary""?"	Звалили жену президента Линкольна Мерри?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q91> <http://www.wikidata.org/prop/direct/P26> ?spouse .  ?spouse <http://www.w3.org/2000/01/rdf-schema#label> ?name .  FILTER(regex(?name,'Mary')) }	"['What', 'is', 'the', 'label', 'of', 'the', 'wife', 'of', 'Abraham', 'Lincoln', 'labeled', 'with', 'the', 'name', '``', 'Mary', ""''"", '?']"	['Звалили', 'жену', 'президента', 'Линкольна', 'Мерри', '?']	0.1843	0.1436	0.0	73.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the label of the wife of Abraham Lincoln labeled with the name ""Mary""?"	Жену президента Линкольна звали Мэри?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q91> <http://www.wikidata.org/prop/direct/P26> ?spouse .  ?spouse <http://www.w3.org/2000/01/rdf-schema#label> ?name .  FILTER(regex(?name,'Mary')) }	"['What', 'is', 'the', 'label', 'of', 'the', 'wife', 'of', 'Abraham', 'Lincoln', 'labeled', 'with', 'the', 'name', '``', 'Mary', ""''"", '?']"	['Жену', 'президента', 'Линкольна', 'звали', 'Мэри', '?']	0.1843	0.1436	0.0	73.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that have the property ""language of programming"" with GIMP (wd:Q8038) as their value?"	На каком языке программирования написан GIMP?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q8038 wdt:P277 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'language', 'of', 'programming', ""''"", 'with', 'GIMP', '(', 'wd', ':', 'Q8038', ')', 'as', 'their', 'value', '?']"	['На', 'каком', 'языке', 'программирования', 'написан', 'GIMP', '?']	0.2064	0.2005	0.0	115.0
248	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { VALUES ?types { wd:Q3918 wd:Q875538 } wd:Q567 wdt:P69 ?uri . ?uri wdt:P31 ?types . } 
 Где:
 wd:Q3918 именуется как ""университет.""
 wd:Q875538 именуется как ""общественный университет.""
 wd:Q567 именуется как ""Ангела Меркель.""
 wdt:P69 именуется как ""учебное заведение.""
 wdt:P31 именуется как ""это частный случай понятия.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of universities and public universities that have the property ""educational institution"" (wdt:P69) and are subtypes of ""university"" (wd:Q567) and ""public university"" (wd:Q875538) respectively?"	Какие университеты посетила Ангела Меркель?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { VALUES ?types { wd:Q3918 wd:Q875538 } wd:Q567 wdt:P69 ?uri . ?uri wdt:P31 ?types . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'universities', 'and', 'public', 'universities', 'that', 'have', 'the', 'property', '``', 'educational', 'institution', ""''"", '(', 'wdt', ':', 'P69', ')', 'and', 'are', 'subtypes', 'of', '``', 'university', ""''"", '(', 'wd', ':', 'Q567', ')', 'and', '``', 'public', 'university', ""''"", '(', 'wd', ':', 'Q875538', ')', 'respectively', '?']"	['Какие', 'университеты', 'посетила', 'Ангела', 'Меркель', '?']	0.1593	0.0539	0.0	215.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive instances of ""dramatic-musical compositions"" that have a composer belonging to the class of ""composers"" and are subclasses of or directly linked to ""dramatic-musical compositions"" as a whole?"	Перечислите все мюзиклы с музыкой Этона Джона.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q58483083 ; wdt:P86 wd:Q2808 . }	"['What', 'are', 'the', 'distinctive', 'instances', 'of', '``', 'dramatic-musical', 'compositions', ""''"", 'that', 'have', 'a', 'composer', 'belonging', 'to', 'the', 'class', 'of', '``', 'composers', ""''"", 'and', 'are', 'subclasses', 'of', 'or', 'directly', 'linked', 'to', '``', 'dramatic-musical', 'compositions', ""''"", 'as', 'a', 'whole', '?']"	['Перечислите', 'все', 'мюзиклы', 'с', 'музыкой', 'Этона', 'Джона', '.']	0.0	0.0	0.0	210.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which river has the longest length, in meters, according to Wikidata, with a known length value and an available conversion to meters, if such information is available?	Какая река является самой длинной в мире?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	"PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4022 . ?uri p:P2043 ?stmnode. ?stmnode psv:P2043 ?valuenode . ?valuenode wikibase:quantityAmount ?length . ?valuenode wikibase:quantityUnit ?unit . ?valuenode wikibase:quantityLowerBound ?lowerbound. ?valuenode wikibase:quantityUpperBound ?upperbound. BIND((?upperbound-?lowerbound)/2 AS ?precision). BIND(IF(?precision=0, ?length, (CONCAT(str(?length), ""±"", str(?precision)))) AS ?length2). ?unit p:P2370 ?unitstmnode . ?unitstmnode psv:P2370 ?unitvaluenode . ?unitvaluenode wikibase:quantityAmount ?conversion . ?unitvaluenode wikibase:quantityUnit wd:Q11573 . BIND(?length * ?conversion AS ?length_in_m) . } ORDER BY DESC(?length_in_m) LIMIT 1"	['Which', 'river', 'has', 'the', 'longest', 'length', ',', 'in', 'meters', ',', 'according', 'to', 'Wikidata', ',', 'with', 'a', 'known', 'length', 'value', 'and', 'an', 'available', 'conversion', 'to', 'meters', ',', 'if', 'such', 'information', 'is', 'available', '?']	['Какая', 'река', 'является', 'самой', 'длинной', 'в', 'мире', '?']	0.1701	0.0938	0.0	161.0
252	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q11806 wdt:P569 ?val . } 
 Где:
 wd:Q11806 именуется как ""Джон Адамс.""
 wdt:P569 именуется как ""дата рождения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct dates of birth for ""John Adams"" (wd:Q11806)?"	Когда родился Джон Адамс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q11806 wdt:P569 ?val . }	"['What', 'are', 'the', 'distinct', 'dates', 'of', 'birth', 'for', '``', 'John', 'Adams', ""''"", '(', 'wd', ':', 'Q11806', ')', '?']"	['Когда', 'родился', 'Джон', 'Адамс', '?']	0.1843	0.129	0.0	62.0
253	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?hovercraft wdt:P31/wdt:P279* wd:Q185757 ; wdt:P176 ?uri . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q185757 именуется как ""Судно на воздушной подушке.""
 wdt:P176 именуется как ""производитель.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the hovercrafts that are subclasses of ""Suitable for water transport by buoyant cushions"" (Q185757) and have a listed producer?"	Какие компании производят суда на воздушной подушке	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?hovercraft wdt:P31/wdt:P279* wd:Q185757 ; wdt:P176 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'hovercrafts', 'that', 'are', 'subclasses', 'of', '``', 'Suitable', 'for', 'water', 'transport', 'by', 'buoyant', 'cushions', ""''"", '(', 'Q185757', ')', 'and', 'have', 'a', 'listed', 'producer', '?']"	['Какие', 'компании', 'производят', 'суда', 'на', 'воздушной', 'подушке']	0.0	0.0	0.0	152.0
254	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q91 wdt:P26 ?uri . } 
 Где:
 wd:Q91 именуется как ""Авраам Линкольн.""
 wdt:P26 именуется как ""супруг(а).""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI identifiers for the individuals who were the spouses of Abraham Lincoln identified by the URI wd:Q91?	Как звали жену президента США Линкольна	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q91 wdt:P26 ?uri . }	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'for', 'the', 'individuals', 'who', 'were', 'the', 'spouses', 'of', 'Abraham', 'Lincoln', 'identified', 'by', 'the', 'URI', 'wd', ':', 'Q91', '?']	['Как', 'звали', 'жену', 'президента', 'США', 'Линкольна']	0.0	0.0	0.0	122.0
255	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q7378 wdt:P279 ?uri . } 
 Где:
 wd:Q7378 именуется как ""слон.""
 wdt:P279 именуется как ""подкласс от.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the entities that are subclasses of the ""elephant"" (wd:Q7378)?"	К какому биологическому виду принадлежат слоны	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q7378 wdt:P279 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'are', 'subclasses', 'of', 'the', '``', 'elephant', ""''"", '(', 'wd', ':', 'Q7378', ')', '?']"	['К', 'какому', 'биологическому', 'виду', 'принадлежат', 'слоны']	0.0	0.0	0.0	88.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the entities that are subclasses of the ""elephant"" (wd:Q7378)?"	К какому виду принадлежит слон?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q7378 wdt:P279 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'are', 'subclasses', 'of', 'the', '``', 'elephant', ""''"", '(', 'wd', ':', 'Q7378', ')', '?']"	['К', 'какому', 'виду', 'принадлежит', 'слон', '?']	0.1785	0.1124	0.0	88.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the population size of the administrative center of Australia?	Сколько людей живет в столице Австралии	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?number WHERE { <http://www.wikidata.org/entity/Q408> <http://www.wikidata.org/prop/direct/P36> ?uri . ?uri <http://www.wikidata.org/prop/direct/P1082> ?number . }	['What', 'is', 'the', 'population', 'size', 'of', 'the', 'administrative', 'center', 'of', 'Australia', '?']	['Сколько', 'людей', 'живет', 'в', 'столице', 'Австралии']	0.0	0.0	0.0	65.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the number of distinct works associated with Albert Einstein (wd:Q937)?	Сколько теорий придумал Альберт Эйнштейн	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) as ?cnt) WHERE { wd:Q937 wdt:P800 ?uri . }	['What', 'is', 'the', 'number', 'of', 'distinct', 'works', 'associated', 'with', 'Albert', 'Einstein', '(', 'wd', ':', 'Q937', ')', '?']	['Сколько', 'теорий', 'придумал', 'Альберт', 'Эйнштейн']	0.0	0.0	0.0	75.0
259	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q44578> <http://www.wikidata.org/prop/direct/P86> ?uri } 
 Где:
 http://www.wikidata.org/entity/Q44578 именуется как ""Титаник.""
 http://www.wikidata.org/prop/direct/P86 именуется как ""композитор.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that have the property ""composer"" with the value ""Titanic"" (which is actually an error as Titanic is not a composer, but a ship)?

Here is the corrected SPARQL query for getting the composers of a given work:

SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q44578> <http://www.wikidata.org/prop/direct/P182> ?work .
     ?work <http://www.wikidata.org/prop/direct/P86> ?uri .
}

This query will return the URI's of the composers for the entity with ID Q44578, which is ""Titanic"" in this case, but it's important to note that the assumption that ""Titanic"" is a composer is incorrect."	"Кто сочинил саундтрек к фильму ""Титаник"" режиссера Кэмерона"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q44578> <http://www.wikidata.org/prop/direct/P86> ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'composer', ""''"", 'with', 'the', 'value', '``', 'Titanic', ""''"", '(', 'which', 'is', 'actually', 'an', 'error', 'as', 'Titanic', 'is', 'not', 'a', 'composer', ',', 'but', 'a', 'ship', ')', '?', 'Here', 'is', 'the', 'corrected', 'SPARQL', 'query', 'for', 'getting', 'the', 'composers', 'of', 'a', 'given', 'work', ':', 'SELECT', 'DISTINCT', '?', 'uri', 'WHERE', '{', '<', 'http', ':', '//www.wikidata.org/entity/Q44578', '>', '<', 'http', ':', '//www.wikidata.org/prop/direct/P182', '>', '?', 'work', '.', '?', 'work', '<', 'http', ':', '//www.wikidata.org/prop/direct/P86', '>', '?', 'uri', '.', '}', 'This', 'query', 'will', 'return', 'the', 'URI', ""'s"", 'of', 'the', 'composers', 'for', 'the', 'entity', 'with', 'ID', 'Q44578', ',', 'which', 'is', '``', 'Titanic', ""''"", 'in', 'this', 'case', ',', 'but', 'it', ""'s"", 'important', 'to', 'note', 'that', 'the', 'assumption', 'that', '``', 'Titanic', ""''"", 'is', 'a', 'composer', 'is', 'incorrect', '.']"	"['Кто', 'сочинил', 'саундтрек', 'к', 'фильму', '``', 'Титаник', ""''"", 'режиссера', 'Кэмерона']"	0.1582	0.0515	0.0	628.0
This query will return the URI's of the composers for the entity with ID Q44578, which is ""Titanic"" in this case, but it's important to note that the assumption that ""Titanic"" is a composer is incorrect."	Кто сочинил саундтрек к Титанику Кэмерона?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q44578> <http://www.wikidata.org/prop/direct/P86> ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'composer', ""''"", 'with', 'the', 'value', '``', 'Titanic', ""''"", '(', 'which', 'is', 'actually', 'an', 'error', 'as', 'Titanic', 'is', 'not', 'a', 'composer', ',', 'but', 'a', 'ship', ')', '?', 'Here', 'is', 'the', 'corrected', 'SPARQL', 'query', 'for', 'getting', 'the', 'composers', 'of', 'a', 'given', 'work', ':', 'SELECT', 'DISTINCT', '?', 'uri', 'WHERE', '{', '<', 'http', ':', '//www.wikidata.org/entity/Q44578', '>', '<', 'http', ':', '//www.wikidata.org/prop/direct/P182', '>', '?', 'work', '.', '?', 'work', '<', 'http', ':', '//www.wikidata.org/prop/direct/P86', '>', '?', 'uri', '.', '}', 'This', 'query', 'will', 'return', 'the', 'URI', ""'s"", 'of', 'the', 'composers', 'for', 'the', 'entity', 'with', 'ID', 'Q44578', ',', 'which', 'is', '``', 'Titanic', ""''"", 'in', 'this', 'case', ',', 'but', 'it', ""'s"", 'important', 'to', 'note', 'that', 'the', 'assumption', 'that', '``', 'Titanic', ""''"", 'is', 'a', 'composer', 'is', 'incorrect', '.']"	['Кто', 'сочинил', 'саундтрек', 'к', 'Титанику', 'Кэмерона', '?']	0.133	0.0218	0.0	631.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the duration for the ""History of Toys"" entity?"	"Сколько длятся суммарно мультфильмы ""История игрушек"""	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?val WHERE { wd:Q171048 wdt:P2047 ?val . }	"['What', 'is', 'the', 'duration', 'for', 'the', '``', 'History', 'of', 'Toys', ""''"", 'entity', '?']"	"['Сколько', 'длятся', 'суммарно', 'мультфильмы', '``', 'История', 'игрушек', ""''""]"	0.2273	0.4615	0.0	51.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the duration for the ""History of Toys"" entity?"	Укажите длительность Истории игрушек.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?val WHERE { wd:Q171048 wdt:P2047 ?val . }	"['What', 'is', 'the', 'duration', 'for', 'the', '``', 'History', 'of', 'Toys', ""''"", 'entity', '?']"	['Укажите', 'длительность', 'Истории', 'игрушек', '.']	0.0	0.0	0.0	51.0
