id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI's of individuals that held the position of ""president"" and were born in the year 1945, having a direct parent classification of ""occupation"" with the subclass ""head of state"" or ""government""?"	Какие президенты родились в 1945?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P39>/<http://www.wikidata.org/prop/direct/P279> <http://www.wikidata.org/entity/Q30461> . ?uri <http://www.wikidata.org/prop/direct/P569> ?date . FILTER(year(?date)=1945) }	"['What', 'are', 'the', 'URI', ""'s"", 'of', 'individuals', 'that', 'held', 'the', 'position', 'of', '``', 'president', ""''"", 'and', 'were', 'born', 'in', 'the', 'year', '1945', ',', 'having', 'a', 'direct', 'parent', 'classification', 'of', '``', 'occupation', ""''"", 'with', 'the', 'subclass', '``', 'head', 'of', 'state', ""''"", 'or', '``', 'government', ""''"", '?']"	['Какие', 'президенты', 'родились', 'в', '1945', '?']	0.1915	0.1149	0.0	199.0
44	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q189080> <http://www.wikidata.org/prop/direct/P136> ?uri . } 
 Где:
 http://www.wikidata.org/entity/Q189080 именуется как ""Лу Рид.""
 http://www.wikidata.org/prop/direct/P136 именуется как ""жанр.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct Uris of entities that have the genre property with a value related to ""Lu Reid"" (Q189080)?"	Какую музыку играл Лу Рид?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q189080> <http://www.wikidata.org/prop/direct/P136> ?uri . }	"['What', 'are', 'the', 'distinct', 'Uris', 'of', 'entities', 'that', 'have', 'the', 'genre', 'property', 'with', 'a', 'value', 'related', 'to', '``', 'Lu', 'Reid', ""''"", '(', 'Q189080', ')', '?']"	['Какую', 'музыку', 'играл', 'Лу', 'Рид', '?']	0.1764	0.1034	0.0	107.0
45	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q213959> <http://www.wikidata.org/prop/direct/P115> ?uri } 
 Где:
 http://www.wikidata.org/entity/Q213959 именуется как ""Бостон Ред Сокс.""
 http://www.wikidata.org/prop/direct/P115 именуется как ""домашний стадион.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers for the home stadiums of ""Boston Red Sox"" (Q213959)?"	Где играли Ред Сокс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q213959> <http://www.wikidata.org/prop/direct/P115> ?uri }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'for', 'the', 'home', 'stadiums', 'of', '``', 'Boston', 'Red', 'Sox', ""''"", '(', 'Q213959', ')', '?']"	['Где', 'играли', 'Ред', 'Сокс', '?']	0.1818	0.1161	0.0	86.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of football clubs that are a subtype of a club and compete in the German Championship (Championship of Germany for football)?	Покажи список футбольных клубов, которые играли в Бундеслиге	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q476028 ; wdt:P118 wd:Q82595 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'football', 'clubs', 'that', 'are', 'a', 'subtype', 'of', 'a', 'club', 'and', 'compete', 'in', 'the', 'German', 'Championship', '(', 'Championship', 'of', 'Germany', 'for', 'football', ')', '?']"	['Покажи', 'список', 'футбольных', 'клубов', ',', 'которые', 'играли', 'в', 'Бундеслиге']	0.0	0.0	0.0	146.0
48	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q12280 ; wdt:P177 wd:Q1471 . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q12280 именуется как ""мост.""
 wdt:P177 именуется как ""проходит над/под.""
 wd:Q1471 именуется как ""Сена.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI's of the bridges (wd:Q12280) that are part of the concept ""is a bridge over or under a body of water, specifically a senate"" (wd:Q1471 and wdt:P31: ""is a bridge"") and have the property ""proceeds over or under"" (wdt:P177) some body of water?"	Какие мосты пересекают Сену?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q12280 ; wdt:P177 wd:Q1471 . }	"['What', 'are', 'the', 'URI', ""'s"", 'of', 'the', 'bridges', '(', 'wd', ':', 'Q12280', ')', 'that', 'are', 'part', 'of', 'the', 'concept', '``', 'is', 'a', 'bridge', 'over', 'or', 'under', 'a', 'body', 'of', 'water', ',', 'specifically', 'a', 'senate', ""''"", '(', 'wd', ':', 'Q1471', 'and', 'wdt', ':', 'P31', ':', '``', 'is', 'a', 'bridge', ""''"", ')', 'and', 'have', 'the', 'property', '``', 'proceeds', 'over', 'or', 'under', ""''"", '(', 'wdt', ':', 'P177', ')', 'some', 'body', 'of', 'water', '?']"	['Какие', 'мосты', 'пересекают', 'Сену', '?']	0.1491	0.0332	0.0	253.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""Сколько сущеstветствующие сущностей в Wikidata производили ""Хэла Роуча"" в качестве продюсера?"""	Сколько фильмов продюсировал Хэл Роуч?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(?uri) as ?c) WHERE { ?uri wdt:P162 wd:Q72792 . }	"['``', 'Сколько', 'сущеstветствующие', 'сущностей', 'в', 'Wikidata', 'производили', '``', 'Хэла', 'Роуча', ""''"", 'в', 'качестве', 'продюсера', '?', ""''""]"	['Сколько', 'фильмов', 'продюсировал', 'Хэл', 'Роуч', '?']	0.2223	0.3231	0.0	69.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the entity with the most distinct cause of death statements? (Where cause of death is represented by property ""P509"" in Wikidata.)"	Какая самая частая причина смерти	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?s wdt:P509 ?uri . } GROUP BY ?uri ORDER BY DESC(COUNT(DISTINCT ?s)) LIMIT 1	"['What', 'is', 'the', 'entity', 'with', 'the', 'most', 'distinct', 'cause', 'of', 'death', 'statements', '?', '(', 'Where', 'cause', 'of', 'death', 'is', 'represented', 'by', 'property', '``', 'P509', ""''"", 'in', 'Wikidata', '.', ')']"	['Какая', 'самая', 'частая', 'причина', 'смерти']	0.0	0.0	0.0	134.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the entity with the most distinct cause of death statements? (Where cause of death is represented by property ""P509"" in Wikidata.)"	Какова самая частая причина смерти?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?s wdt:P509 ?uri . } GROUP BY ?uri ORDER BY DESC(COUNT(DISTINCT ?s)) LIMIT 1	"['What', 'is', 'the', 'entity', 'with', 'the', 'most', 'distinct', 'cause', 'of', 'death', 'statements', '?', '(', 'Where', 'cause', 'of', 'death', 'is', 'represented', 'by', 'property', '``', 'P509', ""''"", 'in', 'Wikidata', '.', ')']"	['Какова', 'самая', 'частая', 'причина', 'смерти', '?']	0.1726	0.0891	0.0	133.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the birthdates of the top 4 basketball players who have received the MVP award, as labeled in English?	Назовите четырех самых молодых MVP баскетболистов	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	"PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P106 wd:Q3665646 ; wdt:P569 ?birthDate ; wdt:P166 ?award . ?award rdfs:label ?awardLabel FILTER (CONTAINS(STR(?awardLabel), ""MVP"") || CONTAINS(STR(?awardLabel), ""Most Valuable Player"")) . FILTER (LANGMATCHES(LANG(?awardLabel), ""EN"" ) ) } ORDER BY DESC(?birthDate) LIMIT 4"	['What', 'are', 'the', 'birthdates', 'of', 'the', 'top', '4', 'basketball', 'players', 'who', 'have', 'received', 'the', 'MVP', 'award', ',', 'as', 'labeled', 'in', 'English', '?']	['Назовите', 'четырех', 'самых', 'молодых', 'MVP', 'баскетболистов']	0.1796	0.1175	0.0833	103.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI's of the businesses that are subclasses of ""бизнес-предприятие"" and have their headquarters located in ""Мюнхен"", indicated by the property ""расположение штаб-квартиры""?"	Перечислите все компании в Мюнхене	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q4830453 . ?uri wdt:P31 ?type ; wdt:P159 wd:Q1726 . }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'the', 'businesses', 'that', 'are', 'subclasses', 'of', '``', 'бизнес-предприятие', ""''"", 'and', 'have', 'their', 'headquarters', 'located', 'in', '``', 'Мюнхен', ""''"", ',', 'indicated', 'by', 'the', 'property', '``', 'расположение', 'штаб-квартиры', ""''"", '?']"	['Перечислите', 'все', 'компании', 'в', 'Мюнхене']	0.0	0.0	0.0	181.0
55	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q5451 wdt:P17 ?country . ?country wdt:P36 ?uri . } 
 Где:
 wd:Q5451 именуется как ""Гималаи.""
 wdt:P17 именуется как ""государство.""
 wdt:P36 именуется как ""административный центр.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the administrative centers of the countries that are a part of the Himalayas?	Перечислите столицы всех стран, через которые проходят Гималаи	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q5451 wdt:P17 ?country . ?country wdt:P36 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'administrative', 'centers', 'of', 'the', 'countries', 'that', 'are', 'a', 'part', 'of', 'the', 'Himalayas', '?']"	['Перечислите', 'столицы', 'всех', 'стран', ',', 'через', 'которые', 'проходят', 'Гималаи']	0.0	0.0	0.0	101.0
56	"Имея следующий SPARQL запрос: SELECT (COUNT(DISTINCT ?uri) as ?count) WHERE {  ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q315484> . } 
 Где:
 http://www.wikidata.org/prop/direct/P57 именуется как ""режиссёр.""
 http://www.wikidata.org/entity/Q315484 именуется как ""Пак Чхан Ук.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the number of distinct directors (P57 property) who have worked on films featuring Park Chan-wck (Q315484)?	В скольки фильмах Пак Чхан Ук был режиссером	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT (COUNT(DISTINCT ?uri) as ?count) WHERE {  ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q315484> . }	['What', 'is', 'the', 'number', 'of', 'distinct', 'directors', '(', 'P57', 'property', ')', 'who', 'have', 'worked', 'on', 'films', 'featuring', 'Park', 'Chan-wck', '(', 'Q315484', ')', '?']	['В', 'скольки', 'фильмах', 'Пак', 'Чхан', 'Ук', 'был', 'режиссером']	0.0	0.0	0.0	108.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the number of distinct directors (P57 property) who have worked on films featuring Park Chan-wck (Q315484)?	Сколько фильмов снял Парк Чан Вук?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT (COUNT(DISTINCT ?uri) as ?count) WHERE {  ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q315484> . }	['What', 'is', 'the', 'number', 'of', 'distinct', 'directors', '(', 'P57', 'property', ')', 'who', 'have', 'worked', 'on', 'films', 'featuring', 'Park', 'Chan-wck', '(', 'Q315484', ')', '?']	['Сколько', 'фильмов', 'снял', 'Парк', 'Чан', 'Вук', '?']	0.1785	0.1221	0.0	109.0
57	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4022 . ?lake wdt:P31 wd:Q23397 ; wdt:P17 wd:183 . ?uri wdt:P200 ?lake . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q4022 именуется как ""река.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q23397 именуется как ""озеро.""
 wdt:P17 именуется как ""государство.""
 wdt:P200 именуется как ""впадающие в озеро реки.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI identifiers of the rivers that are tributaries of lakes, which in turn are located in a country and are identified as lakes in Wikidata?	Какие реки впадают в озера Германии	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4022 . ?lake wdt:P31 wd:Q23397 ; wdt:P17 wd:183 . ?uri wdt:P200 ?lake . }	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'the', 'rivers', 'that', 'are', 'tributaries', 'of', 'lakes', ',', 'which', 'in', 'turn', 'are', 'located', 'in', 'a', 'country', 'and', 'are', 'identified', 'as', 'lakes', 'in', 'Wikidata', '?']	['Какие', 'реки', 'впадают', 'в', 'озера', 'Германии']	0.0	0.0	0.0	157.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""Сколько различных авиакомпаний имеется в Викиданных как частные случаи понятия 'Авиакомпания'?"""	Сколько всего авиакомпаний?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) AS ?uri) WHERE { ?uri wdt:P31 wd:Q46970 }	"['``', 'Сколько', 'различных', 'авиакомпаний', 'имеется', 'в', 'Викиданных', 'как', 'частные', 'случаи', 'понятия', ""'Авиакомпания"", ""'"", '?', ""''""]"	['Сколько', 'всего', 'авиакомпаний', '?']	0.2478	0.4	0.0	72.0
59	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q23442 ; wdt:P17 wd:Q17 . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q23442 именуется как ""остров.""
 wdt:P17 именуется как ""государство.""
 wd:Q17 именуется как ""Япония.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Возможный естественно-ярлыковый вопрос для данного SPARQL-запроса: ""Выведите URI всех островов, которые являются частным случаем понятия ""остров"" и принадлежат государству ""Япония"""".

Предположим, что мы хотим получить список островов, которые являются частными случаями понятия ""остров"" и принадлежат государству ""Япония"". Для решения этой задачи мы можем использовать SPARQL-запрос, приведенный выше. Но если мы хотим переформулировать эту задачу вопросом на естественном языке, то можно сформулировать его следующим образом:

""Выведите мне все URI островов, которые можно охарактеризовать как частные случаи понятия ""остров"" и одновременно принадлежат государству ""Япония"""".

Другой возможный естественно-ярлыковый вариант: ""Список островов, которые могут быть охарактеризованы как частный случай класса ""остров"" и одновременно принадлежат государству ""Япония""""."	Перечислите все острова, которые принадлежат Японии	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q23442 ; wdt:P17 wd:Q17 . }	"['Возможный', 'естественно-ярлыковый', 'вопрос', 'для', 'данного', 'SPARQL-запроса', ':', '``', 'Выведите', 'URI', 'всех', 'островов', ',', 'которые', 'являются', 'частным', 'случаем', 'понятия', '``', 'остров', ""''"", 'и', 'принадлежат', 'государству', '``', 'Япония', ""''"", ""''"", '.', 'Предположим', ',', 'что', 'мы', 'хотим', 'получить', 'список', 'островов', ',', 'которые', 'являются', 'частными', 'случаями', 'понятия', '``', 'остров', ""''"", 'и', 'принадлежат', 'государству', '``', 'Япония', ""''"", '.', 'Для', 'решения', 'этой', 'задачи', 'мы', 'можем', 'использовать', 'SPARQL-запрос', ',', 'приведенный', 'выше', '.', 'Но', 'если', 'мы', 'хотим', 'переформулировать', 'эту', 'задачу', 'вопросом', 'на', 'естественном', 'языке', ',', 'то', 'можно', 'сформулировать', 'его', 'следующим', 'образом', ':', ""''"", 'Выведите', 'мне', 'все', 'URI', 'островов', ',', 'которые', 'можно', 'охарактеризовать', 'как', 'частные', 'случаи', 'понятия', '``', 'остров', ""''"", 'и', 'одновременно', 'принадлежат', 'государству', '``', 'Япония', ""''"", ""''"", '.', 'Другой', 'возможный', 'естественно-ярлыковый', 'вариант', ':', '``', 'Список', 'островов', ',', 'которые', 'могут', 'быть', 'охарактеризованы', 'как', 'частный', 'случай', 'класса', '``', 'остров', ""''"", 'и', 'одновременно', 'принадлежат', 'государству', '``', 'Япония', ""''"", ""''"", '.']"	['Перечислите', 'все', 'острова', ',', 'которые', 'принадлежат', 'Японии']	0.0644	0.0808	0.0789	814.0
60	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1010 wdt:P1082 ?uri . } 
 Где:
 wd:Q1010 именуется как ""Марибор.""
 wdt:P1082 именуется как ""численность населения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI's of cities that have a population greater than or equal to the one associated with ""Maribor"" in Wikidata?"	Сколько жителей в Мариборе	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1010 wdt:P1082 ?uri . }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'cities', 'that', 'have', 'a', 'population', 'greater', 'than', 'or', 'equal', 'to', 'the', 'one', 'associated', 'with', '``', 'Maribor', ""''"", 'in', 'Wikidata', '?']"	['Сколько', 'жителей', 'в', 'Мариборе']	0.0	0.0	0.0	132.0
62	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q4830453 . ?uri wdt:P31 ?type ; wdt:P1128 ?num . FILTER(?num > 1000000) } 
 Где:
 wdt:P279 именуется как ""подкласс от.""
 wd:Q4830453 именуется как ""бизнес-предприятие.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P1128 именуется как ""число сотрудников.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI identifiers for entities that are subclasses of a business enterprise and have over one million employees?	Какие компании имеют численность более 1 миллиона сотрудников?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q4830453 . ?uri wdt:P31 ?type ; wdt:P1128 ?num . FILTER(?num > 1000000) }	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'for', 'entities', 'that', 'are', 'subclasses', 'of', 'a', 'business', 'enterprise', 'and', 'have', 'over', 'one', 'million', 'employees', '?']	['Какие', 'компании', 'имеют', 'численность', 'более', '1', 'миллиона', 'сотрудников', '?']	0.1796	0.1441	0.0	124.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI identifiers for entities that are subclasses of a business enterprise and have over one million employees?	В каких компаниях работает более 1 миллиона рабочих?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q4830453 . ?uri wdt:P31 ?type ; wdt:P1128 ?num . FILTER(?num > 1000000) }	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'for', 'entities', 'that', 'are', 'subclasses', 'of', 'a', 'business', 'enterprise', 'and', 'have', 'over', 'one', 'million', 'employees', '?']	['В', 'каких', 'компаниях', 'работает', 'более', '1', 'миллиона', 'рабочих', '?']	0.1796	0.1441	0.0	124.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI identifiers for entities that are subclasses of a business enterprise and have over one million employees?	Какте компании имеют больше чем 1 миллион работников?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q4830453 . ?uri wdt:P31 ?type ; wdt:P1128 ?num . FILTER(?num > 1000000) }	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'for', 'entities', 'that', 'are', 'subclasses', 'of', 'a', 'business', 'enterprise', 'and', 'have', 'over', 'one', 'million', 'employees', '?']	['Какте', 'компании', 'имеют', 'больше', 'чем', '1', 'миллион', 'работников', '?']	0.1796	0.1441	0.0	124.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of films that are of the type ""film"" and have ""Harry Marshall"" as their director, and ""Julia Roberts"" in the roles?"	В каких фильмах режиссера Гарри Маршалла в главной роли снималась Джулия Робертс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q315087> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q40523> . } 	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'that', 'are', 'of', 'the', 'type', '``', 'film', ""''"", 'and', 'have', '``', 'Harry', 'Marshall', ""''"", 'as', 'their', 'director', ',', 'and', '``', 'Julia', 'Roberts', ""''"", 'in', 'the', 'roles', '?']"	['В', 'каких', 'фильмах', 'режиссера', 'Гарри', 'Маршалла', 'в', 'главной', 'роли', 'снималась', 'Джулия', 'Робертс', '?']	0.1677	0.1057	0.0	131.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of films that are of the type ""film"" and have ""Harry Marshall"" as their director, and ""Julia Roberts"" in the roles?"	В каких фильмах Гарри Маршала снималась Джулия Робертс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q315087> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q40523> . } 	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'that', 'are', 'of', 'the', 'type', '``', 'film', ""''"", 'and', 'have', '``', 'Harry', 'Marshall', ""''"", 'as', 'their', 'director', ',', 'and', '``', 'Julia', 'Roberts', ""''"", 'in', 'the', 'roles', '?']"	['В', 'каких', 'фильмах', 'Гарри', 'Маршала', 'снималась', 'Джулия', 'Робертс', '?']	0.1677	0.0906	0.0	135.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of films that are of the type ""film"" and have ""Harry Marshall"" as their director, and ""Julia Roberts"" in the roles?"	Какие фильмы снял Гарри Маршал с участием Джулии Робертсы?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q315087> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q40523> . } 	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'that', 'are', 'of', 'the', 'type', '``', 'film', ""''"", 'and', 'have', '``', 'Harry', 'Marshall', ""''"", 'as', 'their', 'director', ',', 'and', '``', 'Julia', 'Roberts', ""''"", 'in', 'the', 'roles', '?']"	['Какие', 'фильмы', 'снял', 'Гарри', 'Маршал', 'с', 'участием', 'Джулии', 'Робертсы', '?']	0.1677	0.0949	0.0	134.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of films that are of the type ""film"" and have ""Harry Marshall"" as their director, and ""Julia Roberts"" in the roles?"	В каких фильмах, снятых Гарри Маршаллом, Джулия Робертс снималась в главной роли ?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q315087> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q40523> . } 	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'that', 'are', 'of', 'the', 'type', '``', 'film', ""''"", 'and', 'have', '``', 'Harry', 'Marshall', ""''"", 'as', 'their', 'director', ',', 'and', '``', 'Julia', 'Roberts', ""''"", 'in', 'the', 'roles', '?']"	['В', 'каких', 'фильмах', ',', 'снятых', 'Гарри', 'Маршаллом', ',', 'Джулия', 'Робертс', 'снималась', 'в', 'главной', 'роли', '?']	0.1994	0.1947	0.0	130.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of films that are of the type ""film"" and have ""Harry Marshall"" as their director, and ""Julia Roberts"" in the roles?"	В каких фильмах Гарри Маршалла снималась Джулия Робертс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q315087> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q40523> . } 	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'that', 'are', 'of', 'the', 'type', '``', 'film', ""''"", 'and', 'have', '``', 'Harry', 'Marshall', ""''"", 'as', 'their', 'director', ',', 'and', '``', 'Julia', 'Roberts', ""''"", 'in', 'the', 'roles', '?']"	['В', 'каких', 'фильмах', 'Гарри', 'Маршалла', 'снималась', 'Джулия', 'Робертс', '?']	0.1677	0.0906	0.0	135.0
64	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q476028> . ?uri <http://www.wikidata.org/prop/direct/P118> <http://www.wikidata.org/entity/Q9448> . } 
 Где:
 http://www.wikidata.org/prop/direct/P31 именуется как ""это частный случай понятия.""
 http://www.wikidata.org/entity/Q476028 именуется как ""футбольный клуб.""
 http://www.wikidata.org/prop/direct/P118 именуется как ""выступает в лиге.""
 http://www.wikidata.org/entity/Q9448 именуется как ""Английская Премьер-лига.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of the football clubs that have the property ""this entity is a subclass of"" football club and the property ""play in"" English Premier League?"	Назовите все футбольные клубы Премьер-лиги.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q476028> . ?uri <http://www.wikidata.org/prop/direct/P118> <http://www.wikidata.org/entity/Q9448> . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'the', 'football', 'clubs', 'that', 'have', 'the', 'property', '``', 'this', 'entity', 'is', 'a', 'subclass', 'of', ""''"", 'football', 'club', 'and', 'the', 'property', '``', 'play', 'in', ""''"", 'English', 'Premier', 'League', '?']"	['Назовите', 'все', 'футбольные', 'клубы', 'Премьер-лиги', '.']	0.0	0.0	0.0	174.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the URI's of the entities that represent the highest points in the Ural Mountains?	Самая высокая точка Урала?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q35600> <http://www.wikidata.org/prop/direct/P610> ?uri . }	"['What', 'are', 'the', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'represent', 'the', 'highest', 'points', 'in', 'the', 'Ural', 'Mountains', '?']"	['Самая', 'высокая', 'точка', 'Урала', '?']	0.1843	0.129	0.0	87.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the URI's of the entities that represent the highest points in the Ural Mountains?	Самые высокий пик Урала?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q35600> <http://www.wikidata.org/prop/direct/P610> ?uri . }	"['What', 'are', 'the', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'represent', 'the', 'highest', 'points', 'in', 'the', 'Ural', 'Mountains', '?']"	['Самые', 'высокий', 'пик', 'Урала', '?']	0.1843	0.129	0.0	87.0
66	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1214 wdt:P6 ?uri . } 
 Где:
 wd:Q1214 именуется как ""Вайоминг.""
 wdt:P6 именуется как ""глава правительства.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI identifiers of entities that have been the governor of Wyoming (wd:Q1214) according to Wikidata?	Кто является губернатором Вайоминга?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1214 wdt:P6 ?uri . }	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'have', 'been', 'the', 'governor', 'of', 'Wyoming', '(', 'wd', ':', 'Q1214', ')', 'according', 'to', 'Wikidata', '?']	['Кто', 'является', 'губернатором', 'Вайоминга', '?']	0.1774	0.0967	0.0	118.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI identifiers of entities that have been the governor of Wyoming (wd:Q1214) according to Wikidata?	Кто губернатор штата Вайоминг?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1214 wdt:P6 ?uri . }	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'have', 'been', 'the', 'governor', 'of', 'Wyoming', '(', 'wd', ':', 'Q1214', ')', 'according', 'to', 'Wikidata', '?']	['Кто', 'губернатор', 'штата', 'Вайоминг', '?']	0.1774	0.0967	0.0	118.0
