id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which UNESCO World Heritages were discovered or invented before the current year and two years before the current year?	Welche Weltkulturerbestätten wurden in den vergangenen beiden Jahren ernannt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q9259 ; wdt:P575 ?date . BIND(xsd:integer(YEAR(?date)) as ?year) . BIND(xsd:integer(YEAR(NOW())) as ?currentYear) . FILTER(?year < ?currentYear && ?year < (?currentYear - 2)) . }	['Which', 'UNESCO', 'World', 'Heritages', 'were', 'discovered', 'or', 'invented', 'before', 'the', 'current', 'year', 'and', 'two', 'years', 'before', 'the', 'current', 'year', '?']	['Welche', 'Weltkulturerbestätten', 'wurden', 'in', 'den', 'vergangenen', 'beiden', 'Jahren', 'ernannt', '?']	0.1818	0.1661	0.0	87.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the URI's of actors (wd:Q33999) who were born in Paris (wd:Q90) and were born after the year 1950?	Liste alle Schauspieler auf, die nach 1950 in Paris geboren wurden.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 ; wdt:P19 wd:Q90 ; wdt:P569 ?birthDate . BIND(YEAR(?birthDate) as ?birthYear) . FILTER(?birthYear > 1950) }	"['What', 'are', 'the', 'URI', ""'s"", 'of', 'actors', '(', 'wd', ':', 'Q33999', ')', 'who', 'were', 'born', 'in', 'Paris', '(', 'wd', ':', 'Q90', ')', 'and', 'were', 'born', 'after', 'the', 'year', '1950', '?']"	['Liste', 'alle', 'Schauspieler', 'auf', ',', 'die', 'nach', '1950', 'in', 'Paris', 'geboren', 'wurden', '.']	0.1221	0.37	0.1429	81.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinct URI's represent the actors involved in the films featuring Elizabeth Taylor and Richard Burton?	In welchen Filmen haben Liz Taylor und Richard Burton gemeinsam gespielt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q34851> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q151973> . }	"['Which', 'distinct', 'URI', ""'s"", 'represent', 'the', 'actors', 'involved', 'in', 'the', 'films', 'featuring', 'Elizabeth', 'Taylor', 'and', 'Richard', 'Burton', '?']"	['In', 'welchen', 'Filmen', 'haben', 'Liz', 'Taylor', 'und', 'Richard', 'Burton', 'gemeinsam', 'gespielt', '?']	0.165	0.7967	0.1538	86.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which non-profit organizations are headquartered in Australia or in a state of Australia?	Liste alle australischen Non-Profit-Organisationen auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q163740 . { ?uri wdt:P159|wdt:P17 wd:Q408 . } UNION { ?uri wdt:P159|wdt:P17 ?city . ?city wdt:P159 wd:Q408 } }	['Which', 'non-profit', 'organizations', 'are', 'headquartered', 'in', 'Australia', 'or', 'in', 'a', 'state', 'of', 'Australia', '?']	['Liste', 'alle', 'australischen', 'Non-Profit-Organisationen', 'auf', '.']	0.0	0.0	0.0	71.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which public offices or positions had a president of Pakistan hold between the years 1978 and 1978?	Wer war 1978 in Pakistan Präsident?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P39 wd:Q473984 . ?uri p:P39 ?statement . ?statement pq:P580 ?startDate ; pq:P582 ?endDate . FILTER(YEAR(?startDate) <= 1978 && YEAR(?endDate) >= 1978) . }	['Which', 'public', 'offices', 'or', 'positions', 'had', 'a', 'president', 'of', 'Pakistan', 'hold', 'between', 'the', 'years', '1978', 'and', '1978', '?']	['Wer', 'war', '1978', 'in', 'Pakistan', 'Präsident', '?']	0.2425	0.4679	0.087	77.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which URI's represent the public offices or positions with the title ""Bundeskanzler""?"	Liste alle Bundeskanzler von Deutschland auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P39> <http://www.wikidata.org/entity/Q4970706> . } 	"['Which', 'URI', ""'s"", 'represent', 'the', 'public', 'offices', 'or', 'positions', 'with', 'the', 'title', '``', 'Bundeskanzler', ""''"", '?']"	['Liste', 'alle', 'Bundeskanzler', 'von', 'Deutschland', 'auf', '.']	0.1869	0.1755	0.0	68.0
Therefore, transforming the SPARQL query to a question in natural language, we get: ""Which films actors have the occupation 'Tätigkeit' (activity) and were born in or are from Germany?"""	Welche Schauspieler wurden in Deutschland geboren?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q10800557> . { ?uri <http://www.wikidata.org/prop/direct/P19> <http://www.wikidata.org/entity/Q183> . } UNION { ?uri <http://www.wikidata.org/prop/direct/P19>/<http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q183> . } }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'actors', 'with', 'a', 'given', 'occupation', '(', 'Tätigkeit', ')', 'and', 'whose', 'birthplace', 'or', 'nationality', 'is', '``', 'Deutschland', ""''"", '(', 'Germany', ')', '?', 'This', 'can', 'be', 'achieved', 'by', 'merging', 'the', 'following', 'two', 'conditions', ':', 'either', 'the', 'actor', ""'s"", 'birthplace', 'is', 'Germany', 'or', 'their', 'nationality', 'is', 'Germany', '.', 'Therefore', ',', 'transforming', 'the', 'SPARQL', 'query', 'to', 'a', 'question', 'in', 'natural', 'language', ',', 'we', 'get', ':', '``', 'Which', 'films', 'actors', 'have', 'the', 'occupation', ""'Tätigkeit"", ""'"", '(', 'activity', ')', 'and', 'were', 'born', 'in', 'or', 'are', 'from', 'Germany', '?', ""''""]"	['Welche', 'Schauspieler', 'wurden', 'in', 'Deutschland', 'geboren', '?']	0.1871	0.0926	0.0339	423.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which Film producer has been involved in the production of the greatest number of films?	Wer hat die meisten Filme produziert?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?film <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?film <http://www.wikidata.org/prop/direct/P162> ?uri . } GROUP BY ?uri ORDER BY DESC(COUNT(?film)) LIMIT 1	['Which', 'Film', 'producer', 'has', 'been', 'involved', 'in', 'the', 'production', 'of', 'the', 'greatest', 'number', 'of', 'films', '?']	['Wer', 'hat', 'die', 'meisten', 'Filme', 'produziert', '?']	0.1869	0.1755	0.0	65.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinctive URI's of actors with the occupation of ""Schauspieler"" who were born in ""Berlin"" and performed some activity with the type ""Tätigkeit"" having the location ""Berlin"" as well?"	Liste alle Schauspieler auf, die in Berlin geboren wurden.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 ; wdt:P19 wd:Q64 . }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'actors', 'with', 'the', 'occupation', 'of', '``', 'Schauspieler', ""''"", 'who', 'were', 'born', 'in', '``', 'Berlin', ""''"", 'and', 'performed', 'some', 'activity', 'with', 'the', 'type', '``', 'Tätigkeit', ""''"", 'having', 'the', 'location', '``', 'Berlin', ""''"", 'as', 'well', '?']"	['Liste', 'alle', 'Schauspieler', 'auf', ',', 'die', 'in', 'Berlin', 'geboren', 'wurden', '.']	0.2152	0.2531	0.0588	155.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of the entities that Goofy (Q111135) is the creator of?	Wer hat Goofy erschaffen?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q111135> <http://www.wikidata.org/prop/direct/P170> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'Goofy', '(', 'Q111135', ')', 'is', 'the', 'creator', 'of', '?']"	['Wer', 'hat', 'Goofy', 'erschaffen', '?']	0.2177	0.2444	0.1176	66.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URIs of albums that are part of the album ""Last Christmas"" or are studio albums with ""Last Christmas"" as their title list?"	Auf welchen Musikalben befindet sich das Lied Last Christmas?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { { wd:Q1318118 wdt:P361 ?uri . } UNION { VALUES ?albumType { wd:Q482994 wd:Q208569 } ?uri wdt:P31|wdt:P7937 ?albumType ; wdt:P658 wd:Q1318118 . }}	"['What', 'are', 'the', 'distinct', 'URIs', 'of', 'albums', 'that', 'are', 'part', 'of', 'the', 'album', '``', 'Last', 'Christmas', ""''"", 'or', 'are', 'studio', 'albums', 'with', '``', 'Last', 'Christmas', ""''"", 'as', 'their', 'title', 'list', '?']"	['Auf', 'welchen', 'Musikalben', 'befindet', 'sich', 'das', 'Lied', 'Last', 'Christmas', '?']	0.1203	0.3215	0.0	105.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the distinct date of founding for Alberta?	Wann wurde Alberta zu einer Provinz?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?date WHERE { wd:Q1951 wdt:P571 ?date . }	['What', 'is', 'the', 'distinct', 'date', 'of', 'founding', 'for', 'Alberta', '?']	['Wann', 'wurde', 'Alberta', 'zu', 'einer', 'Provinz', '?']	0.2325	0.5615	0.0	37.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"How many distinct Sojusprogramms are there that are part of? (Note: I assume you mean ""Which Sojusprogramms are part of what?"" is the original question, so the transformation above results in ""How many distinct Sojusprogramms are there?"")

Here is the natural language equivalent of your SPARQL query:

What is the number of distinct Sojusprogramms?
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the Uris of television shows that have Neil Patrick Harris as an actor and are subclasses of a ""Fernsehsendung"" (a television show) in Wikidata?"	In welchen Serien hat Neil Patrick Harris mitgespielt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?type wdt:P279* wd:Q15416 . ?uri wdt:P161 wd:Q485310 . ?uri wdt:P31 ?type . }	"['What', 'are', 'the', 'Uris', 'of', 'television', 'shows', 'that', 'have', 'Neil', 'Patrick', 'Harris', 'as', 'an', 'actor', 'and', 'are', 'subclasses', 'of', 'a', '``', 'Fernsehsendung', ""''"", '(', 'a', 'television', 'show', ')', 'in', 'Wikidata', '?']"	['In', 'welchen', 'Serien', 'hat', 'Neil', 'Patrick', 'Harris', 'mitgespielt', '?']	0.0903	0.409	0.1935	113.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the date of founding for the Hells Angels?	Wann wurden die Berge der Engel gegründet?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?date WHERE { wd:Q622188 wdt:P571 ?date . }	['What', 'is', 'the', 'date', 'of', 'founding', 'for', 'the', 'Hells', 'Angels', '?']	['Wann', 'wurden', 'die', 'Berge', 'der', 'Engel', 'gegründet', '?']	0.1941	0.2727	0.0	37.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which distinct URI's represent the entities that have a ""Bilanzgewinn"" (Balance Gain) property with ""Apple."" (Q312) as their subject?"	Wie hoch ist das Nettoeinkommen von Apple?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q312 wdt:P2295 ?uri . }	"['Which', 'distinct', 'URI', ""'s"", 'represent', 'the', 'entities', 'that', 'have', 'a', '``', 'Bilanzgewinn', ""''"", '(', 'Balance', 'Gain', ')', 'property', 'with', '``', 'Apple', '.', ""''"", '(', 'Q312', ')', 'as', 'their', 'subject', '?']"	['Wie', 'hoch', 'ist', 'das', 'Nettoeinkommen', 'von', 'Apple', '?']	0.2042	0.2	0.0	107.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the URI's of entities that are of the type ""Feiertage in Schweden"" (Feasts in Sweden) according to Wikidata?"	Welche schwedischen Feiertage gibt es?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q1401522 . }	"['What', 'are', 'the', 'URI', ""'s"", 'of', 'entities', 'that', 'are', 'of', 'the', 'type', '``', 'Feiertage', 'in', 'Schweden', ""''"", '(', 'Feasts', 'in', 'Sweden', ')', 'according', 'to', 'Wikidata', '?']"	['Welche', 'schwedischen', 'Feiertage', 'gibt', 'es', '?']	0.2086	0.1988	0.0	91.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of the burial sites for ""Juliana""?"	Wo wurde die frühere niederländische Königin Juliana begraben?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q154946 wdt:P119 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'burial', 'sites', 'for', '``', 'Juliana', ""''"", '?']"	['Wo', 'wurde', 'die', 'frühere', 'niederländische', 'Königin', 'Juliana', 'begraben', '?']	0.2239	0.4227	0.0	52.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI identifiers of musical compositions with a compositor who is Leonard Bernstein?	Für welche Musicals hat Leonard Bernstein die Musik geschrieben?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q2743 ; wdt:P86 wd:Q152505 . }	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'musical', 'compositions', 'with', 'a', 'compositor', 'who', 'is', 'Leonard', 'Bernstein', '?']	['Für', 'welche', 'Musicals', 'hat', 'Leonard', 'Bernstein', 'die', 'Musik', 'geschrieben', '?']	0.1575	0.5862	0.08	77.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of entities that are a type of ""Gewerbebetrieb"" (Business Enterprise) and have a ""Branche"" (Branch) of ""Marketing""?"	Liste alle Unternehmen auf, die in der Werbung tätig sind.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4830453 ; wdt:P452 wd:Q39809 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'are', 'a', 'type', 'of', '``', 'Gewerbebetrieb', ""''"", '(', 'Business', 'Enterprise', ')', 'and', 'have', 'a', '``', 'Branche', ""''"", '(', 'Branch', ')', 'of', '``', 'Marketing', ""''"", '?']"	['Liste', 'alle', 'Unternehmen', 'auf', ',', 'die', 'in', 'der', 'Werbung', 'tätig', 'sind', '.']	0.0	0.0	0.0	115.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of the entities that John Lennon was killed by?	Wer tötete John Lennon?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1203 wdt:P157 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'John', 'Lennon', 'was', 'killed', 'by', '?']"	['Wer', 'tötete', 'John', 'Lennon', '?']	0.1617	0.4354	0.1176	54.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinct URI represent bands that originate from Australia and belong to the Metalcore genre?	Liste alle australischen Metalcore-Bands auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q215380 ; wdt:P495 wd:Q408 ; wdt:P136 wd:Q183862 . }	['Which', 'distinct', 'URI', 'represent', 'bands', 'that', 'originate', 'from', 'Australia', 'and', 'belong', 'to', 'the', 'Metalcore', 'genre', '?']	['Liste', 'alle', 'australischen', 'Metalcore-Bands', 'auf', '.']	0.0	0.0	0.0	75.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of the countries that use the Euro as their currency?	Welche Ländern haben den Euro eingeführt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256> . ?uri <http://www.wikidata.org/prop/direct/P38> <http://www.wikidata.org/entity/Q4916>   . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'countries', 'that', 'use', 'the', 'Euro', 'as', 'their', 'currency', '?']"	['Welche', 'Ländern', 'haben', 'den', 'Euro', 'eingeführt', '?']	0.2207	0.3303	0.1053	60.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of the subclasses of ""Essstörung"" (wd:Q373822) according to Wikidata?"	Liste alle Formen der Essstörung auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279 wd:Q373822 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'subclasses', 'of', '``', 'Essstörung', ""''"", '(', 'wd', ':', 'Q373822', ')', 'according', 'to', 'Wikidata', '?']"	['Liste', 'alle', 'Formen', 'der', 'Essstörung', 'auf', '.']	0.1796	0.1276	0.0	77.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the current ranking of the Brazilian Football National Team according to the FIFA World Ranking?	Was war Brasiliens schlechteste Platzierung in der FIFA-Weltrangliste?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?value WHERE { wd:Q83459 p:P1352 ?statement . ?statement pq:P459 wd:Q180825 ; ps:P1352 ?value . } ORDER BY DESC(?value) LIMIT 1	['What', 'is', 'the', 'current', 'ranking', 'of', 'the', 'Brazilian', 'Football', 'National', 'Team', 'according', 'to', 'the', 'FIFA', 'World', 'Ranking', '?']	['Was', 'war', 'Brasiliens', 'schlechteste', 'Platzierung', 'in', 'der', 'FIFA-Weltrangliste', '?']	0.1843	0.1761	0.0	73.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	How many distinct films does Leonardo DiCaprio act in?	In wievielen Filmen hat Leonardo DiCaprio mitgespielt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P31 wd:Q11424 ; wdt:P161 wd:Q38111 . }	['How', 'many', 'distinct', 'films', 'does', 'Leonardo', 'DiCaprio', 'act', 'in', '?']	['In', 'wievielen', 'Filmen', 'hat', 'Leonardo', 'DiCaprio', 'mitgespielt', '?']	0.1983	0.9	0.25	30.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of books where the author is Danielle Steel?	Gib mir alle Bücher die Danielle Steel geschrieben hat.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q571> . ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q72653> . } 	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'books', 'where', 'the', 'author', 'is', 'Danielle', 'Steel', '?']"	['Gib', 'mir', 'alle', 'Bücher', 'die', 'Danielle', 'Steel', 'geschrieben', 'hat', '.']	0.1503	0.4429	0.0952	58.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the URI of the land entity with the most number of official language labels?	Welches Land hat die meisten offiziellen Sprachen?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256> . ?uri <http://www.wikidata.org/prop/direct/P37> ?language . } GROUP BY ?uri ORDER BY DESC(COUNT(?language)) LIMIT 1	['What', 'is', 'the', 'URI', 'of', 'the', 'land', 'entity', 'with', 'the', 'most', 'number', 'of', 'official', 'language', 'labels', '?']	['Welches', 'Land', 'hat', 'die', 'meisten', 'offiziellen', 'Sprachen', '?']	0.1856	0.1765	0.0	57.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of entities that Interpret the character named Chewbacca?	Wer spielte Chewbacca?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q51803 wdt:P175 ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'Interpret', 'the', 'character', 'named', 'Chewbacca', '?']"	['Wer', 'spielte', 'Chewbacca', '?']	0.1503	0.2667	0.1333	66.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the URI's of libraries that were founded before the year 1400?	Liste alle Bibliotheken auf, die vor 1400 gegründet wurden.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7075 ; wdt:P571 ?date . FILTER (YEAR(?date) < 1400 ) }	"['What', 'are', 'the', 'URI', ""'s"", 'of', 'libraries', 'that', 'were', 'founded', 'before', 'the', 'year', '1400', '?']"	['Liste', 'alle', 'Bibliotheken', 'auf', ',', 'die', 'vor', '1400', 'gegründet', 'wurden', '.']	0.1883	0.2306	0.0	55.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of programming languages that are instances of a programmning language and are influenced by Perl?	Welche Programmiersprachen wurden von Perl beeinflusst?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q9143 ; wdt:P737 wd:Q42478 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'programming', 'languages', 'that', 'are', 'instances', 'of', 'a', 'programmning', 'language', 'and', 'are', 'influenced', 'by', 'Perl', '?']"	['Welche', 'Programmiersprachen', 'wurden', 'von', 'Perl', 'beeinflusst', '?']	0.2135	0.2552	0.0	95.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of individuals who are Politicians and have the activity or occupation associated with Methodist or Wesleyan Churches?	Welche Politiker sind Methodisten?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P140 wd:Q33203 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'are', 'Politicians', 'and', 'have', 'the', 'activity', 'or', 'occupation', 'associated', 'with', 'Methodist', 'or', 'Wesleyan', 'Churches', '?']"	['Welche', 'Politiker', 'sind', 'Methodisten', '?']	0.1774	0.0967	0.0	115.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of the authors, other than ""Das Schicksal ist ein mieser Verräter"" (QID: 658375), who have authored works?"	Welche Bücher hat der Schrifftsteller von Das Schicksal ist eine mieser Verräter noch geschrieben?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q658375 wdt:P50 ?author . ?uri wdt:P50 ?author . FILTER(?uri != wd:Q658375) }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'authors', ',', 'other', 'than', '``', 'Das', 'Schicksal', 'ist', 'ein', 'mieser', 'Verräter', ""''"", '(', 'QID', ':', '658375', ')', ',', 'who', 'have', 'authored', 'works', '?']"	['Welche', 'Bücher', 'hat', 'der', 'Schrifftsteller', 'von', 'Das', 'Schicksal', 'ist', 'eine', 'mieser', 'Verräter', 'noch', 'geschrieben', '?']	0.1106	0.7562	0.1714	77.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the mountain with the highest elevation above sea level?	Welcher ist der höchste Berg?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P2044 ?elevation . } ORDER BY DESC(?elevation) LIMIT 1	['What', 'is', 'the', 'mountain', 'with', 'the', 'highest', 'elevation', 'above', 'sea', 'level', '?']	['Welcher', 'ist', 'der', 'höchste', 'Berg', '?']	0.1926	0.2154	0.0	49.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which URI's represent the directors and actors who both directed and acted in a film, where the director is Clint Eastwood?	In welchen Filmen hat Clint Eastwood Regie geführt und mitgespielt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri  WHERE { ?uri wdt:P57 wd:Q43203 ; wdt:P161 wd:Q43203 . }	"['Which', 'URI', ""'s"", 'represent', 'the', 'directors', 'and', 'actors', 'who', 'both', 'directed', 'and', 'acted', 'in', 'a', 'film', ',', 'where', 'the', 'director', 'is', 'Clint', 'Eastwood', '?']"	['In', 'welchen', 'Filmen', 'hat', 'Clint', 'Eastwood', 'Regie', 'geführt', 'und', 'mitgespielt', '?']	0.135	0.4324	0.069	93.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinct URIs represent software types developed by businesses based in California?	Welche Software wurde von in Kalifornien gegründeten Organisationen entwickelt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P178 ?com ; wdt:P31* wd:Q17155032 . ?type wdt:P279* wd:Q4830453 . ?com wdt:P31 ?type ; wdt:P740 wd:Q99 . }	['Which', 'distinct', 'URIs', 'represent', 'software', 'types', 'developed', 'by', 'businesses', 'based', 'in', 'California', '?']	['Welche', 'Software', 'wurde', 'von', 'in', 'Kalifornien', 'gegründeten', 'Organisationen', 'entwickelt', '?']	0.2273	0.5111	0.0952	69.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"How many distinct URI's represent Airlines that are members of the ""Star Alliance"" (wd:Q189709) according to Wikidata?

Answer:
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI identifiers of actors mentioned in the property ""Tätigkeit"" (activity) in Wikidata, whose labels contain the word ""Baldwin""?"	Liste alle Schauspieler mit dem Nachnamen Baldwin auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	"PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 ; rdfs:label ?label . FILTER(CONTAINS(?label, ""Baldwin""))}"	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'actors', 'mentioned', 'in', 'the', 'property', '``', 'Tätigkeit', ""''"", '(', 'activity', ')', 'in', 'Wikidata', ',', 'whose', 'labels', 'contain', 'the', 'word', '``', 'Baldwin', ""''"", '?']"	['Liste', 'alle', 'Schauspieler', 'mit', 'dem', 'Nachnamen', 'Baldwin', 'auf', '.']	0.1717	0.1057	0.0	122.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What is the label of the first recording with the earliest publication date and the name of the record label associated with it?

 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of the offices where the Minister President of Spain has served?	Wo ist der Amtssitz von Spaniens Premierminister?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q844587 wdt:P263 ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'offices', 'where', 'the', 'Minister', 'President', 'of', 'Spain', 'has', 'served', '?']"	['Wo', 'ist', 'der', 'Amtssitz', 'von', 'Spaniens', 'Premierminister', '?']	0.1843	0.1667	0.0	67.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which URI's represent countries that have more than two official languages?	Liste alle Länder auf, die mehr als zwei offizielle Landessprachen haben?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256> . ?uri <http://www.wikidata.org/prop/direct/P37> ?language . } GROUP BY ?uri HAVING(COUNT(?language)>2)	"['Which', 'URI', ""'s"", 'represent', 'countries', 'that', 'have', 'more', 'than', 'two', 'official', 'languages', '?']"	['Liste', 'alle', 'Länder', 'auf', ',', 'die', 'mehr', 'als', 'zwei', 'offizielle', 'Landessprachen', 'haben', '?']	0.1911	0.2846	0.0	61.0
