id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URIs of entities that have influenced JavaScript (wd:Q2005) according to the property ""испытал влияние от"" (wdt:P737)?"	Какие языки программирования оказали влияние на Javascript?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q2005 wdt:P737 ?uri . }	"['What', 'are', 'the', 'distinct', 'URIs', 'of', 'entities', 'that', 'have', 'influenced', 'JavaScript', '(', 'wd', ':', 'Q2005', ')', 'according', 'to', 'the', 'property', '``', 'испытал', 'влияние', 'от', ""''"", '(', 'wdt', ':', 'P737', ')', '?']"	['Какие', 'языки', 'программирования', 'оказали', 'влияние', 'на', 'Javascript', '?']	0.2032	0.1935	0.0769	125.0
Which occupation entities have the most associated books with authors?"	Кто из музыкантов написал наибольшее количество книг?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri  WHERE { ?uri wdt:P106 wd:Q639669 . ?x wdt:P31 wd:Q571 ; wdt:P50 ?uri . } GROUP BY ?uri ORDER BY DESC(COUNT(?x)) LIMIT 1	"['What', 'are', 'the', 'entities', 'that', 'are', 'both', 'classified', 'as', '``', 'occupations', ""''"", '(', 'wd', ':', 'P106', ')', 'and', 'have', 'the', 'property', '``', 'are', 'a', 'type', 'of', ""''"", '(', 'wd', ':', 'P31', ')', 'with', 'the', 'concept', '``', 'book', ""''"", '(', 'wd', ':', 'Q571', ')', ',', 'and', 'have', 'the', 'maximum', 'number', 'of', 'associated', 'entities', 'with', 'the', 'property', '``', 'author', ""''"", '(', 'wd', ':', 'P50', ')', ',', 'which', 'is', 'a', 'type', 'of', '``', 'person', ""''"", '(', 'wd', ':', 'Q761112555', ')', '?', 'This', 'transforms', 'to', ':', 'Which', 'occupation', 'entities', 'have', 'the', 'most', 'associated', 'books', 'with', 'authors', '?']"	['Кто', 'из', 'музыкантов', 'написал', 'наибольшее', 'количество', 'книг', '?']	0.1416	0.0323	0.0	374.0
Which occupation entities have the most associated books with authors?"	Какой музыкант написал больше всего книг?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri  WHERE { ?uri wdt:P106 wd:Q639669 . ?x wdt:P31 wd:Q571 ; wdt:P50 ?uri . } GROUP BY ?uri ORDER BY DESC(COUNT(?x)) LIMIT 1	"['What', 'are', 'the', 'entities', 'that', 'are', 'both', 'classified', 'as', '``', 'occupations', ""''"", '(', 'wd', ':', 'P106', ')', 'and', 'have', 'the', 'property', '``', 'are', 'a', 'type', 'of', ""''"", '(', 'wd', ':', 'P31', ')', 'with', 'the', 'concept', '``', 'book', ""''"", '(', 'wd', ':', 'Q571', ')', ',', 'and', 'have', 'the', 'maximum', 'number', 'of', 'associated', 'entities', 'with', 'the', 'property', '``', 'author', ""''"", '(', 'wd', ':', 'P50', ')', ',', 'which', 'is', 'a', 'type', 'of', '``', 'person', ""''"", '(', 'wd', ':', 'Q761112555', ')', '?', 'This', 'transforms', 'to', ':', 'Which', 'occupation', 'entities', 'have', 'the', 'most', 'associated', 'books', 'with', 'authors', '?']"	['Какой', 'музыкант', 'написал', 'больше', 'всего', 'книг', '?']	0.1416	0.0302	0.0	375.0
124	"Имея следующий SPARQL запрос: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri  WHERE { ?uri wdt:P57 wd:Q43203 ; wdt:P161 wd:Q43203 . } 
 Где:
 wdt:P57 именуется как ""режиссёр.""
 wd:Q43203 именуется как ""Клинт Иствуд.""
 wdt:P161 именуется как ""в ролях.""
 wd:Q43203 именуется как ""Клинт Иствуд.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI identifiers of the films where Clint Eastwood is both the director and an actor?	Какие фильмы с Клинтом Иствудом были сняты им самим?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri  WHERE { ?uri wdt:P57 wd:Q43203 ; wdt:P161 wd:Q43203 . }	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'the', 'films', 'where', 'Clint', 'Eastwood', 'is', 'both', 'the', 'director', 'and', 'an', 'actor', '?']	['Какие', 'фильмы', 'с', 'Клинтом', 'Иствудом', 'были', 'сняты', 'им', 'самим', '?']	0.1818	0.1661	0.0	97.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI identifiers of the films where Clint Eastwood is both the director and an actor?	Какие фильмы снял Клинт Иствуд с собой в главной роли?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri  WHERE { ?uri wdt:P57 wd:Q43203 ; wdt:P161 wd:Q43203 . }	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'the', 'films', 'where', 'Clint', 'Eastwood', 'is', 'both', 'the', 'director', 'and', 'an', 'actor', '?']	['Какие', 'фильмы', 'снял', 'Клинт', 'Иствуд', 'с', 'собой', 'в', 'главной', 'роли', '?']	0.1818	0.173	0.0	96.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI identifiers of the films where Clint Eastwood is both the director and an actor?	Какие фильмы с Клинтом Иствудом в главной роли он спродюссировал самостоятельно?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri  WHERE { ?uri wdt:P57 wd:Q43203 ; wdt:P161 wd:Q43203 . }	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'the', 'films', 'where', 'Clint', 'Eastwood', 'is', 'both', 'the', 'director', 'and', 'an', 'actor', '?']	['Какие', 'фильмы', 'с', 'Клинтом', 'Иствудом', 'в', 'главной', 'роли', 'он', 'спродюссировал', 'самостоятельно', '?']	0.1818	0.1792	0.0	97.0
125	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P178 ?com ; wdt:P31* wd:Q17155032 . ?type wdt:P279* wd:Q4830453 . ?com wdt:P31 ?type ; wdt:P740 wd:Q99 . } 
 Где:
 wdt:P178 именуется как ""разработчик.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q17155032 именуется как ""тип программного обеспечения.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q4830453 именуется как ""бизнес-предприятие.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P740 именуется как ""место основания.""
 wd:Q99 именуется как ""Калифорния.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the software development companies that are subclasses of businesses and have a type of software as their product, with a headquarters located in California?	Какое программное обеспечение была разработано компаниями, основанными в Калифорнии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P178 ?com ; wdt:P31* wd:Q17155032 . ?type wdt:P279* wd:Q4830453 . ?com wdt:P31 ?type ; wdt:P740 wd:Q99 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'software', 'development', 'companies', 'that', 'are', 'subclasses', 'of', 'businesses', 'and', 'have', 'a', 'type', 'of', 'software', 'as', 'their', 'product', ',', 'with', 'a', 'headquarters', 'located', 'in', 'California', '?']"	['Какое', 'программное', 'обеспечение', 'была', 'разработано', 'компаниями', ',', 'основанными', 'в', 'Калифорнии', '?']	0.2013	0.2097	0.0	178.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the software development companies that are subclasses of businesses and have a type of software as their product, with a headquarters located in California?	Какое программное обеспечение было разработано компания, основанными в Калифорнии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P178 ?com ; wdt:P31* wd:Q17155032 . ?type wdt:P279* wd:Q4830453 . ?com wdt:P31 ?type ; wdt:P740 wd:Q99 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'software', 'development', 'companies', 'that', 'are', 'subclasses', 'of', 'businesses', 'and', 'have', 'a', 'type', 'of', 'software', 'as', 'their', 'product', ',', 'with', 'a', 'headquarters', 'located', 'in', 'California', '?']"	['Какое', 'программное', 'обеспечение', 'было', 'разработано', 'компания', ',', 'основанными', 'в', 'Калифорнии', '?']	0.2013	0.2097	0.0	178.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the software development companies that are subclasses of businesses and have a type of software as their product, with a headquarters located in California?	Какое программное обеспечение было разработано организациями, основанными в Калифорнии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P178 ?com ; wdt:P31* wd:Q17155032 . ?type wdt:P279* wd:Q4830453 . ?com wdt:P31 ?type ; wdt:P740 wd:Q99 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'software', 'development', 'companies', 'that', 'are', 'subclasses', 'of', 'businesses', 'and', 'have', 'a', 'type', 'of', 'software', 'as', 'their', 'product', ',', 'with', 'a', 'headquarters', 'located', 'in', 'California', '?']"	['Какое', 'программное', 'обеспечение', 'было', 'разработано', 'организациями', ',', 'основанными', 'в', 'Калифорнии', '?']	0.2013	0.2097	0.0	178.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the number of distinct aviation alliances that include ""Star Alliance"" (wd:Q189709)?"	Какое количество авиакомпаний являются членами Star Alliance?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { ?uri wdt:P114 wd:Q189709 . }	"['What', 'is', 'the', 'number', 'of', 'distinct', 'aviation', 'alliances', 'that', 'include', '``', 'Star', 'Alliance', ""''"", '(', 'wd', ':', 'Q189709', ')', '?']"	['Какое', 'количество', 'авиакомпаний', 'являются', 'членами', 'Star', 'Alliance', '?']	0.1465	0.45	0.0	73.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the number of distinct aviation alliances that include ""Star Alliance"" (wd:Q189709)?"	Сколько авиакомпаний являются членами Star Alliance?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { ?uri wdt:P114 wd:Q189709 . }	"['What', 'is', 'the', 'number', 'of', 'distinct', 'aviation', 'alliances', 'that', 'include', '``', 'Star', 'Alliance', ""''"", '(', 'wd', ':', 'Q189709', ')', '?']"	['Сколько', 'авиакомпаний', 'являются', 'членами', 'Star', 'Alliance', '?']	0.1465	0.4211	0.0	74.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the number of distinct aviation alliances that include ""Star Alliance"" (wd:Q189709)?"	Сколько авиакомпаний являются членами альянса Star?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { ?uri wdt:P114 wd:Q189709 . }	"['What', 'is', 'the', 'number', 'of', 'distinct', 'aviation', 'alliances', 'that', 'include', '``', 'Star', 'Alliance', ""''"", '(', 'wd', ':', 'Q189709', ')', '?']"	['Сколько', 'авиакомпаний', 'являются', 'членами', 'альянса', 'Star', '?']	0.2163	0.2807	0.0	82.0
128	"Имея следующий SPARQL запрос: PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 ; rdfs:label ?label . FILTER(CONTAINS(?label, ""Baldwin""))} 
 Где:
 wdt:P106 именуется как ""род занятий.""
 wd:Q33999 именуется как ""актёр.""
 rdfs:label именуется как ""label.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of individuals labeled with ""Baldwin"" that have the property ""род занятий"" with value ""актёр""?"	Перечислите всех актеров с фамилией Болдуин.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	"PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 ; rdfs:label ?label . FILTER(CONTAINS(?label, ""Baldwin""))}"	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'labeled', 'with', '``', 'Baldwin', ""''"", 'that', 'have', 'the', 'property', '``', 'род', 'занятий', ""''"", 'with', 'value', '``', 'актёр', ""''"", '?']"	['Перечислите', 'всех', 'актеров', 'с', 'фамилией', 'Болдуин', '.']	0.0	0.0	0.0	115.0
129	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q11679 wdt:P50 ?uri . } 
 Где:
 wd:Q11679 именуется как ""Голодные игры.""
 wdt:P50 именуется как ""автор.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the authors of the work with ID ""Голодные игры"" (wd:Q11679) according to Wikidata?"	"Кто написал книгу ""Голодные игры""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q11679 wdt:P50 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'authors', 'of', 'the', 'work', 'with', 'ID', '``', 'Голодные', 'игры', ""''"", '(', 'wd', ':', 'Q11679', ')', 'according', 'to', 'Wikidata', '?']"	"['Кто', 'написал', 'книгу', '``', 'Голодные', 'игры', ""''"", '?']"	0.0919	0.5556	0.0952	94.0
130	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?label WHERE { wd:Q59150527 wdt:P527 ?uri . ?uri wdt:P577 ?date . ?uri wdt:P264 ?label . } ORDER BY ?date LIMIT 1 
 Где:
 wdt:P527 именуется как ""состоит из.""
 wdt:P577 именуется как ""дата публикации.""
 wdt:P264 именуется как ""лейбл звукозаписи.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the label and the date of publication for the recording that is a part of Q59150527 and has the earliest publication date?	На каком лэйбле Элвис записал его первый альбом?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?label WHERE { wd:Q59150527 wdt:P527 ?uri . ?uri wdt:P577 ?date . ?uri wdt:P264 ?label . } ORDER BY ?date LIMIT 1	['What', 'is', 'the', 'label', 'and', 'the', 'date', 'of', 'publication', 'for', 'the', 'recording', 'that', 'is', 'a', 'part', 'of', 'Q59150527', 'and', 'has', 'the', 'earliest', 'publication', 'date', '?']	['На', 'каком', 'лэйбле', 'Элвис', 'записал', 'его', 'первый', 'альбом', '?']	0.1764	0.1268	0.0	122.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the label and the date of publication for the recording that is a part of Q59150527 and has the earliest publication date?	Для какого лейбла Элвис написал первый альбом?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?label WHERE { wd:Q59150527 wdt:P527 ?uri . ?uri wdt:P577 ?date . ?uri wdt:P264 ?label . } ORDER BY ?date LIMIT 1	['What', 'is', 'the', 'label', 'and', 'the', 'date', 'of', 'publication', 'for', 'the', 'recording', 'that', 'is', 'a', 'part', 'of', 'Q59150527', 'and', 'has', 'the', 'earliest', 'publication', 'date', '?']	['Для', 'какого', 'лейбла', 'Элвис', 'написал', 'первый', 'альбом', '?']	0.1764	0.12	0.0	123.0
131	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q166262 wdt:P161 wd:Q45772 } 
 Где:
 wd:Q166262 именуется как ""Бэтмен: Начало.""
 wdt:P161 именуется как ""в ролях.""
 wd:Q45772 именуется как ""Кристиан Бейл.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Does theentity with label ""Бэтмен: Начало"" have the property ""в ролях"" with the value entity labeled as ""Кристиан Бейл""?"	"Снимался ли Кристиан Бейл в ""Бэтмен начало"""	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q166262 wdt:P161 wd:Q45772 }	"['Does', 'theentity', 'with', 'label', '``', 'Бэтмен', ':', 'Начало', ""''"", 'have', 'the', 'property', '``', 'в', 'ролях', ""''"", 'with', 'the', 'value', 'entity', 'labeled', 'as', '``', 'Кристиан', 'Бейл', ""''"", '?']"	"['Снимался', 'ли', 'Кристиан', 'Бейл', 'в', '``', 'Бэтмен', 'начало', ""''""]"	0.1811	0.7044	0.0	106.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Does theentity with label ""Бэтмен: Начало"" have the property ""в ролях"" with the value entity labeled as ""Кристиан Бейл""?"	"Снимался ли Кристиан Бэйл в ""Бэтмэн Начало""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q166262 wdt:P161 wd:Q45772 }	"['Does', 'theentity', 'with', 'label', '``', 'Бэтмен', ':', 'Начало', ""''"", 'have', 'the', 'property', '``', 'в', 'ролях', ""''"", 'with', 'the', 'value', 'entity', 'labeled', 'as', '``', 'Кристиан', 'Бейл', ""''"", '?']"	"['Снимался', 'ли', 'Кристиан', 'Бэйл', 'в', '``', 'Бэтмэн', 'Начало', ""''"", '?']"	0.1811	0.7382	0.0	105.0
132	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q844587 wdt:P263 ?uri } 
 Где:
 wd:Q844587 именуется как ""председатель правительства Испании.""
 wdt:P263 именуется как ""официальная резиденция.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the official residences of the ""President of the Government of Spain"" (wd:Q844587)?"	Где находится резиденция у премьер министра Испании?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q844587 wdt:P263 ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'official', 'residences', 'of', 'the', '``', 'President', 'of', 'the', 'Government', 'of', 'Spain', ""''"", '(', 'wd', ':', 'Q844587', ')', '?']"	['Где', 'находится', 'резиденция', 'у', 'премьер', 'министра', 'Испании', '?']	0.1754	0.1154	0.0	107.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the official residences of the ""President of the Government of Spain"" (wd:Q844587)?"	Где находится резиденция премьер-министра Испании?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q844587 wdt:P263 ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'official', 'residences', 'of', 'the', '``', 'President', 'of', 'the', 'Government', 'of', 'Spain', ""''"", '(', 'wd', ':', 'Q844587', ')', '?']"	['Где', 'находится', 'резиденция', 'премьер-министра', 'Испании', '?']	0.1754	0.0994	0.0	109.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI(s) of films with the most number of actors attached to them, where the films have the occupation ""актёр"" (Q33999) as their primary occupation?

(Please note that I assumed you meant ""occupation"" instead of ""род занятий"" which translate to ""rods of employment"" or ""professions."")"	Какой актер сыграл в большем количестве фильмах?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 . ?film wdt:P161 ?uri . } GROUP BY ?uri ORDER BY DESC(COUNT(DISTINCT(?film))) LIMIT 1	"['What', 'are', 'the', 'URI', '(', 's', ')', 'of', 'films', 'with', 'the', 'most', 'number', 'of', 'actors', 'attached', 'to', 'them', ',', 'where', 'the', 'films', 'have', 'the', 'occupation', '``', 'актёр', ""''"", '(', 'Q33999', ')', 'as', 'their', 'primary', 'occupation', '?', '(', 'Please', 'note', 'that', 'I', 'assumed', 'you', 'meant', '``', 'occupation', ""''"", 'instead', 'of', '``', 'род', 'занятий', ""''"", 'which', 'translate', 'to', '``', 'rods', 'of', 'employment', ""''"", 'or', '``', 'professions', '.', ""''"", ')']"	['Какой', 'актер', 'сыграл', 'в', 'большем', 'количестве', 'фильмах', '?']	0.1503	0.0448	0.0	283.0
(Please note that I assumed you meant ""occupation"" instead of ""род занятий"" which translate to ""rods of employment"" or ""professions."")"	Кто из актеров снялся в наибольшем количестве фильмов?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 . ?film wdt:P161 ?uri . } GROUP BY ?uri ORDER BY DESC(COUNT(DISTINCT(?film))) LIMIT 1	"['What', 'are', 'the', 'URI', '(', 's', ')', 'of', 'films', 'with', 'the', 'most', 'number', 'of', 'actors', 'attached', 'to', 'them', ',', 'where', 'the', 'films', 'have', 'the', 'occupation', '``', 'актёр', ""''"", '(', 'Q33999', ')', 'as', 'their', 'primary', 'occupation', '?', '(', 'Please', 'note', 'that', 'I', 'assumed', 'you', 'meant', '``', 'occupation', ""''"", 'instead', 'of', '``', 'род', 'занятий', ""''"", 'which', 'translate', 'to', '``', 'rods', 'of', 'employment', ""''"", 'or', '``', 'professions', '.', ""''"", ')']"	['Кто', 'из', 'актеров', 'снялся', 'в', 'наибольшем', 'количестве', 'фильмов', '?']	0.1503	0.0473	0.0	281.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI identifiers of countries that have more than two official languages?
(translated query: Which URIs represent countries with over two languages as their official tongues?)"	В каких странах более двух официальных языков?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256> . ?uri <http://www.wikidata.org/prop/direct/P37> ?language . } GROUP BY ?uri HAVING(COUNT(?language)>2)	['What', 'are', 'the', 'URI', 'identifiers', 'of', 'countries', 'that', 'have', 'more', 'than', 'two', 'official', 'languages', '?', '(', 'translated', 'query', ':', 'Which', 'URIs', 'represent', 'countries', 'with', 'over', 'two', 'languages', 'as', 'their', 'official', 'tongues', '?', ')']	['В', 'каких', 'странах', 'более', 'двух', 'официальных', 'языков', '?']	0.1693	0.0909	0.0	180.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI's of the songs that were published between 1980 and 1990, with their publish dates and performers (who are identified by the name ""Bruce Springstein"")?"	Покажи мне все песни Брюса Спрингстина выпушенные с 1980 по 1990.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7366 ; wdt:P577 ?date ; wdt:P175 wd:Q1225 . BIND(YEAR(?date) as ?year) . FILTER(?year >= 1980 && ?year <= 1990) }	"['What', 'are', 'the', 'URI', ""'s"", 'of', 'the', 'songs', 'that', 'were', 'published', 'between', '1980', 'and', '1990', ',', 'with', 'their', 'publish', 'dates', 'and', 'performers', '(', 'who', 'are', 'identified', 'by', 'the', 'name', '``', 'Bruce', 'Springstein', ""''"", ')', '?']"	['Покажи', 'мне', 'все', 'песни', 'Брюса', 'Спрингстина', 'выпушенные', 'с', '1980', 'по', '1990', '.']	0.1994	0.2049	0.0571	152.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of teleserial entities that have ""television program"" (Television:P31) as a subclass and have ""John Cleese"" (Q25014) as their creator directly or as a part of their creation process (through the chain of ""has contribution"" Property:P527)?"	Какие телевизионные шоу были выпущены Джоном Клизом?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q5398426>  . { ?uri <http://www.wikidata.org/prop/direct/P170> <http://www.wikidata.org/entity/Q25014> . } UNION { ?uri <http://www.wikidata.org/prop/direct/P170>/<http://www.wikidata.org/prop/direct/P527> <http://www.wikidata.org/entity/Q25014> . }  }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'teleserial', 'entities', 'that', 'have', '``', 'television', 'program', ""''"", '(', 'Television', ':', 'P31', ')', 'as', 'a', 'subclass', 'and', 'have', '``', 'John', 'Cleese', ""''"", '(', 'Q25014', ')', 'as', 'their', 'creator', 'directly', 'or', 'as', 'a', 'part', 'of', 'their', 'creation', 'process', '(', 'through', 'the', 'chain', 'of', '``', 'has', 'contribution', ""''"", 'Property', ':', 'P527', ')', '?']"	['Какие', 'телевизионные', 'шоу', 'были', 'выпущены', 'Джоном', 'Клизом', '?']	0.1542	0.0517	0.0	269.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of teleserial entities that have ""television program"" (Television:P31) as a subclass and have ""John Cleese"" (Q25014) as their creator directly or as a part of their creation process (through the chain of ""has contribution"" Property:P527)?"	Автором каких телевизионных шоу является Джон Клиз?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q5398426>  . { ?uri <http://www.wikidata.org/prop/direct/P170> <http://www.wikidata.org/entity/Q25014> . } UNION { ?uri <http://www.wikidata.org/prop/direct/P170>/<http://www.wikidata.org/prop/direct/P527> <http://www.wikidata.org/entity/Q25014> . }  }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'teleserial', 'entities', 'that', 'have', '``', 'television', 'program', ""''"", '(', 'Television', ':', 'P31', ')', 'as', 'a', 'subclass', 'and', 'have', '``', 'John', 'Cleese', ""''"", '(', 'Q25014', ')', 'as', 'their', 'creator', 'directly', 'or', 'as', 'a', 'part', 'of', 'their', 'creation', 'process', '(', 'through', 'the', 'chain', 'of', '``', 'has', 'contribution', ""''"", 'Property', ':', 'P527', ')', '?']"	['Автором', 'каких', 'телевизионных', 'шоу', 'является', 'Джон', 'Клиз', '?']	0.1542	0.0517	0.0	269.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct dates when Latvia was a member of the European Union?	Когда Латвия присоединилась к ЕС?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q211> <http://www.wikidata.org/prop/P463> ?membership . ?membership <http://www.wikidata.org/prop/statement/P463> <http://www.wikidata.org/entity/Q458> . ?membership <http://www.wikidata.org/prop/qualifier/P580> ?date . }	['What', 'are', 'the', 'distinct', 'dates', 'when', 'Latvia', 'was', 'a', 'member', 'of', 'the', 'European', 'Union', '?']	['Когда', 'Латвия', 'присоединилась', 'к', 'ЕС', '?']	0.1883	0.1723	0.0	70.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct dates when Latvia was a member of the European Union?	Когда Латвия присоединилась к Евросоюзу?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q211> <http://www.wikidata.org/prop/P463> ?membership . ?membership <http://www.wikidata.org/prop/statement/P463> <http://www.wikidata.org/entity/Q458> . ?membership <http://www.wikidata.org/prop/qualifier/P580> ?date . }	['What', 'are', 'the', 'distinct', 'dates', 'when', 'Latvia', 'was', 'a', 'member', 'of', 'the', 'European', 'Union', '?']	['Когда', 'Латвия', 'присоединилась', 'к', 'Евросоюзу', '?']	0.1883	0.1723	0.0	70.0
139	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q937857 ; wdt:P19 ?birthPlace . ?birthPlace wdt:P17 wd:Q233 . } 
 Где:
 wdt:P106 именуется как ""род занятий.""
 wd:Q937857 именуется как ""футболист.""
 wdt:P19 именуется как ""место рождения.""
 wdt:P17 именуется как ""государство.""
 wd:Q233 именуется как ""Мальта.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which distinct URI representation of an individual is both a football player (P106: wd:Q937857) and was born in a country (P19: Malta (wd:Q233)) represented as a state (P17)?	Какие футбольные игроки были рождены на Мальте?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q937857 ; wdt:P19 ?birthPlace . ?birthPlace wdt:P17 wd:Q233 . }	['Which', 'distinct', 'URI', 'representation', 'of', 'an', 'individual', 'is', 'both', 'a', 'football', 'player', '(', 'P106', ':', 'wd', ':', 'Q937857', ')', 'and', 'was', 'born', 'in', 'a', 'country', '(', 'P19', ':', 'Malta', '(', 'wd', ':', 'Q233', ')', ')', 'represented', 'as', 'a', 'state', '(', 'P17', ')', '?']	['Какие', 'футбольные', 'игроки', 'были', 'рождены', 'на', 'Мальте', '?']	0.1622	0.0698	0.0	167.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which distinct URI representation of an individual is both a football player (P106: wd:Q937857) and was born in a country (P19: Malta (wd:Q233)) represented as a state (P17)?	Кто из футболистов родился на Мальте?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q937857 ; wdt:P19 ?birthPlace . ?birthPlace wdt:P17 wd:Q233 . }	['Which', 'distinct', 'URI', 'representation', 'of', 'an', 'individual', 'is', 'both', 'a', 'football', 'player', '(', 'P106', ':', 'wd', ':', 'Q937857', ')', 'and', 'was', 'born', 'in', 'a', 'country', '(', 'P19', ':', 'Malta', '(', 'wd', ':', 'Q233', ')', ')', 'represented', 'as', 'a', 'state', '(', 'P17', ')', '?']	['Кто', 'из', 'футболистов', 'родился', 'на', 'Мальте', '?']	0.1622	0.0653	0.0	168.0
