id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the URI of a country with the most number of official languages?	В какой стране больше всего официальных языков	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256> . ?uri <http://www.wikidata.org/prop/direct/P37> ?language . } GROUP BY ?uri ORDER BY DESC(COUNT(?language)) LIMIT 1	['What', 'is', 'the', 'URI', 'of', 'a', 'country', 'with', 'the', 'most', 'number', 'of', 'official', 'languages', '?']	['В', 'какой', 'стране', 'больше', 'всего', 'официальных', 'языков']	0.0	0.0	0.0	66.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the URI of a country with the most number of official languages?	Какая страна имеет наибольшее количество официальных языков?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256> . ?uri <http://www.wikidata.org/prop/direct/P37> ?language . } GROUP BY ?uri ORDER BY DESC(COUNT(?language)) LIMIT 1	['What', 'is', 'the', 'URI', 'of', 'a', 'country', 'with', 'the', 'most', 'number', 'of', 'official', 'languages', '?']	['Какая', 'страна', 'имеет', 'наибольшее', 'количество', 'официальных', 'языков', '?']	0.1883	0.2	0.0	66.0
112	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q51803 wdt:P175 ?uri } 
 Где:
 wd:Q51803 именуется как ""Чубакка.""
 wdt:P175 именуется как ""исполнитель.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the performers for the entity with the label ""Chubaka"" (wd:Q51803)?"	Кто играл роль Чубакки?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q51803 wdt:P175 ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'performers', 'for', 'the', 'entity', 'with', 'the', 'label', '``', 'Chubaka', ""''"", '(', 'wd', ':', 'Q51803', ')', '?']"	['Кто', 'играл', 'роль', 'Чубакки', '?']	0.1774	0.0967	0.0	94.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the performers for the entity with the label ""Chubaka"" (wd:Q51803)?"	Какой актер сыграл роль Чубакки?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q51803 wdt:P175 ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'performers', 'for', 'the', 'entity', 'with', 'the', 'label', '``', 'Chubaka', ""''"", '(', 'wd', ':', 'Q51803', ')', '?']"	['Какой', 'актер', 'сыграл', 'роль', 'Чубакки', '?']	0.1774	0.1077	0.0	93.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the performers for the entity with the label ""Chubaka"" (wd:Q51803)?"	Как звали актеров, сыгравших роль Чубакки?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q51803 wdt:P175 ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'performers', 'for', 'the', 'entity', 'with', 'the', 'label', '``', 'Chubaka', ""''"", '(', 'wd', ':', 'Q51803', ')', '?']"	['Как', 'звали', 'актеров', ',', 'сыгравших', 'роль', 'Чубакки', '?']	0.1774	0.125	0.0	92.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the performers for the entity with the label ""Chubaka"" (wd:Q51803)?"	Кто играл Чубаку?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q51803 wdt:P175 ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'performers', 'for', 'the', 'entity', 'with', 'the', 'label', '``', 'Chubaka', ""''"", '(', 'wd', ':', 'Q51803', ')', '?']"	['Кто', 'играл', 'Чубаку', '?']	0.1774	0.0833	0.0	95.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the performers for the entity with the label ""Chubaka"" (wd:Q51803)?"	Какой актёр играл Чубакку?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q51803 wdt:P175 ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'performers', 'for', 'the', 'entity', 'with', 'the', 'label', '``', 'Chubaka', ""''"", '(', 'wd', ':', 'Q51803', ')', '?']"	['Какой', 'актёр', 'играл', 'Чубакку', '?']	0.1774	0.0967	0.0	94.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the URIs of libraries with a known founding date before the year 1400?	Назовите библиотеки, основанные ранее 1400 года.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7075 ; wdt:P571 ?date . FILTER (YEAR(?date) < 1400 ) }	['What', 'are', 'the', 'URIs', 'of', 'libraries', 'with', 'a', 'known', 'founding', 'date', 'before', 'the', 'year', '1400', '?']	['Назовите', 'библиотеки', ',', 'основанные', 'ранее', '1400', 'года', '.']	0.1869	0.1875	0.0	74.0
114	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q9143 ; wdt:P737 wd:Q42478 . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q9143 именуется как ""язык программирования.""
 wdt:P737 именуется как ""испытал влияние от.""
 wd:Q42478 именуется как ""Perl.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the unique URI's of programming languages that have the property ""instance of"" (P31) with the value ""programming language"" (wd:Q9143), and have the property ""influenced by"" (P737) with the value ""Perl"" (wd:Q42478)?"	На какие языки программирования повлиял Perl?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q9143 ; wdt:P737 wd:Q42478 . }	"['What', 'are', 'the', 'unique', 'URI', ""'s"", 'of', 'programming', 'languages', 'that', 'have', 'the', 'property', '``', 'instance', 'of', ""''"", '(', 'P31', ')', 'with', 'the', 'value', '``', 'programming', 'language', ""''"", '(', 'wd', ':', 'Q9143', ')', ',', 'and', 'have', 'the', 'property', '``', 'influenced', 'by', ""''"", '(', 'P737', ')', 'with', 'the', 'value', '``', 'Perl', ""''"", '(', 'wd', ':', 'Q42478', ')', '?']"	['На', 'какие', 'языки', 'программирования', 'повлиял', 'Perl', '?']	0.1845	0.1003	0.0	213.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the unique URI's of programming languages that have the property ""instance of"" (P31) with the value ""programming language"" (wd:Q9143), and have the property ""influenced by"" (P737) with the value ""Perl"" (wd:Q42478)?"	На какие языки программирования повлял Perl?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q9143 ; wdt:P737 wd:Q42478 . }	"['What', 'are', 'the', 'unique', 'URI', ""'s"", 'of', 'programming', 'languages', 'that', 'have', 'the', 'property', '``', 'instance', 'of', ""''"", '(', 'P31', ')', 'with', 'the', 'value', '``', 'programming', 'language', ""''"", '(', 'wd', ':', 'Q9143', ')', ',', 'and', 'have', 'the', 'property', '``', 'influenced', 'by', ""''"", '(', 'P737', ')', 'with', 'the', 'value', '``', 'Perl', ""''"", '(', 'wd', ':', 'Q42478', ')', '?']"	['На', 'какие', 'языки', 'программирования', 'повлял', 'Perl', '?']	0.1845	0.1003	0.0	213.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the unique URI's of programming languages that have the property ""instance of"" (P31) with the value ""programming language"" (wd:Q9143), and have the property ""influenced by"" (P737) with the value ""Perl"" (wd:Q42478)?"	На какие языки программирования Perl оказал влияние?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q9143 ; wdt:P737 wd:Q42478 . }	"['What', 'are', 'the', 'unique', 'URI', ""'s"", 'of', 'programming', 'languages', 'that', 'have', 'the', 'property', '``', 'instance', 'of', ""''"", '(', 'P31', ')', 'with', 'the', 'value', '``', 'programming', 'language', ""''"", '(', 'wd', ':', 'Q9143', ')', ',', 'and', 'have', 'the', 'property', '``', 'influenced', 'by', ""''"", '(', 'P737', ')', 'with', 'the', 'value', '``', 'Perl', ""''"", '(', 'wd', ':', 'Q42478', ')', '?']"	['На', 'какие', 'языки', 'программирования', 'Perl', 'оказал', 'влияние', '?']	0.1845	0.1071	0.0	212.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the unique URI's of programming languages that have the property ""instance of"" (P31) with the value ""programming language"" (wd:Q9143), and have the property ""influenced by"" (P737) with the value ""Perl"" (wd:Q42478)?"	На какие языки программирования оказал влияние Perl?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q9143 ; wdt:P737 wd:Q42478 . }	"['What', 'are', 'the', 'unique', 'URI', ""'s"", 'of', 'programming', 'languages', 'that', 'have', 'the', 'property', '``', 'instance', 'of', ""''"", '(', 'P31', ')', 'with', 'the', 'value', '``', 'programming', 'language', ""''"", '(', 'wd', ':', 'Q9143', ')', ',', 'and', 'have', 'the', 'property', '``', 'influenced', 'by', ""''"", '(', 'P737', ')', 'with', 'the', 'value', '``', 'Perl', ""''"", '(', 'wd', ':', 'Q42478', ')', '?']"	['На', 'какие', 'языки', 'программирования', 'оказал', 'влияние', 'Perl', '?']	0.1845	0.1071	0.0	212.0
115	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q130018> <http://www.wikidata.org/prop/direct/P131> ?uri} 
 Где:
 http://www.wikidata.org/entity/Q130018 именуется как ""Денали.""
 http://www.wikidata.org/prop/direct/P131 именуется как ""административно-территориальная единица.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct administrative-territorial units that ""Denali"" (<http://www.wikidata.org/entity/Q130018>) is associated with?"	В каком штата США находится гора Маккинли?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q130018> <http://www.wikidata.org/prop/direct/P131> ?uri}	"['What', 'are', 'the', 'distinct', 'administrative-territorial', 'units', 'that', '``', 'Denali', ""''"", '(', '<', 'http', ':', '//www.wikidata.org/entity/Q130018', '>', ')', 'is', 'associated', 'with', '?']"	['В', 'каком', 'штата', 'США', 'находится', 'гора', 'Маккинли', '?']	0.1807	0.1429	0.0	124.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct administrative-territorial units that ""Denali"" (<http://www.wikidata.org/entity/Q130018>) is associated with?"	В каком штате США расположен McKinley?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q130018> <http://www.wikidata.org/prop/direct/P131> ?uri}	"['What', 'are', 'the', 'distinct', 'administrative-territorial', 'units', 'that', '``', 'Denali', ""''"", '(', '<', 'http', ':', '//www.wikidata.org/entity/Q130018', '>', ')', 'is', 'associated', 'with', '?']"	['В', 'каком', 'штате', 'США', 'расположен', 'McKinley', '?']	0.1807	0.1337	0.0	122.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct administrative-territorial units that ""Denali"" (<http://www.wikidata.org/entity/Q130018>) is associated with?"	В каком штате США распоожена гора Мак-Кинли?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q130018> <http://www.wikidata.org/prop/direct/P131> ?uri}	"['What', 'are', 'the', 'distinct', 'administrative-territorial', 'units', 'that', '``', 'Denali', ""''"", '(', '<', 'http', ':', '//www.wikidata.org/entity/Q130018', '>', ')', 'is', 'associated', 'with', '?']"	['В', 'каком', 'штате', 'США', 'распоожена', 'гора', 'Мак-Кинли', '?']	0.1807	0.1429	0.0	124.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct administrative-territorial units that ""Denali"" (<http://www.wikidata.org/entity/Q130018>) is associated with?"	В каком штате США расположена гора МакКинли?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q130018> <http://www.wikidata.org/prop/direct/P131> ?uri}	"['What', 'are', 'the', 'distinct', 'administrative-territorial', 'units', 'that', '``', 'Denali', ""''"", '(', '<', 'http', ':', '//www.wikidata.org/entity/Q130018', '>', ')', 'is', 'associated', 'with', '?']"	['В', 'каком', 'штате', 'США', 'расположена', 'гора', 'МакКинли', '?']	0.1807	0.1429	0.0	124.0
116	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P114 wd:Q212282 . } 
 Где:
 wdt:P114 именуется как ""авиационный альянс.""
 wd:Q212282 именуется как ""SkyTeam.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that are associated with the property ""aviation alliance"" and have the value ""SkyTeam""?"	"Какие авиакомпании входят в альянс ""SkyTeam""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P114 wd:Q212282 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'are', 'associated', 'with', 'the', 'property', '``', 'aviation', 'alliance', ""''"", 'and', 'have', 'the', 'value', '``', 'SkyTeam', ""''"", '?']"	"['Какие', 'авиакомпании', 'входят', 'в', 'альянс', '``', 'SkyTeam', ""''"", '?']"	0.0904	0.4877	0.0833	122.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that are associated with the property ""aviation alliance"" and have the value ""SkyTeam""?"	Какие авиалинии являются частью SkyTeam?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P114 wd:Q212282 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'are', 'associated', 'with', 'the', 'property', '``', 'aviation', 'alliance', ""''"", 'and', 'have', 'the', 'value', '``', 'SkyTeam', ""''"", '?']"	['Какие', 'авиалинии', 'являются', 'частью', 'SkyTeam', '?']	0.2086	0.1988	0.0	125.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that are associated with the property ""aviation alliance"" and have the value ""SkyTeam""?"	Какие авиакомпании часть альянса SkyTeam?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P114 wd:Q212282 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'are', 'associated', 'with', 'the', 'property', '``', 'aviation', 'alliance', ""''"", 'and', 'have', 'the', 'value', '``', 'SkyTeam', ""''"", '?']"	['Какие', 'авиакомпании', 'часть', 'альянса', 'SkyTeam', '?']	0.2086	0.1988	0.0	125.0
118	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P140 wd:Q33203 . } 
 Где:
 wdt:P106 именуется как ""род занятий.""
 wd:Q82955 именуется как ""политик.""
 wdt:P140 именуется как ""религия или мировоззрение.""
 wd:Q33203 именуется как ""методизм.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of individuals who are politicians and hold the religion or worldview ""methodism""?"	Назовите всех политиков, состоящих в Методистской церкви.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P140 wd:Q33203 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'are', 'politicians', 'and', 'hold', 'the', 'religion', 'or', 'worldview', '``', 'methodism', ""''"", '?']"	['Назовите', 'всех', 'политиков', ',', 'состоящих', 'в', 'Методистской', 'церкви', '.']	0.0	0.0	0.0	104.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of individuals who are politicians and hold the religion or worldview ""methodism""?"	Все методистские политики	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P140 wd:Q33203 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'are', 'politicians', 'and', 'hold', 'the', 'religion', 'or', 'worldview', '``', 'methodism', ""''"", '?']"	['Все', 'методистские', 'политики']	0.0	0.0	0.0	108.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of individuals who are politicians and hold the religion or worldview ""methodism""?"	Пепечислите всех политиков, относящихся с Методизму	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P140 wd:Q33203 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'are', 'politicians', 'and', 'hold', 'the', 'religion', 'or', 'worldview', '``', 'methodism', ""''"", '?']"	['Пепечислите', 'всех', 'политиков', ',', 'относящихся', 'с', 'Методизму']	0.0	0.0	0.0	105.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of individuals who are politicians and hold the religion or worldview ""methodism""?"	Выдай мне всех методистских политиков.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P140 wd:Q33203 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'are', 'politicians', 'and', 'hold', 'the', 'religion', 'or', 'worldview', '``', 'methodism', ""''"", '?']"	['Выдай', 'мне', 'всех', 'методистских', 'политиков', '.']	0.0	0.0	0.0	106.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of individuals who are politicians and hold the religion or worldview ""methodism""?"	Перечислите политиков, приверженных Методизму.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P140 wd:Q33203 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'are', 'politicians', 'and', 'hold', 'the', 'religion', 'or', 'worldview', '``', 'methodism', ""''"", '?']"	['Перечислите', 'политиков', ',', 'приверженных', 'Методизму', '.']	0.0	0.0	0.0	107.0
119	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q658375 wdt:P50 ?author . ?uri wdt:P50 ?author . FILTER(?uri != wd:Q658375) } 
 Где:
 wd:Q658375 именуется как ""Виноваты звёзды.""
 wdt:P50 именуется как ""автор.""
 wdt:P50 именуется как ""автор.""
 wd:Q658375 именуется как ""Виноваты звёзды.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that have ""Виноваты звёзды"" (Q658375) as an author, but are not ""Виноваты звёзды"" themselves?"	"Какие книги были написаны автором ""Виноваты звезды""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q658375 wdt:P50 ?author . ?uri wdt:P50 ?author . FILTER(?uri != wd:Q658375) }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', '``', 'Виноваты', 'звёзды', ""''"", '(', 'Q658375', ')', 'as', 'an', 'author', ',', 'but', 'are', 'not', '``', 'Виноваты', 'звёзды', ""''"", 'themselves', '?']"	"['Какие', 'книги', 'были', 'написаны', 'автором', '``', 'Виноваты', 'звезды', ""''"", '?']"	0.1312	0.4429	0.08	107.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that have ""Виноваты звёзды"" (Q658375) as an author, but are not ""Виноваты звёзды"" themselves?"	Какие книги написал автор книги Ошибка в наших зведзах?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q658375 wdt:P50 ?author . ?uri wdt:P50 ?author . FILTER(?uri != wd:Q658375) }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', '``', 'Виноваты', 'звёзды', ""''"", '(', 'Q658375', ')', 'as', 'an', 'author', ',', 'but', 'are', 'not', '``', 'Виноваты', 'звёзды', ""''"", 'themselves', '?']"	['Какие', 'книги', 'написал', 'автор', 'книги', 'Ошибка', 'в', 'наших', 'зведзах', '?']	0.1717	0.1107	0.0	117.0
120	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P2044 ?elevation . } ORDER BY DESC(?elevation) LIMIT 1 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q8502 именуется как ""гора.""
 wdt:P2044 именуется как ""высота над уровнем моря.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the tallest mountain (goes under the category ""mountain"" with property ""this type of thing is a mountain."" in Wikidata) according to its elevation above sea level (has the property ""height above sea level."")?

OR

Which mountain (belongs to the mountain category in Wikidata) has the greatest height above sea level (is described by the ""height above sea level."" property)?"	Какая гора является самой высокой?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P2044 ?elevation . } ORDER BY DESC(?elevation) LIMIT 1	"['What', 'is', 'the', 'tallest', 'mountain', '(', 'goes', 'under', 'the', 'category', '``', 'mountain', ""''"", 'with', 'property', '``', 'this', 'type', 'of', 'thing', 'is', 'a', 'mountain', '.', ""''"", 'in', 'Wikidata', ')', 'according', 'to', 'its', 'elevation', 'above', 'sea', 'level', '(', 'has', 'the', 'property', '``', 'height', 'above', 'sea', 'level.', ""''"", ')', '?', 'OR', 'Which', 'mountain', '(', 'belongs', 'to', 'the', 'mountain', 'category', 'in', 'Wikidata', ')', 'has', 'the', 'greatest', 'height', 'above', 'sea', 'level', '(', 'is', 'described', 'by', 'the', '``', 'height', 'above', 'sea', 'level', '.', ""''"", 'property', ')', '?']"	['Какая', 'гора', 'является', 'самой', 'высокой', '?']	0.1452	0.0319	0.0	376.0
Which mountain (belongs to the mountain category in Wikidata) has the greatest height above sea level (is described by the ""height above sea level."" property)?"	Наивысшая гора на земле?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P2044 ?elevation . } ORDER BY DESC(?elevation) LIMIT 1	"['What', 'is', 'the', 'tallest', 'mountain', '(', 'goes', 'under', 'the', 'category', '``', 'mountain', ""''"", 'with', 'property', '``', 'this', 'type', 'of', 'thing', 'is', 'a', 'mountain', '.', ""''"", 'in', 'Wikidata', ')', 'according', 'to', 'its', 'elevation', 'above', 'sea', 'level', '(', 'has', 'the', 'property', '``', 'height', 'above', 'sea', 'level.', ""''"", ')', '?', 'OR', 'Which', 'mountain', '(', 'belongs', 'to', 'the', 'mountain', 'category', 'in', 'Wikidata', ')', 'has', 'the', 'greatest', 'height', 'above', 'sea', 'level', '(', 'is', 'described', 'by', 'the', '``', 'height', 'above', 'sea', 'level', '.', ""''"", 'property', ')', '?']"	['Наивысшая', 'гора', 'на', 'земле', '?']	0.1452	0.0287	0.0	377.0
Which mountain (belongs to the mountain category in Wikidata) has the greatest height above sea level (is described by the ""height above sea level."" property)?"	Какая наивысшая гора?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P2044 ?elevation . } ORDER BY DESC(?elevation) LIMIT 1	"['What', 'is', 'the', 'tallest', 'mountain', '(', 'goes', 'under', 'the', 'category', '``', 'mountain', ""''"", 'with', 'property', '``', 'this', 'type', 'of', 'thing', 'is', 'a', 'mountain', '.', ""''"", 'in', 'Wikidata', ')', 'according', 'to', 'its', 'elevation', 'above', 'sea', 'level', '(', 'has', 'the', 'property', '``', 'height', 'above', 'sea', 'level.', ""''"", ')', '?', 'OR', 'Which', 'mountain', '(', 'belongs', 'to', 'the', 'mountain', 'category', 'in', 'Wikidata', ')', 'has', 'the', 'greatest', 'height', 'above', 'sea', 'level', '(', 'is', 'described', 'by', 'the', '``', 'height', 'above', 'sea', 'level', '.', ""''"", 'property', ')', '?']"	['Какая', 'наивысшая', 'гора', '?']	0.1452	0.0247	0.0	378.0
Which mountain (belongs to the mountain category in Wikidata) has the greatest height above sea level (is described by the ""height above sea level."" property)?"	Какая самая высокая гора?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P2044 ?elevation . } ORDER BY DESC(?elevation) LIMIT 1	"['What', 'is', 'the', 'tallest', 'mountain', '(', 'goes', 'under', 'the', 'category', '``', 'mountain', ""''"", 'with', 'property', '``', 'this', 'type', 'of', 'thing', 'is', 'a', 'mountain', '.', ""''"", 'in', 'Wikidata', ')', 'according', 'to', 'its', 'elevation', 'above', 'sea', 'level', '(', 'has', 'the', 'property', '``', 'height', 'above', 'sea', 'level.', ""''"", ')', '?', 'OR', 'Which', 'mountain', '(', 'belongs', 'to', 'the', 'mountain', 'category', 'in', 'Wikidata', ')', 'has', 'the', 'greatest', 'height', 'above', 'sea', 'level', '(', 'is', 'described', 'by', 'the', '``', 'height', 'above', 'sea', 'level', '.', ""''"", 'property', ')', '?']"	['Какая', 'самая', 'высокая', 'гора', '?']	0.1452	0.0287	0.0	377.0
Which mountain (belongs to the mountain category in Wikidata) has the greatest height above sea level (is described by the ""height above sea level."" property)?"	Какая гора самая высокая?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P2044 ?elevation . } ORDER BY DESC(?elevation) LIMIT 1	"['What', 'is', 'the', 'tallest', 'mountain', '(', 'goes', 'under', 'the', 'category', '``', 'mountain', ""''"", 'with', 'property', '``', 'this', 'type', 'of', 'thing', 'is', 'a', 'mountain', '.', ""''"", 'in', 'Wikidata', ')', 'according', 'to', 'its', 'elevation', 'above', 'sea', 'level', '(', 'has', 'the', 'property', '``', 'height', 'above', 'sea', 'level.', ""''"", ')', '?', 'OR', 'Which', 'mountain', '(', 'belongs', 'to', 'the', 'mountain', 'category', 'in', 'Wikidata', ')', 'has', 'the', 'greatest', 'height', 'above', 'sea', 'level', '(', 'is', 'described', 'by', 'the', '``', 'height', 'above', 'sea', 'level', '.', ""''"", 'property', ')', '?']"	['Какая', 'гора', 'самая', 'высокая', '?']	0.1452	0.0287	0.0	377.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the poet with the most number of authored books, among all poets, according to Wikidata?	Какой поэт написал наибольшее количество книг?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q49757> . ?s2  <http://www.wikidata.org/prop/direct/P50>  ?s1 . ?s2  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q571> .  } GROUP BY ?s1 ORDER BY DESC(COUNT(?s2)) OFFSET 0 LIMIT 1	['What', 'is', 'the', 'poet', 'with', 'the', 'most', 'number', 'of', 'authored', 'books', ',', 'among', 'all', 'poets', ',', 'according', 'to', 'Wikidata', '?']	['Какой', 'поэт', 'написал', 'наибольшее', 'количество', 'книг', '?']	0.1818	0.1404	0.0	90.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the poet with the most number of authored books, among all poets, according to Wikidata?	Какой поэт написал больше всех книг?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q49757> . ?s2  <http://www.wikidata.org/prop/direct/P50>  ?s1 . ?s2  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q571> .  } GROUP BY ?s1 ORDER BY DESC(COUNT(?s2)) OFFSET 0 LIMIT 1	['What', 'is', 'the', 'poet', 'with', 'the', 'most', 'number', 'of', 'authored', 'books', ',', 'among', 'all', 'poets', ',', 'according', 'to', 'Wikidata', '?']	['Какой', 'поэт', 'написал', 'больше', 'всех', 'книг', '?']	0.1818	0.1404	0.0	90.0
