id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which URI's represent a song (wd:Q7366) released between 1980 and 1990 by Bruce Springsteen (wd:Q1225) with a known publication date?	Welche Lieder hat Brucse Springsteen zwischen 1980 und 1990 veröffentlicht?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7366 ; wdt:P577 ?date ; wdt:P175 wd:Q1225 . BIND(YEAR(?date) as ?year) . FILTER(?year >= 1980 && ?year <= 1990) }	"['Which', 'URI', ""'s"", 'represent', 'a', 'song', '(', 'wd', ':', 'Q7366', ')', 'released', 'between', '1980', 'and', '1990', 'by', 'Bruce', 'Springsteen', '(', 'wd', ':', 'Q1225', ')', 'with', 'a', 'known', 'publication', 'date', '?']"	['Welche', 'Lieder', 'hat', 'Brucse', 'Springsteen', 'zwischen', '1980', 'und', '1990', 'veröffentlicht', '?']	0.2429	0.4613	0.1379	97.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	How many distinct politicians have visited Columbia University for a task or activity?	Wie viele Politiker haben an der Columbia University ihren Abschluss gemacht?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P69 wd:Q49088 . }	['How', 'many', 'distinct', 'politicians', 'have', 'visited', 'Columbia', 'University', 'for', 'a', 'task', 'or', 'activity', '?']	['Wie', 'viele', 'Politiker', 'haben', 'an', 'der', 'Columbia', 'University', 'ihren', 'Abschluss', 'gemacht', '?']	0.1715	0.7682	0.1667	48.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct born-on dates of the actors in the Charmed – Magical Hexes series?	Wann wurden die Darsteller der Fernsehserie Charmed geboren?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?date WHERE { <http://www.wikidata.org/entity/Q162371> <http://www.wikidata.org/prop/direct/P161>/<http://www.wikidata.org/prop/direct/P569> ?date . }	['What', 'are', 'the', 'distinct', 'born-on', 'dates', 'of', 'the', 'actors', 'in', 'the', 'Charmed', '–', 'Magical', 'Hexes', 'series', '?']	['Wann', 'wurden', 'die', 'Darsteller', 'der', 'Fernsehserie', 'Charmed', 'geboren', '?']	0.2207	0.3729	0.0909	60.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which distinct URIs represent organizations that are either a direct subclass of ""Organization"" or have ""Organization"" as an ancestor class in the ""Unterklasse von"" property, and are in the telecommunications industry branch and located in Belgium?"	Welche Telekommunikationsunternehmen stammen aus Belgien?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q43229> } UNION { ?uri <http://www.wikidata.org/prop/direct/P31>/(<http://www.wikidata.org/prop/direct/P279>*) <http://www.wikidata.org/entity/Q43229> } . ?uri <http://www.wikidata.org/prop/direct/P452> <http://www.wikidata.org/entity/Q418> .  ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q31> . }	"['Which', 'distinct', 'URIs', 'represent', 'organizations', 'that', 'are', 'either', 'a', 'direct', 'subclass', 'of', '``', 'Organization', ""''"", 'or', 'have', '``', 'Organization', ""''"", 'as', 'an', 'ancestor', 'class', 'in', 'the', '``', 'Unterklasse', 'von', ""''"", 'property', ',', 'and', 'are', 'in', 'the', 'telecommunications', 'industry', 'branch', 'and', 'located', 'in', 'Belgium', '?']"	['Welche', 'Telekommunikationsunternehmen', 'stammen', 'aus', 'Belgien', '?']	0.1616	0.0587	0.0	207.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of entities that are a ""See"" and are in the state of ""Dänemark""?"	Liste alle Seen in Dänemark auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q23397 ; wdt:P17 wd:Q35 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'are', 'a', '``', 'See', ""''"", 'and', 'are', 'in', 'the', 'state', 'of', '``', 'Dänemark', ""''"", '?']"	['Liste', 'alle', 'Seen', 'in', 'Dänemark', 'auf', '.']	0.211	0.2339	0.1	71.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of entities that are a ""See"" and are in the state of ""Dänemark""?"	Gib mir eine Liste aller Seen in Dänemark	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q23397 ; wdt:P17 wd:Q35 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'are', 'a', '``', 'See', ""''"", 'and', 'are', 'in', 'the', 'state', 'of', '``', 'Dänemark', ""''"", '?']"	['Gib', 'mir', 'eine', 'Liste', 'aller', 'Seen', 'in', 'Dänemark']	0.211	0.25	0.0909	63.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which URI's represent buildings or structures that follow the Gothic architectural style and are located in the historic county of Kent?	Zeige alle gotischen Gebäude in Kent.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?type wdt:P279* wd:Q176483 . ?uri wdt:P149 ?type ; wdt:P7959 wd:Q67479626 . }	"['Which', 'URI', ""'s"", 'represent', 'buildings', 'or', 'structures', 'that', 'follow', 'the', 'Gothic', 'architectural', 'style', 'and', 'are', 'located', 'in', 'the', 'historic', 'county', 'of', 'Kent', '?']"	['Zeige', 'alle', 'gotischen', 'Gebäude', 'in', 'Kent', '.']	0.2122	0.2441	0.0769	107.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of the entities that represent a Currency with the code ""CFA-Franc BCEAO"" (CFA-Franc issued by the BCEAO)?"	In welchen Ländern kannst man mit westafrikanischen CFA Franc bezahlen?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P38 wd:Q861690 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'represent', 'a', 'Currency', 'with', 'the', 'code', '``', 'CFA-Franc', 'BCEAO', ""''"", '(', 'CFA-Franc', 'issued', 'by', 'the', 'BCEAO', ')', '?']"	['In', 'welchen', 'Ländern', 'kannst', 'man', 'mit', 'westafrikanischen', 'CFA', 'Franc', 'bezahlen', '?']	0.1735	0.1236	0.0	100.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which URI's are the subclasses of the Feast Day (wd:Q1445650) concept?	Welche Feiertage gibt es auf der Welt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q1445650 . ?uri wdt:P31 ?type . }	"['Which', 'URI', ""'s"", 'are', 'the', 'subclasses', 'of', 'the', 'Feast', 'Day', '(', 'wd', ':', 'Q1445650', ')', 'concept', '?']"	['Welche', 'Feiertage', 'gibt', 'es', 'auf', 'der', 'Welt', '?']	0.1856	0.1765	0.0	50.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which is the longest fluid (river) with a recorded length, and what is that length in meters, taking into account any given precision and converting it to the SI unit?	Wie heißt der längste Fluss?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	"PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4022 . ?uri p:P2043 ?stmnode. ?stmnode psv:P2043 ?valuenode . ?valuenode wikibase:quantityAmount ?length . ?valuenode wikibase:quantityUnit ?unit . ?valuenode wikibase:quantityLowerBound ?lowerbound. ?valuenode wikibase:quantityUpperBound ?upperbound. BIND((?upperbound-?lowerbound)/2 AS ?precision). BIND(IF(?precision=0, ?length, (CONCAT(str(?length), ""±"", str(?precision)))) AS ?length2). ?unit p:P2370 ?unitstmnode . ?unitstmnode psv:P2370 ?unitvaluenode . ?unitvaluenode wikibase:quantityAmount ?conversion . ?unitvaluenode wikibase:quantityUnit wd:Q11573 . BIND(?length * ?conversion AS ?length_in_m) . } ORDER BY DESC(?length_in_m) LIMIT 1"	['Which', 'is', 'the', 'longest', 'fluid', '(', 'river', ')', 'with', 'a', 'recorded', 'length', ',', 'and', 'what', 'is', 'that', 'length', 'in', 'meters', ',', 'taking', 'into', 'account', 'any', 'given', 'precision', 'and', 'converting', 'it', 'to', 'the', 'SI', 'unit', '?']	['Wie', 'heißt', 'der', 'längste', 'Fluss', '?']	0.1677	0.0739	0.0	146.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What organizations were founded, created, established, or built in the year 1930?	Welche Organisationen wurden 1930 gegründet?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?sub WHERE { ?sub wdt:P571 ?year . ?sub wdt:P31/wdt:P131* wd:Q43229 . FILTER(year(?year) = 1930) . } 	['What', 'organizations', 'were', 'founded', ',', 'created', ',', 'established', ',', 'or', 'built', 'in', 'the', 'year', '1930', '?']	['Welche', 'Organisationen', 'wurden', '1930', 'gegründet', '?']	0.2223	0.3231	0.0	59.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which manufacturing companies produce weapons that belong to the category of ""Waffengattung"" and have a subclass relationship with a specific subclass of weapons?

Translation of the SPARQL query into natural language:
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which city in Germany has the largest population among all cities that are part of a state in Germany?	Welche ist die flächenmäßig kleinste Stadt in Deutschland?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P17 wd:Q183 . ?res wdt:P31/wdt:P279* wd:Q515 . ?res wdt:P1082 ?inhabitants . } ORDER BY ?inhabitants LIMIt 1	['Which', 'city', 'in', 'Germany', 'has', 'the', 'largest', 'population', 'among', 'all', 'cities', 'that', 'are', 'part', 'of', 'a', 'state', 'in', 'Germany', '?']	['Welche', 'ist', 'die', 'flächenmäßig', 'kleinste', 'Stadt', 'in', 'Deutschland', '?']	0.2163	0.317	0.0769	75.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which person, holding a public office or position, has been the mayor of Lisbon with the earliest known start date?	Welche ist die Regierungspartei in Lissabon?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?res WHERE { ?mayor wdt:P31 wd:Q5 . ?mayor p:P39 _:a ._:a ps:P39 wd:Q43185970 ._:a pq:P580 ?date . ?mayor wdt:P102 ?res . } ORDER BY DESC(?date) LIMIT 1	['Which', 'person', ',', 'holding', 'a', 'public', 'office', 'or', 'position', ',', 'has', 'been', 'the', 'mayor', 'of', 'Lisbon', 'with', 'the', 'earliest', 'known', 'start', 'date', '?']	['Welche', 'ist', 'die', 'Regierungspartei', 'in', 'Lissabon', '?']	0.1785	0.1221	0.0	90.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which Jupitermoon has the largest mass?	Welcher ist der leichteste Mond vom Jupiter?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?mass WHERE { ?res wdt:P31 wd:Q61702557 . ?res wdt:P2067 ?mass . } ORDER BY ?mass LIMIT 1	['Which', 'Jupitermoon', 'has', 'the', 'largest', 'mass', '?']	['Welcher', 'ist', 'der', 'leichteste', 'Mond', 'vom', 'Jupiter', '?']	0.1726	0.3975	0.0	33.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"How many episodes belong to ""Die Sopranos/Season 1"" according to Wikidata? (Our query uses the terms ""Staffel"" and ""Die Sopranos/Staffel 1"" which correspond to property P4908 with value Q5274359 respectively.)"	Liste alle Episoden der ersten Staffel der HBO-Fernsehserie The Sopranos auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT (COUNT(?episode) AS ?count) WHERE { ?episode wdt:P4908 wd:Q5274359 . }	"['How', 'many', 'episodes', 'belong', 'to', '``', 'Die', 'Sopranos/Season', '1', ""''"", 'according', 'to', 'Wikidata', '?', '(', 'Our', 'query', 'uses', 'the', 'terms', '``', 'Staffel', ""''"", 'and', '``', 'Die', 'Sopranos/Staffel', '1', ""''"", 'which', 'correspond', 'to', 'property', 'P4908', 'with', 'value', 'Q5274359', 'respectively', '.', ')']"	['Liste', 'alle', 'Episoden', 'der', 'ersten', 'Staffel', 'der', 'HBO-Fernsehserie', 'The', 'Sopranos', 'auf', '.']	0.1952	0.1792	0.0	163.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which query returns entities with a property ""Anzahl der Episoden"" where the value for entity ""Battlestar Galactica"" is greater than the value for entity ""Kampfstern Galactica""?"	Hat die Neuauflage von Battlestar Galactica mehr Episoden als die alte Serie?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q237072 wdt:P1113 ?newNumOfEpisodes . wd:Q2367132 wdt:P1113 ?oldNumOfEpisodes . FILTER (?newNumOfEpisodes > ?oldNumOfEpisodes) }	"['Which', 'query', 'returns', 'entities', 'with', 'a', 'property', '``', 'Anzahl', 'der', 'Episoden', ""''"", 'where', 'the', 'value', 'for', 'entity', '``', 'Battlestar', 'Galactica', ""''"", 'is', 'greater', 'than', 'the', 'value', 'for', 'entity', '``', 'Kampfstern', 'Galactica', ""''"", '?']"	['Hat', 'die', 'Neuauflage', 'von', 'Battlestar', 'Galactica', 'mehr', 'Episoden', 'als', 'die', 'alte', 'Serie', '?']	0.1257	0.4485	0.0	127.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which distinctive film productions have ""Hal Roach"" as their producer?"	Liste alle Filme, die Hal Roach produziert hat, auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?uri <http://www.wikidata.org/prop/direct/P162> <http://www.wikidata.org/entity/Q72792> . }	"['Which', 'distinctive', 'film', 'productions', 'have', '``', 'Hal', 'Roach', ""''"", 'as', 'their', 'producer', '?']"	['Liste', 'alle', 'Filme', ',', 'die', 'Hal', 'Roach', 'produziert', 'hat', ',', 'auf', '.']	0.16	0.5515	0.0	47.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinct URI's represent a political party in Greece that holds a pro-European political worldview?	Welche griechischen Parteien sind proeuropäisch eingestellt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7278 ; wdt:P17 wd:Q41 ; wdt:P1142 wd:Q3781399 . }	"['Which', 'distinct', 'URI', ""'s"", 'represent', 'a', 'political', 'party', 'in', 'Greece', 'that', 'holds', 'a', 'pro-European', 'political', 'worldview', '?']"	['Welche', 'griechischen', 'Parteien', 'sind', 'proeuropäisch', 'eingestellt', '?']	0.1856	0.1651	0.0	78.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which bands or musicians have been bandleaders and played the trumpet?	Liste alle Bandleader auf, die Trompete spielen.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P106 wd:Q806349 . ?res wdt:P1303 wd:Q8338 . }	['Which', 'bands', 'or', 'musicians', 'have', 'been', 'bandleaders', 'and', 'played', 'the', 'trumpet', '?']	['Liste', 'alle', 'Bandleader', 'auf', ',', 'die', 'Trompete', 'spielen', '.']	0.0	0.0	0.0	52.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which mountain on Earth, other than the highest one, has the second highest elevation above sea level and belongs to a subclass of ""Berg"" and is a part of a continent?"	Wie heißt der zweithöchste Berg der Welt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?res WHERE { ?res wdt:P31/wdt:P279* wd:Q8502 . ?res wdt:P2044 ?elevation . ?res wdt:P30/wdt:P361 wd:Q2 . } ORDER BY DESC(?elevation) LIMIT 1 OFFSET 1	"['Which', 'mountain', 'on', 'Earth', ',', 'other', 'than', 'the', 'highest', 'one', ',', 'has', 'the', 'second', 'highest', 'elevation', 'above', 'sea', 'level', 'and', 'belongs', 'to', 'a', 'subclass', 'of', '``', 'Berg', ""''"", 'and', 'is', 'a', 'part', 'of', 'a', 'continent', '?']"	['Wie', 'heißt', 'der', 'zweithöchste', 'Berg', 'der', 'Welt', '?']	0.1986	0.1667	0.0	137.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which is the city in Egypt with the largest population?	Ist Ägyptens größte Stadt auch die Hauptstadt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { { SELECT ?largest WHERE { ?largest <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . ?largest <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q79> . ?largest <http://www.wikidata.org/prop/direct/P1082> ?population . } ORDER BY DESC(?population) LIMIT 1 } <http://www.wikidata.org/entity/Q79> <http://www.wikidata.org/prop/direct/P36> ?largest . }	['Which', 'is', 'the', 'city', 'in', 'Egypt', 'with', 'the', 'largest', 'population', '?']	['Ist', 'Ägyptens', 'größte', 'Stadt', 'auch', 'die', 'Hauptstadt', '?']	0.1941	0.2727	0.0	42.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which distinctive URIs represent individuals with a documented birthplace and deathplace, and who have been involved in the activity ""Schachspieler"" (Chess Player) with any known subtypes of occupation?"	Welche Schachspieler sind am gleichen Ort gestorben, an dem sie geboren wurden?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P19 _:a . ?uri wdt:P20 _:a . ?uri wdt:P106/wdt:P279* wd:Q10873124 . }	"['Which', 'distinctive', 'URIs', 'represent', 'individuals', 'with', 'a', 'documented', 'birthplace', 'and', 'deathplace', ',', 'and', 'who', 'have', 'been', 'involved', 'in', 'the', 'activity', '``', 'Schachspieler', ""''"", '(', 'Chess', 'Player', ')', 'with', 'any', 'known', 'subtypes', 'of', 'occupation', '?']"	['Welche', 'Schachspieler', 'sind', 'am', 'gleichen', 'Ort', 'gestorben', ',', 'an', 'dem', 'sie', 'geboren', 'wurden', '?']	0.2217	0.3359	0.0	158.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which mountains are higher than the mountain Nanga Parbat in meters?

Explanation:
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the public offices or positions that have held an ancient Roman king?	Liste die sieben Könige Roms auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT * WHERE { ?res wdt:P39 wd:Q55375123 . }	['What', 'are', 'the', 'public', 'offices', 'or', 'positions', 'that', 'have', 'held', 'an', 'ancient', 'Roman', 'king', '?']	['Liste', 'die', 'sieben', 'Könige', 'Roms', 'auf', '.']	0.0	0.0	0.0	60.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which URI identification represents a person's birthplace that is either part of the administrative division named ""Wien"" or a deceased person's death place that is part of the administrative division named ""Berlin""?"	Liste alle Menschen auf, die in Wien geboren und in Berlin gestorben sind.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?uri WHERE {{ ?uri wdt:P19/wdt:P131* wd:Q1741 . { SELECT ?uri WHERE { ?uri wdt:P20 wd:Q64 . }}} UNION { ?uri wdt:P20/wdt:P131* wd:Q64 . { SELECT ?uri WHERE { ?uri wdt:P19 wd:Q1741 . }}} UNION { ?uri wdt:P19/wdt:P131+ wd:Q1741 . { SELECT ?uri WHERE { ?uri wdt:P20/wdt:P131+ wd:Q64 . }}}}	"['Which', 'URI', 'identification', 'represents', 'a', 'person', ""'s"", 'birthplace', 'that', 'is', 'either', 'part', 'of', 'the', 'administrative', 'division', 'named', '``', 'Wien', ""''"", 'or', 'a', 'deceased', 'person', ""'s"", 'death', 'place', 'that', 'is', 'part', 'of', 'the', 'administrative', 'division', 'named', '``', 'Berlin', ""''"", '?']"	['Liste', 'alle', 'Menschen', 'auf', ',', 'die', 'in', 'Wien', 'geboren', 'und', 'in', 'Berlin', 'gestorben', 'sind', '.']	0.196	0.2004	0.0	171.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of the breweries that are located in Australia?	Liste alle Brauereinen in Australien auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q131734 . ?uri wdt:P17 wd:Q408 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'breweries', 'that', 'are', 'located', 'in', 'Australia', '?']"	['Liste', 'alle', 'Brauereinen', 'in', 'Australien', 'auf', '.']	0.1883	0.1872	0.1176	56.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which distinct URI's represent the producers of films that are subclasses of ""Film"" and have production costs greater than 80 million Euros? (Translation of the given SPARQL query: ""Give me the distinct URI's of those entities that are labeled as 'Producer', have the type 'Film' or a subtype and have production costs greater than 80 million Euros."")"	Liste alle von Steven Spielberg produzierten Filme mit einem Budget von mindestens 80 Millionen Dollar auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P162 wd:Q8877 ; wdt:P31/wdt:P279* wd:Q11424 ; wdt:P2130 ?cost . FILTER(?cost > 80000000)}	"['Which', 'distinct', 'URI', ""'s"", 'represent', 'the', 'producers', 'of', 'films', 'that', 'are', 'subclasses', 'of', '``', 'Film', ""''"", 'and', 'have', 'production', 'costs', 'greater', 'than', '80', 'million', 'Euros', '?', '(', 'Translation', 'of', 'the', 'given', 'SPARQL', 'query', ':', '``', 'Give', 'me', 'the', 'distinct', 'URI', ""'s"", 'of', 'those', 'entities', 'that', 'are', 'labeled', 'as', ""'Producer"", ""'"", ',', 'have', 'the', 'type', ""'Film"", ""'"", 'or', 'a', 'subtype', 'and', 'have', 'production', 'costs', 'greater', 'than', '80', 'million', 'Euros', '.', ""''"", ')']"	['Liste', 'alle', 'von', 'Steven', 'Spielberg', 'produzierten', 'Filme', 'mit', 'einem', 'Budget', 'von', 'mindestens', '80', 'Millionen', 'Dollar', 'auf', '.']	0.1769	0.1151	0.037	287.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinct URI representations denote a Football club that is located in Spain?	Liste alle Fußballvereine aus Spanien auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q476028> . ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q29> . }	['Which', 'distinct', 'URI', 'representations', 'denote', 'a', 'Football', 'club', 'that', 'is', 'located', 'in', 'Spain', '?']	['Liste', 'alle', 'Fußballvereine', 'aus', 'Spanien', 'auf', '.']	0.0	0.0	0.0	64.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which distinct URI's represent the films that are of type ""Film"", have ""Natalie Portman"" as an actor, and have at least one producer?"	Wer hat die Filme, in denen Natalie Portman mitspielt, produziert?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?film <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?film <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q37876> . ?film <http://www.wikidata.org/prop/direct/P162> ?uri . }	"['Which', 'distinct', 'URI', ""'s"", 'represent', 'the', 'films', 'that', 'are', 'of', 'type', '``', 'Film', ""''"", ',', 'have', '``', 'Natalie', 'Portman', ""''"", 'as', 'an', 'actor', ',', 'and', 'have', 'at', 'least', 'one', 'producer', '?']"	['Wer', 'hat', 'die', 'Filme', ',', 'in', 'denen', 'Natalie', 'Portman', 'mitspielt', ',', 'produziert', '?']	0.1367	0.5323	0.0	91.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinct URI's represent German Shepherd breeds that are subclasses of some other breeds?	Liste alle Züchtungen vom Deutschen Schäferhund auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279* wd:Q38280 FILTER(?uri != wd:Q38280) }	"['Which', 'distinct', 'URI', ""'s"", 'represent', 'German', 'Shepherd', 'breeds', 'that', 'are', 'subclasses', 'of', 'some', 'other', 'breeds', '?']"	['Liste', 'alle', 'Züchtungen', 'vom', 'Deutschen', 'Schäferhund', 'auf', '.']	0.0	0.0	0.0	77.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which sovereign state has the largest area, according to Wikidata?	Welches ist das größte Land der Welt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31>/<http://www.wikidata.org/prop/direct/P279>* <http://www.wikidata.org/entity/Q3624078> . ?uri <http://www.wikidata.org/prop/direct/P2046> ?area . } ORDER BY DESC(?area) LIMIT 1	['Which', 'sovereign', 'state', 'has', 'the', 'largest', 'area', ',', 'according', 'to', 'Wikidata', '?']	['Welches', 'ist', 'das', 'größte', 'Land', 'der', 'Welt', '?']	0.1926	0.25	0.0	46.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which city in the United States has the largest population?	Wie heißt die größte Stadt in Amerika?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P17 wd:Q30 . ?res wdt:P31/wdt:P279* wd:Q515 . ?res wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1	['Which', 'city', 'in', 'the', 'United', 'States', 'has', 'the', 'largest', 'population', '?']	['Wie', 'heißt', 'die', 'größte', 'Stadt', 'in', 'Amerika', '?']	0.2308	0.5455	0.125	42.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which public office or position had a start time and end time, and was held by a Papst (Pope), with a founding date between the start and end times, specified by the property ""Datum der Gründung, Erstellung, Entstehung, Erbauung"" (Date of foundation, creation, establishment, construction)?"	Welcher Papst hat das Vatican Television erfunden?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/>  SELECT ?res WHERE { wd:Q1471987 wdt:P571 ?founded . ?res wdt:P39 wd:Q19546 . ?res p:P39 _:a . _:a ps:P39 wd:Q19546 . _:a pq:P580 ?start . _:a pq:P582 ?end . FILTER( ?start <= ?founded && ?founded <= ?end) . }	"['Which', 'public', 'office', 'or', 'position', 'had', 'a', 'start', 'time', 'and', 'end', 'time', ',', 'and', 'was', 'held', 'by', 'a', 'Papst', '(', 'Pope', ')', ',', 'with', 'a', 'founding', 'date', 'between', 'the', 'start', 'and', 'end', 'times', ',', 'specified', 'by', 'the', 'property', '``', 'Datum', 'der', 'Gründung', ',', 'Erstellung', ',', 'Entstehung', ',', 'Erbauung', ""''"", '(', 'Date', 'of', 'foundation', ',', 'creation', ',', 'establishment', ',', 'construction', ')', '?']"	['Welcher', 'Papst', 'hat', 'das', 'Vatican', 'Television', 'erfunden', '?']	0.1817	0.0984	0.0455	250.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which distinct URI's represent the ""Land Nederland"" (Q55) where the ""Staatsoberhaupt"" (P35) holds an ""öffentliches Amt oder Stellung"" (P39) entitled ""König der Niederlande"" (Q2045066)?"	Wie heißt der König der Niederlande?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q55> <http://www.wikidata.org/prop/direct/P35> ?uri . ?uri <http://www.wikidata.org/prop/direct/P39> <http://www.wikidata.org/entity/Q2045066> . }	"['Which', 'distinct', 'URI', ""'s"", 'represent', 'the', '``', 'Land', 'Nederland', ""''"", '(', 'Q55', ')', 'where', 'the', '``', 'Staatsoberhaupt', ""''"", '(', 'P35', ')', 'holds', 'an', '``', 'öffentliches', 'Amt', 'oder', 'Stellung', ""''"", '(', 'P39', ')', 'entitled', '``', 'König', 'der', 'Niederlande', ""''"", '(', 'Q2045066', ')', '?']"	['Wie', 'heißt', 'der', 'König', 'der', 'Niederlande', '?']	0.0719	0.2679	0.0714	149.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"""Existiert ein Artikel mit der Bezeichnung 'Cola.', der unter der Unterklasse 'Getränk' befindet?"""	Ist Cola ein Getränk?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q134041 wdt:P279+ wd:Q40050 . }	"['``', 'Existiert', 'ein', 'Artikel', 'mit', 'der', 'Bezeichnung', ""'Cola"", '.', ""'"", ',', 'der', 'unter', 'der', 'Unterklasse', ""'Getränk"", ""'"", 'befindet', '?', ""''""]"	['Ist', 'Cola', 'ein', 'Getränk', '?']	0.2163	0.2322	0.125	79.0
