id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct dates when Boris Becker's tennis career ended?	Когда закончил активную карьеру Борис Беккер?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?date WHERE {  <http://www.wikidata.org/entity/Q76334> <http://www.wikidata.org/prop/P106>/<http://www.wikidata.org/prop/qualifier/P582> ?date }	"['What', 'are', 'the', 'distinct', 'dates', 'when', 'Boris', 'Becker', ""'s"", 'tennis', 'career', 'ended', '?']"	['Когда', 'закончил', 'активную', 'карьеру', 'Борис', 'Беккер', '?']	0.1911	0.216	0.0	62.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which film does Mickey Rourke have the ""in roles"" property with, and who is the director of that film, with Guy Ritchie being the identified director?"	Какой фильм с участием Микки Рурка был снят Гаем Ричи?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P161>  <http://www.wikidata.org/entity/Q178552> .  ?s1  <http://www.wikidata.org/prop/direct/P57>  <http://www.wikidata.org/entity/Q192990> . ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q11424> . }	"['Which', 'film', 'does', 'Mickey', 'Rourke', 'have', 'the', '``', 'in', 'roles', ""''"", 'property', 'with', ',', 'and', 'who', 'is', 'the', 'director', 'of', 'that', 'film', ',', 'with', 'Guy', 'Ritchie', 'being', 'the', 'identified', 'director', '?']"	['Какой', 'фильм', 'с', 'участием', 'Микки', 'Рурка', 'был', 'снят', 'Гаем', 'Ричи', '?']	0.1709	0.1116	0.0	140.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of films that have ""Film"" as a subclass of, and ""Richard Giraud Cabot Blaine"" (Richard Giri) in the roles, as well as ""Julia Fiona Roberts"" (Julia Roberts) in the roles?"	В каких фильмах сыграли Джулия Робертс и Ричард Гир?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q48410> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q40523> . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'that', 'have', '``', 'Film', ""''"", 'as', 'a', 'subclass', 'of', ',', 'and', '``', 'Richard', 'Giraud', 'Cabot', 'Blaine', ""''"", '(', 'Richard', 'Giri', ')', 'in', 'the', 'roles', ',', 'as', 'well', 'as', '``', 'Julia', 'Fiona', 'Roberts', ""''"", '(', 'Julia', 'Roberts', ')', 'in', 'the', 'roles', '?']"	['В', 'каких', 'фильмах', 'сыграли', 'Джулия', 'Робертс', 'и', 'Ричард', 'Гир', '?']	0.1587	0.0678	0.0	188.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the resources that have the property ""author"" with the value ""Эрнест Хемингуэй"" and the property ""genre"" with the value ""автобиография""?"	Покажи мне автобиографию Хемингуэйя.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q23434> . ?uri <http://www.wikidata.org/prop/direct/P136> <http://www.wikidata.org/entity/Q4184> . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'resources', 'that', 'have', 'the', 'property', '``', 'author', ""''"", 'with', 'the', 'value', '``', 'Эрнест', 'Хемингуэй', ""''"", 'and', 'the', 'property', '``', 'genre', ""''"", 'with', 'the', 'value', '``', 'автобиография', ""''"", '?']"	['Покажи', 'мне', 'автобиографию', 'Хемингуэйя', '.']	0.0	0.0	0.0	153.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""What is the height/rost of Eric Irwin?""

SELECT ?o1 {
  <http://www.wikidata.org/entity/Q4740851> <http://www.wikidata.org/prop/direct/P2048> ?o1 .
}

-- This query retrieves the height/rost (P2048) of the entity ""Eric Irwin"" (Q4740851)."	Какой рост у Амазон Ив?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?o1 { <http://www.wikidata.org/entity/Q4740851> <http://www.wikidata.org/prop/direct/P2048>  ?o1 .  }	"['``', 'What', 'is', 'the', 'height/rost', 'of', 'Eric', 'Irwin', '?', ""''"", 'SELECT', '?', 'o1', '{', '<', 'http', ':', '//www.wikidata.org/entity/Q4740851', '>', '<', 'http', ':', '//www.wikidata.org/prop/direct/P2048', '>', '?', 'o1', '.', '}', '--', 'This', 'query', 'retrieves', 'the', 'height/rost', '(', 'P2048', ')', 'of', 'the', 'entity', '``', 'Eric', 'Irwin', ""''"", '(', 'Q4740851', ')', '.']"	['Какой', 'рост', 'у', 'Амазон', 'Ив', '?']	0.1593	0.0539	0.0	233.0
392	"Имея следующий SPARQL запрос: SELECT ?o1 { <http://www.wikidata.org/entity/Q4740851> <http://www.wikidata.org/prop/direct/P2048>  ?o1 .  } 
 Где:
 http://www.wikidata.org/entity/Q4740851 именуется как ""Ирвин, Эрика.""
 http://www.wikidata.org/prop/direct/P2048 именуется как ""высота/рост.""
393	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q408804> . } 
 Где:
 http://www.wikidata.org/prop/direct/P31 именуется как ""это частный случай понятия.""
 http://www.wikidata.org/entity/Q408804 именуется как ""боро.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of the resources that are instances of the ""boro"" type (denoted as the property ""это частный случай понятия"" with the value <http://www.wikidata.org/entity/Q408804>)?"	Как называются пять районов Нью-Йорка?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q408804> . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'the', 'resources', 'that', 'are', 'instances', 'of', 'the', '``', 'boro', ""''"", 'type', '(', 'denoted', 'as', 'the', 'property', '``', 'это', 'частный', 'случай', 'понятия', ""''"", 'with', 'the', 'value', '<', 'http', ':', '//www.wikidata.org/entity/Q408804', '>', ')', '?']"	['Как', 'называются', 'пять', 'районов', 'Нью-Йорка', '?']	0.1648	0.0663	0.0	193.0
394	"Имея следующий SPARQL запрос:  SELECT ?s1 WHERE { ?s1  wdt:P136  <http://www.wikidata.org/entity/Q11365> . ?s1  wdt:P31  <http://www.wikidata.org/entity/Q18127> . ?s1  wdt:P17 <http://www.wikidata.org/entity/Q16> . } 
 Где:
 wdt:P136 именуется как ""жанр.""
 http://www.wikidata.org/entity/Q11365 именуется как ""гранж.""
 wdt:P31 именуется как ""это частный случай понятия.""
 http://www.wikidata.org/entity/Q18127 именуется как ""лейбл звукозаписи.""
 wdt:P17 именуется как ""государство.""
 http://www.wikidata.org/entity/Q16 именуется как ""Канада.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which artist belongs to the grunge genre and is from Canada?	Назови мне все канадские звукозаписывающие компании в стиле гранж.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT ?s1 WHERE { ?s1  wdt:P136  <http://www.wikidata.org/entity/Q11365> . ?s1  wdt:P31  <http://www.wikidata.org/entity/Q18127> . ?s1  wdt:P17 <http://www.wikidata.org/entity/Q16> . }	['Which', 'artist', 'belongs', 'to', 'the', 'grunge', 'genre', 'and', 'is', 'from', 'Canada', '?']	['Назови', 'мне', 'все', 'канадские', 'звукозаписывающие', 'компании', 'в', 'стиле', 'гранж', '.']	0.0	0.0	0.0	62.0
395	"Имея следующий SPARQL запрос:  SELECT ?o2 WHERE { <http://www.wikidata.org/entity/Q5089>  <http://www.wikidata.org/prop/direct/P885>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P17>  ?o2 .  }  
 Где:
 http://www.wikidata.org/entity/Q5089 именуется как ""Ганг.""
 http://www.wikidata.org/prop/direct/P885 именуется как ""исток водотока.""
 http://www.wikidata.org/prop/direct/P17 именуется как ""государство.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the country where the source of the Gang river is located?	В какой стране начинается Ганг?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT ?o2 WHERE { <http://www.wikidata.org/entity/Q5089>  <http://www.wikidata.org/prop/direct/P885>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P17>  ?o2 .  } 	['What', 'is', 'the', 'country', 'where', 'the', 'source', 'of', 'the', 'Gang', 'river', 'is', 'located', '?']	['В', 'какой', 'стране', 'начинается', 'Ганг', '?']	0.1897	0.1846	0.0	61.0
396	"Имея следующий SPARQL запрос: SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q1336200>  <http://www.wikidata.org/prop/direct/P112>  ?o1 .  } 
 Где:
 http://www.wikidata.org/entity/Q1336200 именуется как ""Penguin Books.""
 http://www.wikidata.org/prop/direct/P112 именуется как ""основатель.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the founder of Penguin Books?	Кто является основателем Penguin Books?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?o1 WHERE { <http://www.wikidata.org/entity/Q1336200>  <http://www.wikidata.org/prop/direct/P112>  ?o1 .  }	['What', 'is', 'the', 'founder', 'of', 'Penguin', 'Books', '?']	['Кто', 'является', 'основателем', 'Penguin', 'Books', '?']	0.2398	0.9694	0.3333	23.0
397	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q23572> <http://www.wikidata.org/prop/direct/P86> ?uri . } 
 Где:
 http://www.wikidata.org/entity/Q23572 именуется как ""Игра престолов.""
 http://www.wikidata.org/prop/direct/P86 именуется как ""композитор.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct Uris of composers associated with the work ""Game of Thronds"" (Q23572)?"	Кто сочинил главную музыкальную тему Игры Престолов?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q23572> <http://www.wikidata.org/prop/direct/P86> ?uri . }	"['What', 'are', 'the', 'distinct', 'Uris', 'of', 'composers', 'associated', 'with', 'the', 'work', '``', 'Game', 'of', 'Thronds', ""''"", '(', 'Q23572', ')', '?']"	['Кто', 'сочинил', 'главную', 'музыкальную', 'тему', 'Игры', 'Престолов', '?']	0.1818	0.15	0.0	85.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct Uris of composers associated with the work ""Game of Thronds"" (Q23572)?"	Кто написал музыку для Игры престолов?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q23572> <http://www.wikidata.org/prop/direct/P86> ?uri . }	"['What', 'are', 'the', 'distinct', 'Uris', 'of', 'composers', 'associated', 'with', 'the', 'work', '``', 'Game', 'of', 'Thronds', ""''"", '(', 'Q23572', ')', '?']"	['Кто', 'написал', 'музыку', 'для', 'Игры', 'престолов', '?']	0.1818	0.1404	0.0	86.0
398	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q986> <http://www.wikidata.org/prop/direct/P35> ?uri} 
 Где:
 http://www.wikidata.org/entity/Q986 именуется как ""Эритрея.""
 http://www.wikidata.org/prop/direct/P35 именуется как ""глава государства.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the entities that are the heads of state for Eritrea?	Кто президент Эритреи?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q986> <http://www.wikidata.org/prop/direct/P35> ?uri}	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'are', 'the', 'heads', 'of', 'state', 'for', 'Eritrea', '?']"	['Кто', 'президент', 'Эритреи', '?']	0.1843	0.1111	0.0	81.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct administrative units where did John F. Kennedy die?

(Note: In English, the SPARQL query would be transformed into: ""What are the distinct cities where did John F. Kennedy die?"")"	В каком городе умер Джон Кеннеди?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q9696> <http://www.wikidata.org/prop/direct/P20>/<http://www.wikidata.org/prop/direct/P131> ?uri . ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515>  .  } 	"['What', 'are', 'the', 'distinct', 'administrative', 'units', 'where', 'did', 'John', 'F.', 'Kennedy', 'die', '?', '(', 'Note', ':', 'In', 'English', ',', 'the', 'SPARQL', 'query', 'would', 'be', 'transformed', 'into', ':', '``', 'What', 'are', 'the', 'distinct', 'cities', 'where', 'did', 'John', 'F.', 'Kennedy', 'die', '?', ""''"", ')']"	['В', 'каком', 'городе', 'умер', 'Джон', 'Кеннеди', '?']	0.1629	0.0668	0.0	194.0
(Note: In English, the SPARQL query would be transformed into: ""What are the distinct cities where did John F. Kennedy die?"")"	В каком городе умер Джон Ф. Кеннеди?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q9696> <http://www.wikidata.org/prop/direct/P20>/<http://www.wikidata.org/prop/direct/P131> ?uri . ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515>  .  } 	"['What', 'are', 'the', 'distinct', 'administrative', 'units', 'where', 'did', 'John', 'F.', 'Kennedy', 'die', '?', '(', 'Note', ':', 'In', 'English', ',', 'the', 'SPARQL', 'query', 'would', 'be', 'transformed', 'into', ':', '``', 'What', 'are', 'the', 'distinct', 'cities', 'where', 'did', 'John', 'F.', 'Kennedy', 'die', '?', ""''"", ')']"	['В', 'каком', 'городе', 'умер', 'Джон', 'Ф.', 'Кеннеди', '?']	0.1629	0.0714	0.0	192.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the tallest mountain in Australia with a known height? (The answer will be a single mountain with the greatest height above sea level.)	Самая высокая гора Автралии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q8502> . ?uri <http://www.wikidata.org/prop/direct/P30> <http://www.wikidata.org/entity/Q3960> . ?uri <http://www.wikidata.org/prop/direct/P2044> ?height. } ORDER BY DESC(?height) LIMIT 1	['What', 'is', 'the', 'tallest', 'mountain', 'in', 'Australia', 'with', 'a', 'known', 'height', '?', '(', 'The', 'answer', 'will', 'be', 'a', 'single', 'mountain', 'with', 'the', 'greatest', 'height', 'above', 'sea', 'level', '.', ')']	['Самая', 'высокая', 'гора', 'Автралии', '?']	0.1726	0.0801	0.0	139.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the tallest mountain in Australia with a known height? (The answer will be a single mountain with the greatest height above sea level.)	Какая самая высокая гора в Австралии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q8502> . ?uri <http://www.wikidata.org/prop/direct/P30> <http://www.wikidata.org/entity/Q3960> . ?uri <http://www.wikidata.org/prop/direct/P2044> ?height. } ORDER BY DESC(?height) LIMIT 1	['What', 'is', 'the', 'tallest', 'mountain', 'in', 'Australia', 'with', 'a', 'known', 'height', '?', '(', 'The', 'answer', 'will', 'be', 'a', 'single', 'mountain', 'with', 'the', 'greatest', 'height', 'above', 'sea', 'level', '.', ')']	['Какая', 'самая', 'высокая', 'гора', 'в', 'Австралии', '?']	0.1726	0.0968	0.0	137.0
403	"Имея следующий SPARQL запрос: SELECT ?s1 WHERE {   ?s1  <http://www.wikidata.org/prop/direct/P27>  <http://www.wikidata.org/entity/Q34> .   ?s1  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q3546255> .  } 
 Где:
 http://www.wikidata.org/prop/direct/P27 именуется как ""гражданство.""
 http://www.wikidata.org/entity/Q34 именуется как ""Швеция.""
 http://www.wikidata.org/prop/direct/P106 именуется как ""род занятий.""
 http://www.wikidata.org/entity/Q3546255 именуется как ""океанолог.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the entities that are both citizens of Sweden and have the occupation of oceanologist?	Перечислите всех шведских океанографов?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?s1 WHERE {   ?s1  <http://www.wikidata.org/prop/direct/P27>  <http://www.wikidata.org/entity/Q34> .   ?s1  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q3546255> .  }	['What', 'are', 'the', 'entities', 'that', 'are', 'both', 'citizens', 'of', 'Sweden', 'and', 'have', 'the', 'occupation', 'of', 'oceanologist', '?']	['Перечислите', 'всех', 'шведских', 'океанографов', '?']	0.1856	0.1366	0.0	91.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of cities that are administrative units of the United Nations headquarters?

You can find these cities by looking for those that have the property <http://www.wikidata.org/prop/direct/P131><http://www.wikidata.org/entity/Q11297> (administrative units of the United Nations headquarters). Additionally, cities can also be administrative units of the United Nations headquarters if they are a subclass of <http://www.wikidata.org/entity/Q515> (city) and have the property <http://www.wikidata.org/prop/direct/P31>/<http://www.wikidata.org/prop/direct/P279><http://www.wikidata.org/entity/Q515> (city that is a subclass of ""city"")."	В каком городе находится штаб-квартира ООН?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q11297> <http://www.wikidata.org/prop/direct/P131> ?uri . { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . } UNION {?uri <http://www.wikidata.org/prop/direct/P31>/<http://www.wikidata.org/prop/direct/P279> <http://www.wikidata.org/entity/Q515> . } }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'cities', 'that', 'are', 'administrative', 'units', 'of', 'the', 'United', 'Nations', 'headquarters', '?', 'You', 'can', 'find', 'these', 'cities', 'by', 'looking', 'for', 'those', 'that', 'have', 'the', 'property', '<', 'http', ':', '//www.wikidata.org/prop/direct/P131', '>', '<', 'http', ':', '//www.wikidata.org/entity/Q11297', '>', '(', 'administrative', 'units', 'of', 'the', 'United', 'Nations', 'headquarters', ')', '.', 'Additionally', ',', 'cities', 'can', 'also', 'be', 'administrative', 'units', 'of', 'the', 'United', 'Nations', 'headquarters', 'if', 'they', 'are', 'a', 'subclass', 'of', '<', 'http', ':', '//www.wikidata.org/entity/Q515', '>', '(', 'city', ')', 'and', 'have', 'the', 'property', '<', 'http', ':', '//www.wikidata.org/prop/direct/P31', '>', '/', '<', 'http', ':', '//www.wikidata.org/prop/direct/P279', '>', '<', 'http', ':', '//www.wikidata.org/entity/Q515', '>', '(', 'city', 'that', 'is', 'a', 'subclass', 'of', '``', 'city', ""''"", ')', '.']"	['В', 'каком', 'городе', 'находится', 'штаб-квартира', 'ООН', '?']	0.1371	0.0255	0.0	650.0
405	"Имея следующий SPARQL запрос: ASK WHERE { <http://www.wikidata.org/entity/Q2263>  <http://www.wikidata.org/prop/direct/P26>  <http://www.wikidata.org/entity/Q234144> . }  
 Где:
 http://www.wikidata.org/entity/Q2263 именуется как ""Том Хэнкс.""
 http://www.wikidata.org/prop/direct/P26 именуется как ""супруг(а).""
 http://www.wikidata.org/entity/Q234144 именуется как ""Рита Уилсон.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Is Tom Hanks married to Rita Wilson?	Является ли Рита Уилсон - жена Тома Хэнкса?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q2263>  <http://www.wikidata.org/prop/direct/P26>  <http://www.wikidata.org/entity/Q234144> . } 	['Is', 'Tom', 'Hanks', 'married', 'to', 'Rita', 'Wilson', '?']	['Является', 'ли', 'Рита', 'Уилсон', '-', 'жена', 'Тома', 'Хэнкса', '?']	0.1749	0.3737	0.0	37.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Is Tom Hanks married to Rita Wilson?	Рита Вильсон является женой Тома Хэнкса?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q2263>  <http://www.wikidata.org/prop/direct/P26>  <http://www.wikidata.org/entity/Q234144> . } 	['Is', 'Tom', 'Hanks', 'married', 'to', 'Rita', 'Wilson', '?']	['Рита', 'Вильсон', 'является', 'женой', 'Тома', 'Хэнкса', '?']	0.1982	0.3509	0.0	35.0
406	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256> . ?uri <http://www.wikidata.org/prop/direct/P37> <http://www.wikidata.org/entity/Q5287> . }  
 Где:
 http://www.wikidata.org/prop/direct/P31 именуется как ""это частный случай понятия.""
 http://www.wikidata.org/entity/Q6256 именуется как ""страна.""
 http://www.wikidata.org/prop/direct/P37 именуется как ""официальный язык.""
 http://www.wikidata.org/entity/Q5287 именуется как ""японский язык.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the film with the lowest budget among those directed by Tim Burton?	Какой фильм Тима Бертона имел самый высокий бюджет	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT DISTINCT ?s1 WHERE {    ?s1  ?p1  <http://www.wikidata.org/entity/Q56008> . ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q11424> .  ?s1  <http://www.wikidata.org/prop/direct/P2769> ?o1 } order by ?o1 limit 1	['What', 'is', 'the', 'film', 'with', 'the', 'lowest', 'budget', 'among', 'those', 'directed', 'by', 'Tim', 'Burton', '?']	['Какой', 'фильм', 'Тима', 'Бертона', 'имел', 'самый', 'высокий', 'бюджет']	0.0	0.0	0.0	68.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which museum in New York has the highest annual number of visitors?	В каком музее Нью-Йорка больше всего посетителей	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P159>  <http://www.wikidata.org/entity/Q60> . ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q33506> . ?s1  <http://www.wikidata.org/prop/direct/P1174> ?o1 } order by ?o1 limit 1	['Which', 'museum', 'in', 'New', 'York', 'has', 'the', 'highest', 'annual', 'number', 'of', 'visitors', '?']	['В', 'каком', 'музее', 'Нью-Йорка', 'больше', 'всего', 'посетителей']	0.0	0.0	0.0	61.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the musical album with the earliest date of publication among those that belong to the music album category and have Queen as the performer?	Как называется первый альбом группы Queen	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q482994> . ?uri <http://www.wikidata.org/prop/direct/P175> <http://www.wikidata.org/entity/Q15862> . ?uri <http://www.wikidata.org/prop/direct/P577> ?date } ORDER BY ?date LIMIT 1	['What', 'is', 'the', 'musical', 'album', 'with', 'the', 'earliest', 'date', 'of', 'publication', 'among', 'those', 'that', 'belong', 'to', 'the', 'music', 'album', 'category', 'and', 'have', 'Queen', 'as', 'the', 'performer', '?']	['Как', 'называется', 'первый', 'альбом', 'группы', 'Queen']	0.1745	0.0957	0.0714	138.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the film that was published most recently and has Alec Guinness in the roles?	Какой был последний фильм с Алеком Гиннесом	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q11424> . ?s1  <http://www.wikidata.org/prop/direct/P161>  <http://www.wikidata.org/entity/Q103894> . ?s1 <http://www.wikidata.org/prop/direct/P577> ?o1 . }  order by DESC(?o1)  limit 1	['What', 'is', 'the', 'film', 'that', 'was', 'published', 'most', 'recently', 'and', 'has', 'Alec', 'Guinness', 'in', 'the', 'roles', '?']	['Какой', 'был', 'последний', 'фильм', 'с', 'Алеком', 'Гиннесом']	0.0	0.0	0.0	79.0
412	"Имея следующий SPARQL запрос: SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q858840>  <http://www.wikidata.org/prop/direct/P161>  ?o1 .  }  
 Где:
 http://www.wikidata.org/entity/Q858840 именуется как ""Последний киногерой.""
 http://www.wikidata.org/prop/direct/P161 именуется как ""в ролях.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""Что играет последнего киногероя по названию энтити в Wikidata <http://www.wikidata.org/entity/Q858840>?""

""Известно, что последний киногерой, именованный как энтити в Wikidata <http://www.wikidata.org/entity/Q858840>, исполняет какую роль?""

""Кто является актёром последнего киногероя по даннымwikidata <http://www.wikidata.org/entity/Q858840>?""

""По информации из Wikidata <http://www.wikidata.org/entity/Q858840}, в каком фильме появляется последний киногерой в какой роли?"""	"Перечислите всех актеров фильма ""Последний киногерой"""	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q858840>  <http://www.wikidata.org/prop/direct/P161>  ?o1 .  } 	"['``', 'Что', 'играет', 'последнего', 'киногероя', 'по', 'названию', 'энтити', 'в', 'Wikidata', '<', 'http', ':', '//www.wikidata.org/entity/Q858840', '>', '?', ""''"", '``', 'Известно', ',', 'что', 'последний', 'киногерой', ',', 'именованный', 'как', 'энтити', 'в', 'Wikidata', '<', 'http', ':', '//www.wikidata.org/entity/Q858840', '>', ',', 'исполняет', 'какую', 'роль', '?', ""''"", '``', 'Кто', 'является', 'актёром', 'последнего', 'киногероя', 'по', 'даннымwikidata', '<', 'http', ':', '//www.wikidata.org/entity/Q858840', '>', '?', ""''"", '``', 'По', 'информации', 'из', 'Wikidata', '<', 'http', ':', '//www.wikidata.org/entity/Q858840', '}', ',', 'в', 'каком', 'фильме', 'появляется', 'последний', 'киногерой', 'в', 'какой', 'роли', '?', ""''""]"	"['Перечислите', 'всех', 'актеров', 'фильма', '``', 'Последний', 'киногерой', ""''""]"	0.1929	0.1169	0.0	431.0
413	"Имея следующий SPARQL запрос: SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q339>  <http://www.wikidata.org/prop/direct/P61>  ?o1 .   ?o1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q5> .  }  
 Где:
 http://www.wikidata.org/entity/Q339 именуется как ""Плутон.""
 http://www.wikidata.org/prop/direct/P61 именуется как ""первооткрыватель или изобретатель.""
 http://www.wikidata.org/prop/direct/P31 именуется как ""это частный случай понятия.""
 http://www.wikidata.org/entity/Q5 именуется как ""человек.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which object is the discoverer or inventor of Planet Pluto?	Кто открыл Плутон	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q339>  <http://www.wikidata.org/prop/direct/P61>  ?o1 .   ?o1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q5> .  } 	['Which', 'object', 'is', 'the', 'discoverer', 'or', 'inventor', 'of', 'Planet', 'Pluto', '?']	['Кто', 'открыл', 'Плутон']	0.0	0.0	0.0	57.0
