id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
67	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q243 wdt:P84 ?x . ?x wdt:P69 ?uri } 
 Где:
 wd:Q243 именуется как ""Эйфелева башня.""
 wdt:P84 именуется как ""архитектор.""
 wdt:P69 именуется как ""учебное заведение.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the educational institutions that were designed by the architect of the Eiffel Tower?	Где учился архитектор Эйфелевой башни?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q243 wdt:P84 ?x . ?x wdt:P69 ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'educational', 'institutions', 'that', 'were', 'designed', 'by', 'the', 'architect', 'of', 'the', 'Eiffel', 'Tower', '?']"	['Где', 'учился', 'архитектор', 'Эйфелевой', 'башни', '?']	0.1807	0.1231	0.0	111.0
68	"Имея следующий SPARQL запрос: PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q9259 ; wdt:P575 ?date . BIND(xsd:integer(YEAR(?date)) as ?year) . BIND(xsd:integer(YEAR(NOW())) as ?currentYear) . FILTER(?year < ?currentYear && ?year < (?currentYear - 2)) . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q9259 именуется как ""всемирное наследие.""
 wdt:P575 именуется как ""дата открытия.""
 xsd:integer именуется как ""integer.""
 xsd:integer именуется как ""integer.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI references of entities classified as ""world heritage"" and have an known opening date, where the year of the opening is less than the current year and less than two years before the current year?"	Назовите все объекты всемирного наследия, назначенные в течение последних двух лет?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q9259 ; wdt:P575 ?date . BIND(xsd:integer(YEAR(?date)) as ?year) . BIND(xsd:integer(YEAR(NOW())) as ?currentYear) . FILTER(?year < ?currentYear && ?year < (?currentYear - 2)) . }	"['What', 'are', 'the', 'URI', 'references', 'of', 'entities', 'classified', 'as', '``', 'world', 'heritage', ""''"", 'and', 'have', 'an', 'known', 'opening', 'date', ',', 'where', 'the', 'year', 'of', 'the', 'opening', 'is', 'less', 'than', 'the', 'current', 'year', 'and', 'less', 'than', 'two', 'years', 'before', 'the', 'current', 'year', '?']"	['Назовите', 'все', 'объекты', 'всемирного', 'наследия', ',', 'назначенные', 'в', 'течение', 'последних', 'двух', 'лет', '?']	0.1937	0.1762	0.0	199.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI references of entities classified as ""world heritage"" and have an known opening date, where the year of the opening is less than the current year and less than two years before the current year?"	Перечислите все объекты всемироного наследия признанные за прошедшие два года?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q9259 ; wdt:P575 ?date . BIND(xsd:integer(YEAR(?date)) as ?year) . BIND(xsd:integer(YEAR(NOW())) as ?currentYear) . FILTER(?year < ?currentYear && ?year < (?currentYear - 2)) . }	"['What', 'are', 'the', 'URI', 'references', 'of', 'entities', 'classified', 'as', '``', 'world', 'heritage', ""''"", 'and', 'have', 'an', 'known', 'opening', 'date', ',', 'where', 'the', 'year', 'of', 'the', 'opening', 'is', 'less', 'than', 'the', 'current', 'year', 'and', 'less', 'than', 'two', 'years', 'before', 'the', 'current', 'year', '?']"	['Перечислите', 'все', 'объекты', 'всемироного', 'наследия', 'признанные', 'за', 'прошедшие', 'два', 'года', '?']	0.1629	0.0824	0.0	201.0
69	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 ; wdt:P19 wd:Q90 ; wdt:P569 ?birthDate . BIND(YEAR(?birthDate) as ?birthYear) . FILTER(?birthYear > 1950) } 
 Где:
 wdt:P106 именуется как ""род занятий.""
 wd:Q33999 именуется как ""актёр.""
 wdt:P19 именуется как ""место рождения.""
 wd:Q90 именуется как ""Париж.""
 wdt:P569 именуется как ""дата рождения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI's of actors born after 1950 and having the occupation ""актёр"" with a birthplace ""Париж"" and a known birth year?"	Назовите всех актеров, которые родились в Париже после 1950 года.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 ; wdt:P19 wd:Q90 ; wdt:P569 ?birthDate . BIND(YEAR(?birthDate) as ?birthYear) . FILTER(?birthYear > 1950) }	"['What', 'are', 'the', 'URI', ""'s"", 'of', 'actors', 'born', 'after', '1950', 'and', 'having', 'the', 'occupation', '``', 'актёр', ""''"", 'with', 'a', 'birthplace', '``', 'Париж', ""''"", 'and', 'a', 'known', 'birth', 'year', '?']"	['Назовите', 'всех', 'актеров', ',', 'которые', 'родились', 'в', 'Париже', 'после', '1950', 'года', '.']	0.1726	0.1236	0.0667	113.0
70	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q34851> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q151973> . } 
 Где:
 http://www.wikidata.org/prop/direct/P161 именуется как ""в ролях.""
 http://www.wikidata.org/entity/Q34851 именуется как ""Элизабет Тейлор.""
 http://www.wikidata.org/prop/direct/P161 именуется как ""в ролях.""
 http://www.wikidata.org/entity/Q151973 именуется как ""Ричард Бёртон.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which URI's have the property ""in roles"" with the value ""Elizabeth Taylor"" and also have the property ""in roles"" with the value ""Richard Burton""?"	В каких фильмах снимались вместе Лиз Тейлор и Ричард Бертон?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q34851> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q151973> . }	"['Which', 'URI', ""'s"", 'have', 'the', 'property', '``', 'in', 'roles', ""''"", 'with', 'the', 'value', '``', 'Elizabeth', 'Taylor', ""''"", 'and', 'also', 'have', 'the', 'property', '``', 'in', 'roles', ""''"", 'with', 'the', 'value', '``', 'Richard', 'Burton', ""''"", '?']"	['В', 'каких', 'фильмах', 'снимались', 'вместе', 'Лиз', 'Тейлор', 'и', 'Ричард', 'Бертон', '?']	0.1685	0.1017	0.0	135.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which URI's have the property ""in roles"" with the value ""Elizabeth Taylor"" and also have the property ""in roles"" with the value ""Richard Burton""?"	В каких фильмах снимались Лиза Тейлор и Ричард Бертон?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q34851> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q151973> . }	"['Which', 'URI', ""'s"", 'have', 'the', 'property', '``', 'in', 'roles', ""''"", 'with', 'the', 'value', '``', 'Elizabeth', 'Taylor', ""''"", 'and', 'also', 'have', 'the', 'property', '``', 'in', 'roles', ""''"", 'with', 'the', 'value', '``', 'Richard', 'Burton', ""''"", '?']"	['В', 'каких', 'фильмах', 'снимались', 'Лиза', 'Тейлор', 'и', 'Ричард', 'Бертон', '?']	0.1685	0.0977	0.0	136.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which URI's have the property ""in roles"" with the value ""Elizabeth Taylor"" and also have the property ""in roles"" with the value ""Richard Burton""?"	В каких фильмах вместе снимались Лиз Тейлор и Ричард Бёртон?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q34851> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q151973> . }	"['Which', 'URI', ""'s"", 'have', 'the', 'property', '``', 'in', 'roles', ""''"", 'with', 'the', 'value', '``', 'Elizabeth', 'Taylor', ""''"", 'and', 'also', 'have', 'the', 'property', '``', 'in', 'roles', ""''"", 'with', 'the', 'value', '``', 'Richard', 'Burton', ""''"", '?']"	['В', 'каких', 'фильмах', 'вместе', 'снимались', 'Лиз', 'Тейлор', 'и', 'Ричард', 'Бёртон', '?']	0.1685	0.1017	0.0	135.0
71	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q163740 . { ?uri wdt:P159|wdt:P17 wd:Q408 . } UNION { ?uri wdt:P159|wdt:P17 ?city . ?city wdt:P159 wd:Q408 } } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q163740 именуется как ""некоммерческая организация.""
 wdt:P159 именуется как ""расположение штаб-квартиры.""
 wdt:P17 именуется как ""государство.""
 wd:Q408 именуется как ""Австралия.""
 wdt:P159 именуется как ""расположение штаб-квартиры.""
 wdt:P17 именуется как ""государство.""
 wdt:P159 именуется как ""расположение штаб-квартиры.""
 wd:Q408 именуется как ""Австралия.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of non-profit organizations that have their headquarters located in a city in Australia, or have their headquarters directly in Australia?	Назовите все некоммерческие организации Австралии.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q163740 . { ?uri wdt:P159|wdt:P17 wd:Q408 . } UNION { ?uri wdt:P159|wdt:P17 ?city . ?city wdt:P159 wd:Q408 } }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'non-profit', 'organizations', 'that', 'have', 'their', 'headquarters', 'located', 'in', 'a', 'city', 'in', 'Australia', ',', 'or', 'have', 'their', 'headquarters', 'directly', 'in', 'Australia', '?']"	['Назовите', 'все', 'некоммерческие', 'организации', 'Австралии', '.']	0.0	0.0	0.0	162.0
What position was ""Иоанн Павел II"" replaced by?"	Какой папа стал преемником Иоанна Павла II?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q989> <http://www.wikidata.org/prop/P39> ?position . ?position <http://www.wikidata.org/prop/statement/P39> <http://www.wikidata.org/entity/Q19546> . ?position <http://www.wikidata.org/prop/qualifier/P1366> ?uri } 	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'held', 'the', 'position', '``', 'Papa', 'Rimsoy', '(', 'Pope', 'Roman', ')', ""''"", ':', '<', 'br', '>', '?', 'position', 'was', 'the', 'position', '``', 'занимаемая', 'должность', ""''"", 'for', '``', 'Иоанн', 'Павел', 'II', ""''"", '.', '<', 'br', '>', 'What', 'position', 'was', '``', 'Иоанн', 'Павел', 'II', ""''"", 'replaced', 'by', '?']"	['Какой', 'папа', 'стал', 'преемником', 'Иоанна', 'Павла', 'II', '?']	0.1856	0.1111	0.0	200.0
What position was ""Иоанн Павел II"" replaced by?"	Кто сменил папу Иоанна Павла II?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q989> <http://www.wikidata.org/prop/P39> ?position . ?position <http://www.wikidata.org/prop/statement/P39> <http://www.wikidata.org/entity/Q19546> . ?position <http://www.wikidata.org/prop/qualifier/P1366> ?uri } 	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'held', 'the', 'position', '``', 'Papa', 'Rimsoy', '(', 'Pope', 'Roman', ')', ""''"", ':', '<', 'br', '>', '?', 'position', 'was', 'the', 'position', '``', 'занимаемая', 'должность', ""''"", 'for', '``', 'Иоанн', 'Павел', 'II', ""''"", '.', '<', 'br', '>', 'What', 'position', 'was', '``', 'Иоанн', 'Павел', 'II', ""''"", 'replaced', 'by', '?']"	['Кто', 'сменил', 'папу', 'Иоанна', 'Павла', 'II', '?']	0.1856	0.104	0.0	203.0
What position was ""Иоанн Павел II"" replaced by?"	Какой папа стал преемником Иоанна Павла Второго?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q989> <http://www.wikidata.org/prop/P39> ?position . ?position <http://www.wikidata.org/prop/statement/P39> <http://www.wikidata.org/entity/Q19546> . ?position <http://www.wikidata.org/prop/qualifier/P1366> ?uri } 	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'held', 'the', 'position', '``', 'Papa', 'Rimsoy', '(', 'Pope', 'Roman', ')', ""''"", ':', '<', 'br', '>', '?', 'position', 'was', 'the', 'position', '``', 'занимаемая', 'должность', ""''"", 'for', '``', 'Иоанн', 'Павел', 'II', ""''"", '.', '<', 'br', '>', 'What', 'position', 'was', '``', 'Иоанн', 'Павел', 'II', ""''"", 'replaced', 'by', '?']"	['Какой', 'папа', 'стал', 'преемником', 'Иоанна', 'Павла', 'Второго', '?']	0.1561	0.0556	0.0	201.0
74	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P39 wd:Q473984 . ?uri p:P39 ?statement . ?statement pq:P580 ?startDate ; pq:P582 ?endDate . FILTER(YEAR(?startDate) <= 1978 && YEAR(?endDate) >= 1978) . } 
 Где:
 wdt:P39 именуется как ""занимаемая должность.""
 wd:Q473984 именуется как ""президент Пакистана.""
 p:P39 именуется как ""занимаемая должность.""
 pq:P580 именуется как ""дата начала.""
 pq:P582 именуется как ""дата окончания.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI's of entities that have been the ""president of Pakistan"" between the years 1978 and 1978? (Note: The year ranges may be incorrect as per the original SPARQL query.)"	Кто был президентом Пакистана в 1978?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P39 wd:Q473984 . ?uri p:P39 ?statement . ?statement pq:P580 ?startDate ; pq:P582 ?endDate . FILTER(YEAR(?startDate) <= 1978 && YEAR(?endDate) >= 1978) . }	"['What', 'are', 'the', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'been', 'the', '``', 'president', 'of', 'Pakistan', ""''"", 'between', 'the', 'years', '1978', 'and', '1978', '?', '(', 'Note', ':', 'The', 'year', 'ranges', 'may', 'be', 'incorrect', 'as', 'per', 'the', 'original', 'SPARQL', 'query', '.', ')']"	['Кто', 'был', 'президентом', 'Пакистана', 'в', '1978', '?']	0.0968	0.1404	0.0571	171.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's representing the entities that are named ""Rolls-Royce"" and have the property ""is owned by"" set in the dataset?"	Кто владедец Rolls-Royce?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q243278> <http://www.wikidata.org/prop/direct/P127> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'representing', 'the', 'entities', 'that', 'are', 'named', '``', 'Rolls-Royce', ""''"", 'and', 'have', 'the', 'property', '``', 'is', 'owned', 'by', ""''"", 'set', 'in', 'the', 'dataset', '?']"	['Кто', 'владедец', 'Rolls-Royce', '?']	0.2053	0.1379	0.0	124.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's representing the entities that are named ""Rolls-Royce"" and have the property ""is owned by"" set in the dataset?"	Кто является владельцем Роллс-Ройс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q243278> <http://www.wikidata.org/prop/direct/P127> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'representing', 'the', 'entities', 'that', 'are', 'named', '``', 'Rolls-Royce', ""''"", 'and', 'have', 'the', 'property', '``', 'is', 'owned', 'by', ""''"", 'set', 'in', 'the', 'dataset', '?']"	['Кто', 'является', 'владельцем', 'Роллс-Ройс', '?']	0.1726	0.0801	0.0	133.0
76	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q33506 ; wdt:P131 wd:Q90 . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q33506 именуется как ""музей.""
 wdt:P131 именуется как ""административно-территориальная единица.""
 wd:Q90 именуется как ""Париж.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of the museums that are located in Paris and are subclasses of the concept ""administrative-territorial unit"" (i.e., cities or districts)?"	Сколько музеев в Париже?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q33506 ; wdt:P131 wd:Q90 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'the', 'museums', 'that', 'are', 'located', 'in', 'Paris', 'and', 'are', 'subclasses', 'of', 'the', 'concept', '``', 'administrative-territorial', 'unit', ""''"", '(', 'i.e.', ',', 'cities', 'or', 'districts', ')', '?']"	['Сколько', 'музеев', 'в', 'Париже', '?']	0.1701	0.0726	0.0	171.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of the museums that are located in Paris and are subclasses of the concept ""administrative-territorial unit"" (i.e., cities or districts)?"	Сколько в Париже музеев?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q33506 ; wdt:P131 wd:Q90 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'the', 'museums', 'that', 'are', 'located', 'in', 'Paris', 'and', 'are', 'subclasses', 'of', 'the', 'concept', '``', 'administrative-territorial', 'unit', ""''"", '(', 'i.e.', ',', 'cities', 'or', 'districts', ')', '?']"	['Сколько', 'в', 'Париже', 'музеев', '?']	0.1701	0.0726	0.0	171.0
77	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q9696 wdt:P20 ?uri . } 
 Где:
 wd:Q9696 именуется как ""Джон Фицджеральд Кеннеди.""
 wdt:P20 именуется как ""место смерти.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the places where ""John F. Kennedy"" (wd:Q9696) passed away?"	Где был убит Джон Кеннеди?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q9696 wdt:P20 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'places', 'where', '``', 'John', 'F.', 'Kennedy', ""''"", '(', 'wd', ':', 'Q9696', ')', 'passed', 'away', '?']"	['Где', 'был', 'убит', 'Джон', 'Кеннеди', '?']	0.1785	0.1124	0.0	84.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the places where ""John F. Kennedy"" (wd:Q9696) passed away?"	Где был убит Джон Фицджеральд Кеннеди?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q9696 wdt:P20 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'places', 'where', '``', 'John', 'F.', 'Kennedy', ""''"", '(', 'wd', ':', 'Q9696', ')', 'passed', 'away', '?']"	['Где', 'был', 'убит', 'Джон', 'Фицджеральд', 'Кеннеди', '?']	0.1785	0.1221	0.0	83.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which URI's represent the ""occupied position"" of the ""federal chancellor of Germany""?"	Перечислите всех канцлеров Германии.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P39> <http://www.wikidata.org/entity/Q4970706> . } 	"['Which', 'URI', ""'s"", 'represent', 'the', '``', 'occupied', 'position', ""''"", 'of', 'the', '``', 'federal', 'chancellor', 'of', 'Germany', ""''"", '?']"	['Перечислите', 'всех', 'канцлеров', 'Германии', '.']	0.0	0.0	0.0	82.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which URI's represent the ""occupied position"" of the ""federal chancellor of Germany""?"	Назовите федеральных канцлеров Германии.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P39> <http://www.wikidata.org/entity/Q4970706> . } 	"['Which', 'URI', ""'s"", 'represent', 'the', '``', 'occupied', 'position', ""''"", 'of', 'the', '``', 'federal', 'chancellor', 'of', 'Germany', ""''"", '?']"	['Назовите', 'федеральных', 'канцлеров', 'Германии', '.']	0.0	0.0	0.0	82.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which URI's represent the ""occupied position"" of the ""federal chancellor of Germany""?"	Выдай мне всех федеральных канцлеров Германии.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P39> <http://www.wikidata.org/entity/Q4970706> . } 	"['Which', 'URI', ""'s"", 'represent', 'the', '``', 'occupied', 'position', ""''"", 'of', 'the', '``', 'federal', 'chancellor', 'of', 'Germany', ""''"", '?']"	['Выдай', 'мне', 'всех', 'федеральных', 'канцлеров', 'Германии', '.']	0.0	0.0	0.0	80.0
80	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { VALUES ?beerType { wd:Q44 wd:Q15075508 } ?uri wdt:P31 ?beerType ; wdt:P17 wd:Q27 . } 
 Где:
 wd:Q44 именуется как ""пиво.""
 wd:Q15075508 именуется как ""пивной бренд.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P17 именуется как ""государство.""
 wd:Q27 именуется как ""Ирландия.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI's of beer brands that are of type ""пиво"" (pid.44) and belong to the state ""Ирландия"" (pid.Q27)?"	Какое пиво было создано в Ирландии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { VALUES ?beerType { wd:Q44 wd:Q15075508 } ?uri wdt:P31 ?beerType ; wdt:P17 wd:Q27 . }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'beer', 'brands', 'that', 'are', 'of', 'type', '``', 'пиво', ""''"", '(', 'pid.44', ')', 'and', 'belong', 'to', 'the', 'state', '``', 'Ирландия', ""''"", '(', 'pid.Q27', ')', '?']"	['Какое', 'пиво', 'было', 'создано', 'в', 'Ирландии', '?']	0.2032	0.1811	0.0	107.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI's of beer brands that are of type ""пиво"" (pid.44) and belong to the state ""Ирландия"" (pid.Q27)?"	Какая марка пива была создана в Ирландии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { VALUES ?beerType { wd:Q44 wd:Q15075508 } ?uri wdt:P31 ?beerType ; wdt:P17 wd:Q27 . }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'beer', 'brands', 'that', 'are', 'of', 'type', '``', 'пиво', ""''"", '(', 'pid.44', ')', 'and', 'belong', 'to', 'the', 'state', '``', 'Ирландия', ""''"", '(', 'pid.Q27', ')', '?']"	['Какая', 'марка', 'пива', 'была', 'создана', 'в', 'Ирландии', '?']	0.1709	0.0968	0.0	107.0
81	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q5451 wdt:P17 ?uri . } 
 Где:
 wd:Q5451 именуется как ""Гималаи.""
 wdt:P17 именуется как ""государство.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct countries associated with the entity ""Гималаи"" (Q5451) according to Wikidata?"	По каким странам протянулась горная система Гималаев?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q5451 wdt:P17 ?uri . }	"['What', 'are', 'the', 'distinct', 'countries', 'associated', 'with', 'the', 'entity', '``', 'Гималаи', ""''"", '(', 'Q5451', ')', 'according', 'to', 'Wikidata', '?']"	['По', 'каким', 'странам', 'протянулась', 'горная', 'система', 'Гималаев', '?']	0.1831	0.1579	0.0	87.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct countries associated with the entity ""Гималаи"" (Q5451) according to Wikidata?"	Через какие страны проходят Гималаи?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q5451 wdt:P17 ?uri . }	"['What', 'are', 'the', 'distinct', 'countries', 'associated', 'with', 'the', 'entity', '``', 'Гималаи', ""''"", '(', 'Q5451', ')', 'according', 'to', 'Wikidata', '?']"	['Через', 'какие', 'страны', 'проходят', 'Гималаи', '?']	0.2177	0.2721	0.0	87.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers for things that have the occupation ""киноактёр"" and were born in ""Германия"" or have ""Германия"" as their country of birth, considering that these two conditions might be connected in different ways?

Transformed question in natural language: Which URIs represent individuals who are film actors and/or have Germany as either their birthplace or their country of origin?"	Какие актеры родились в Германии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q10800557> . { ?uri <http://www.wikidata.org/prop/direct/P19> <http://www.wikidata.org/entity/Q183> . } UNION { ?uri <http://www.wikidata.org/prop/direct/P19>/<http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q183> . } }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'for', 'things', 'that', 'have', 'the', 'occupation', '``', 'киноактёр', ""''"", 'and', 'were', 'born', 'in', '``', 'Германия', ""''"", 'or', 'have', '``', 'Германия', ""''"", 'as', 'their', 'country', 'of', 'birth', ',', 'considering', 'that', 'these', 'two', 'conditions', 'might', 'be', 'connected', 'in', 'different', 'ways', '?', 'Transformed', 'question', 'in', 'natural', 'language', ':', 'Which', 'URIs', 'represent', 'individuals', 'who', 'are', 'film', 'actors', 'and/or', 'have', 'Germany', 'as', 'either', 'their', 'birthplace', 'or', 'their', 'country', 'of', 'origin', '?']"	['Какие', 'актеры', 'родились', 'в', 'Германии', '?']	0.1484	0.0359	0.0	387.0
Transformed question in natural language: Which URIs represent individuals who are film actors and/or have Germany as either their birthplace or their country of origin?"	Кто из актеров родился в Германии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q10800557> . { ?uri <http://www.wikidata.org/prop/direct/P19> <http://www.wikidata.org/entity/Q183> . } UNION { ?uri <http://www.wikidata.org/prop/direct/P19>/<http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q183> . } }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'for', 'things', 'that', 'have', 'the', 'occupation', '``', 'киноактёр', ""''"", 'and', 'were', 'born', 'in', '``', 'Германия', ""''"", 'or', 'have', '``', 'Германия', ""''"", 'as', 'their', 'country', 'of', 'birth', ',', 'considering', 'that', 'these', 'two', 'conditions', 'might', 'be', 'connected', 'in', 'different', 'ways', '?', 'Transformed', 'question', 'in', 'natural', 'language', ':', 'Which', 'URIs', 'represent', 'individuals', 'who', 'are', 'film', 'actors', 'and/or', 'have', 'Germany', 'as', 'either', 'their', 'birthplace', 'or', 'their', 'country', 'of', 'origin', '?']"	['Кто', 'из', 'актеров', 'родился', 'в', 'Германии', '?']	0.1484	0.039	0.0	387.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which URI represents the film with the most number of producers, among all films that are subtypes of ""film"" (movies)?"	Кто спродюсировал больше всего фильмов?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?film <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?film <http://www.wikidata.org/prop/direct/P162> ?uri . } GROUP BY ?uri ORDER BY DESC(COUNT(?film)) LIMIT 1	"['Which', 'URI', 'represents', 'the', 'film', 'with', 'the', 'most', 'number', 'of', 'producers', ',', 'among', 'all', 'films', 'that', 'are', 'subtypes', 'of', '``', 'film', ""''"", '(', 'movies', ')', '?']"	['Кто', 'спродюсировал', 'больше', 'всего', 'фильмов', '?']	0.1754	0.0994	0.0	113.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which URI represents the film with the most number of producers, among all films that are subtypes of ""film"" (movies)?"	Кто спродюссировал наибольшее количество фильмов?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?film <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?film <http://www.wikidata.org/prop/direct/P162> ?uri . } GROUP BY ?uri ORDER BY DESC(COUNT(?film)) LIMIT 1	"['Which', 'URI', 'represents', 'the', 'film', 'with', 'the', 'most', 'number', 'of', 'producers', ',', 'among', 'all', 'films', 'that', 'are', 'subtypes', 'of', '``', 'film', ""''"", '(', 'movies', ')', '?']"	['Кто', 'спродюссировал', 'наибольшее', 'количество', 'фильмов', '?']	0.1754	0.0994	0.0	113.0
85	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q95 wdt:P1128 ?uri . } 
 Где:
 wd:Q95 именуется как ""Google.""
 wdt:P1128 именуется как ""число сотрудников.""
