id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI entities that represent instances of the concept ""game on a special board"" as their top-level class?"	Перечислите все игры GMT.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q131436 . }	"['What', 'are', 'the', 'URI', 'entities', 'that', 'represent', 'instances', 'of', 'the', 'concept', '``', 'game', 'on', 'a', 'special', 'board', ""''"", 'as', 'their', 'top-level', 'class', '?']"	['Перечислите', 'все', 'игры', 'GMT', '.']	0.0	0.0	0.0	114.0
2	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q40984 wdt:P178 ?uri . } 
 Где:
 wd:Q40984 именуется как ""Skype.""
 wdt:P178 именуется как ""разработчик.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the developer ofSkype?
 queries for entities and properties with their URI prefixes:

wd: ""Skype"" , wdt: ""P178""

You are asking for any URI that has the property ""developer"" with the value ""Skype"". The SPARQL query will return those URIs."	Кто разработал скайп	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q40984 wdt:P178 ?uri . }	"['What', 'is', 'the', 'developer', 'ofSkype', '?', 'queries', 'for', 'entities', 'and', 'properties', 'with', 'their', 'URI', 'prefixes', ':', 'wd', ':', '``', 'Skype', ""''"", ',', 'wdt', ':', '``', 'P178', ""''"", 'You', 'are', 'asking', 'for', 'any', 'URI', 'that', 'has', 'the', 'property', '``', 'developer', ""''"", 'with', 'the', 'value', '``', 'Skype', ""''"", '.', 'The', 'SPARQL', 'query', 'will', 'return', 'those', 'URIs', '.']"	['Кто', 'разработал', 'скайп']	0.0	0.0	0.0	244.0
3	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P19 wd:Q160544 . } 
 Где:
 wdt:P19 именуется как ""место рождения.""
 wd:Q160544 именуется как ""Ираклион.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI identifiers of the entities that have the property ""place of birth"" with value ""Iраклион"" (Q160544)?"	Кто родился в Ираклионе	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P19 wd:Q160544 . }	"['What', 'are', 'the', 'URI', 'identifiers', 'of', 'the', 'entities', 'that', 'have', 'the', 'property', '``', 'place', 'of', 'birth', ""''"", 'with', 'value', '``', 'Iраклион', ""''"", '(', 'Q160544', ')', '?']"	['Кто', 'родился', 'в', 'Ираклионе']	0.0	0.0	0.0	107.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI identifiers of the entities that have the property ""place of birth"" with value ""Iраклион"" (Q160544)?"	Кто был рожден в Гераклионе?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P19 wd:Q160544 . }	"['What', 'are', 'the', 'URI', 'identifiers', 'of', 'the', 'entities', 'that', 'have', 'the', 'property', '``', 'place', 'of', 'birth', ""''"", 'with', 'value', '``', 'Iраклион', ""''"", '(', 'Q160544', ')', '?']"	['Кто', 'был', 'рожден', 'в', 'Гераклионе', '?']	0.1754	0.0994	0.0	105.0
4	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q177397 wdt:P131 ?obj . ?obj wdt:P131 ?uri . } 
 Где:
 wd:Q177397 именуется как ""Зона 51.""
 wdt:P131 именуется как ""административно-территориальная единица.""
 wdt:P131 именуется как ""административно-территориальная единица.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct administrative-territorial units that fall under the administrative-territorial unit ""Zone 51""?"	"В каком штате США находится военная база ""Зона 51"""	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q177397 wdt:P131 ?obj . ?obj wdt:P131 ?uri . }	"['What', 'are', 'the', 'distinct', 'administrative-territorial', 'units', 'that', 'fall', 'under', 'the', 'administrative-territorial', 'unit', '``', 'Zone', '51', ""''"", '?']"	"['В', 'каком', 'штате', 'США', 'находится', 'военная', 'база', '``', 'Зона', '51', ""''""]"	0.1575	0.6105	0.0	105.0
5	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q60 wdt:P6 ?uri . } 
 Где:
 wd:Q60 именуется как ""Нью-Йорк.""
 wdt:P6 именуется как ""глава правительства.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of entities that have been the head of government for New York?	Кто является мэром Нью-Йорка	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q60 wdt:P6 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'been', 'the', 'head', 'of', 'government', 'for', 'New', 'York', '?']"	['Кто', 'является', 'мэром', 'Нью-Йорка']	0.0	0.0	0.0	88.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinctive URI's of the places where Abraham Lincoln passed away?	Где умер Авраам Линкольн	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q91 wdt:P20 ?uri } 	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'the', 'places', 'where', 'Abraham', 'Lincoln', 'passed', 'away', '?']"	['Где', 'умер', 'Авраам', 'Линкольн']	0.0	0.0	0.0	76.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinctive URI's of the places where Abraham Lincoln passed away?	Где умер Абрахам Линкольн?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q91 wdt:P20 ?uri } 	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'the', 'places', 'where', 'Abraham', 'Lincoln', 'passed', 'away', '?']"	['Где', 'умер', 'Абрахам', 'Линкольн', '?']	0.1883	0.1548	0.0	75.0
8	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q51747 wdt:P113 ?uri . } 
 Где:
 wd:Q51747 именуется как ""Air China.""
 wdt:P113 именуется как ""узловой аэропорт.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct airports that serve as hubs for Air China?	Какие аэропорты обслуживает авиакомпания Air China	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q51747 wdt:P113 ?uri . }	['What', 'are', 'the', 'distinct', 'airports', 'that', 'serve', 'as', 'hubs', 'for', 'Air', 'China', '?']	['Какие', 'аэропорты', 'обслуживает', 'авиакомпания', 'Air', 'China']	0.16	0.3977	0.1111	51.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct airports that serve as hubs for Air China?	Какие аэропорты обслуживает Эир Чайна?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q51747 wdt:P113 ?uri . }	['What', 'are', 'the', 'distinct', 'airports', 'that', 'serve', 'as', 'hubs', 'for', 'Air', 'China', '?']	['Какие', 'аэропорты', 'обслуживает', 'Эир', 'Чайна', '?']	0.1911	0.1988	0.0	59.0
9	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?film wdt:P57 wd:Q16297 ; wdt:P161 wd:Q16297   . ?film wdt:P161 ?uri . } 
 Где:
 wdt:P57 именуется как ""режиссёр.""
 wd:Q16297 именуется как ""Шетнер, Уильям.""
 wdt:P161 именуется как ""в ролях.""
 wd:Q16297 именуется как ""Шетнер, Уильям.""
 wdt:P161 именуется как ""в ролях.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of films where William Shatner, identified by Wikidata as Q16297, is both the director (Property P57) and has a role (Property P161)?	Какие актеры снимались в фильмах, где режиссером и актером был Уильям Шетнер	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?film wdt:P57 wd:Q16297 ; wdt:P161 wd:Q16297   . ?film wdt:P161 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'where', 'William', 'Shatner', ',', 'identified', 'by', 'Wikidata', 'as', 'Q16297', ',', 'is', 'both', 'the', 'director', '(', 'Property', 'P57', ')', 'and', 'has', 'a', 'role', '(', 'Property', 'P161', ')', '?']"	['Какие', 'актеры', 'снимались', 'в', 'фильмах', ',', 'где', 'режиссером', 'и', 'актером', 'был', 'Уильям', 'Шетнер']	0.1677	0.1057	0.0	149.0
10	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q928 wdt:P37 ?uri . } 
 Где:
 wd:Q928 именуется как ""Филиппины.""
 wdt:P37 именуется как ""официальный язык.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that have the property ""official language"" with respect to the entity named ""Philippines"" (wd:Q928)?"	Какие официальные языки Филиппин	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q928 wdt:P37 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'official', 'language', ""''"", 'with', 'respect', 'to', 'the', 'entity', 'named', '``', 'Philippines', ""''"", '(', 'wd', ':', 'Q928', ')', '?']"	['Какие', 'официальные', 'языки', 'Филиппин']	0.0	0.0	0.0	137.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that have the property ""official language"" with respect to the entity named ""Philippines"" (wd:Q928)?"	Какие языки являются официальными на Филиппинах?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q928 wdt:P37 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'official', 'language', ""''"", 'with', 'respect', 'to', 'the', 'entity', 'named', '``', 'Philippines', ""''"", '(', 'wd', ':', 'Q928', ')', '?']"	['Какие', 'языки', 'являются', 'официальными', 'на', 'Филиппинах', '?']	0.1709	0.0906	0.0	134.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI identifiers of the films that are subclasses of a film and have a Danish origin?	Назовите все датские фильмы	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q11424 . ?uri wdt:P31 ?type ; wdt:P495 wd:Q35 . }	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'the', 'films', 'that', 'are', 'subclasses', 'of', 'a', 'film', 'and', 'have', 'a', 'Danish', 'origin', '?']	['Назовите', 'все', 'датские', 'фильмы']	0.0	0.0	0.0	103.0
12	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q11424 . ?uri wdt:P31 ?type ; wdt:P161 wd:Q35332 ; wdt:P57 wd:Q192990 . } 
 Где:
 wdt:P279 именуется как ""подкласс от.""
 wd:Q11424 именуется как ""фильм.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P161 именуется как ""в ролях.""
 wd:Q35332 именуется как ""Брэд Питт.""
 wdt:P57 именуется как ""режиссёр.""
 wd:Q192990 именуется как ""Гай Ричи.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of films where a type is a subclass of ""film"" and has the property ""this is an instance of"" a specific type, has the property ""in roles"" an actor named ""Brad Pitt"" and has the property ""regisseur"" a person named ""Guy Richie""?"	Какие фильмы с Брэдом Питтом в главной роли были сняти режиссером Гаем Ричи?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q11424 . ?uri wdt:P31 ?type ; wdt:P161 wd:Q35332 ; wdt:P57 wd:Q192990 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'where', 'a', 'type', 'is', 'a', 'subclass', 'of', '``', 'film', ""''"", 'and', 'has', 'the', 'property', '``', 'this', 'is', 'an', 'instance', 'of', ""''"", 'a', 'specific', 'type', ',', 'has', 'the', 'property', '``', 'in', 'roles', ""''"", 'an', 'actor', 'named', '``', 'Brad', 'Pitt', ""''"", 'and', 'has', 'the', 'property', '``', 'regisseur', ""''"", 'a', 'person', 'named', '``', 'Guy', 'Richie', ""''"", '?']"	['Какие', 'фильмы', 'с', 'Брэдом', 'Питтом', 'в', 'главной', 'роли', 'были', 'сняти', 'режиссером', 'Гаем', 'Ричи', '?']	0.1524	0.0614	0.0	240.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of films where a type is a subclass of ""film"" and has the property ""this is an instance of"" a specific type, has the property ""in roles"" an actor named ""Brad Pitt"" and has the property ""regisseur"" a person named ""Guy Richie""?"	Какие фильмы с Бредом Питтом снял Гай Ричи?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q11424 . ?uri wdt:P31 ?type ; wdt:P161 wd:Q35332 ; wdt:P57 wd:Q192990 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'where', 'a', 'type', 'is', 'a', 'subclass', 'of', '``', 'film', ""''"", 'and', 'has', 'the', 'property', '``', 'this', 'is', 'an', 'instance', 'of', ""''"", 'a', 'specific', 'type', ',', 'has', 'the', 'property', '``', 'in', 'roles', ""''"", 'an', 'actor', 'named', '``', 'Brad', 'Pitt', ""''"", 'and', 'has', 'the', 'property', '``', 'regisseur', ""''"", 'a', 'person', 'named', '``', 'Guy', 'Richie', ""''"", '?']"	['Какие', 'фильмы', 'с', 'Бредом', 'Питтом', 'снял', 'Гай', 'Ричи', '?']	0.1524	0.0511	0.0	245.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of films where a type is a subclass of ""film"" and has the property ""this is an instance of"" a specific type, has the property ""in roles"" an actor named ""Brad Pitt"" and has the property ""regisseur"" a person named ""Guy Richie""?"	Какие фильмы с Брэдом Питтом были срежессированы Гаем Ричи?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q11424 . ?uri wdt:P31 ?type ; wdt:P161 wd:Q35332 ; wdt:P57 wd:Q192990 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'where', 'a', 'type', 'is', 'a', 'subclass', 'of', '``', 'film', ""''"", 'and', 'has', 'the', 'property', '``', 'this', 'is', 'an', 'instance', 'of', ""''"", 'a', 'specific', 'type', ',', 'has', 'the', 'property', '``', 'in', 'roles', ""''"", 'an', 'actor', 'named', '``', 'Brad', 'Pitt', ""''"", 'and', 'has', 'the', 'property', '``', 'regisseur', ""''"", 'a', 'person', 'named', '``', 'Guy', 'Richie', ""''"", '?']"	['Какие', 'фильмы', 'с', 'Брэдом', 'Питтом', 'были', 'срежессированы', 'Гаем', 'Ричи', '?']	0.1524	0.0536	0.0	244.0
13	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q16397 wdt:P40 ?children . ?children wdt:P40 ?uri . } 
 Где:
 wd:Q16397 именуется как ""Брюс Ли.""
 wdt:P40 именуется как ""дети.""
 wdt:P40 именуется как ""дети.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Who are the children of Bruce Lee?	Дайте мне внуков Брюса Ли.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q16397 wdt:P40 ?children . ?children wdt:P40 ?uri . }	['Who', 'are', 'the', 'children', 'of', 'Bruce', 'Lee', '?']	['Дайте', 'мне', 'внуков', 'Брюса', 'Ли', '.']	0.0	0.0	0.0	30.0
14	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q728 . wd:Q155644 wdt:P287 ?designer . ?uri wdt:P279 ?type ; wdt:P287 ?designer . FILTER (?uri != wd:Q155644) } 
 Где:
 wdt:P279 именуется как ""подкласс от.""
 wd:Q728 именуется как ""оружие.""
 wd:Q155644 именуется как ""Uzi.""
 wdt:P287 именуется как ""проектировщик.""
 wdt:P279 именуется как ""подкласс от.""
 wdt:P287 именуется как ""проектировщик.""
 wd:Q155644 именуется как ""Uzi.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of weapons (except for ""Uzi"") that have a subclass relationship with the weapon class ""oreshi-guna"" (Japanese for ""gun"", wd:Q728) and have a designer assigned to them?"	"Какое еще оружие создал конструктор ""Узи""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q728 . wd:Q155644 wdt:P287 ?designer . ?uri wdt:P279 ?type ; wdt:P287 ?designer . FILTER (?uri != wd:Q155644) }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'weapons', '(', 'except', 'for', '``', 'Uzi', ""''"", ')', 'that', 'have', 'a', 'subclass', 'relationship', 'with', 'the', 'weapon', 'class', '``', 'oreshi-guna', ""''"", '(', 'Japanese', 'for', '``', 'gun', ""''"", ',', 'wd', ':', 'Q728', ')', 'and', 'have', 'a', 'designer', 'assigned', 'to', 'them', '?']"	"['Какое', 'еще', 'оружие', 'создал', 'конструктор', '``', 'Узи', ""''"", '?']"	0.2111	0.2067	0.0	187.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of weapons (except for ""Uzi"") that have a subclass relationship with the weapon class ""oreshi-guna"" (Japanese for ""gun"", wd:Q728) and have a designer assigned to them?"	Какое еще оружие разработали создатели УЗИ?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q728 . wd:Q155644 wdt:P287 ?designer . ?uri wdt:P279 ?type ; wdt:P287 ?designer . FILTER (?uri != wd:Q155644) }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'weapons', '(', 'except', 'for', '``', 'Uzi', ""''"", ')', 'that', 'have', 'a', 'subclass', 'relationship', 'with', 'the', 'weapon', 'class', '``', 'oreshi-guna', ""''"", '(', 'Japanese', 'for', '``', 'gun', ""''"", ',', 'wd', ':', 'Q728', ')', 'and', 'have', 'a', 'designer', 'assigned', 'to', 'them', '?']"	['Какое', 'еще', 'оружие', 'разработали', 'создатели', 'УЗИ', '?']	0.1604	0.061	0.0	189.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of weapons (except for ""Uzi"") that have a subclass relationship with the weapon class ""oreshi-guna"" (Japanese for ""gun"", wd:Q728) and have a designer assigned to them?"	Какое еще оружие разработали создатели UZI?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q728 . wd:Q155644 wdt:P287 ?designer . ?uri wdt:P279 ?type ; wdt:P287 ?designer . FILTER (?uri != wd:Q155644) }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'weapons', '(', 'except', 'for', '``', 'Uzi', ""''"", ')', 'that', 'have', 'a', 'subclass', 'relationship', 'with', 'the', 'weapon', 'class', '``', 'oreshi-guna', ""''"", '(', 'Japanese', 'for', '``', 'gun', ""''"", ',', 'wd', ':', 'Q728', ')', 'and', 'have', 'a', 'designer', 'assigned', 'to', 'them', '?']"	['Какое', 'еще', 'оружие', 'разработали', 'создатели', 'UZI', '?']	0.1604	0.061	0.0	188.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of weapons (except for ""Uzi"") that have a subclass relationship with the weapon class ""oreshi-guna"" (Japanese for ""gun"", wd:Q728) and have a designer assigned to them?"	Какие другое огнестрельное оружие было разработано создателем Узи?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q728 . wd:Q155644 wdt:P287 ?designer . ?uri wdt:P279 ?type ; wdt:P287 ?designer . FILTER (?uri != wd:Q155644) }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'weapons', '(', 'except', 'for', '``', 'Uzi', ""''"", ')', 'that', 'have', 'a', 'subclass', 'relationship', 'with', 'the', 'weapon', 'class', '``', 'oreshi-guna', ""''"", '(', 'Japanese', 'for', '``', 'gun', ""''"", ',', 'wd', ':', 'Q728', ')', 'and', 'have', 'a', 'designer', 'assigned', 'to', 'them', '?']"	['Какие', 'другое', 'огнестрельное', 'оружие', 'было', 'разработано', 'создателем', 'Узи', '?']	0.1604	0.0689	0.0	187.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of weapons (except for ""Uzi"") that have a subclass relationship with the weapon class ""oreshi-guna"" (Japanese for ""gun"", wd:Q728) and have a designer assigned to them?"	Какое ещё оружие разработал дизайнер УЗИ?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q728 . wd:Q155644 wdt:P287 ?designer . ?uri wdt:P279 ?type ; wdt:P287 ?designer . FILTER (?uri != wd:Q155644) }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'weapons', '(', 'except', 'for', '``', 'Uzi', ""''"", ')', 'that', 'have', 'a', 'subclass', 'relationship', 'with', 'the', 'weapon', 'class', '``', 'oreshi-guna', ""''"", '(', 'Japanese', 'for', '``', 'gun', ""''"", ',', 'wd', ':', 'Q728', ')', 'and', 'have', 'a', 'designer', 'assigned', 'to', 'them', '?']"	['Какое', 'ещё', 'оружие', 'разработал', 'дизайнер', 'УЗИ', '?']	0.1604	0.061	0.0	189.0
15	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q168383 wdt:P127 ?uri . } 
 Где:
 wd:Q168383 именуется как ""Universal Pictures.""
 wdt:P127 именуется как ""владельцем является.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct uris of entities that are owned by ""Universal Pictures"" (wd:Q168383)?"	Кто владелец Universal Studios?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q168383 wdt:P127 ?uri . }	"['What', 'are', 'the', 'distinct', 'uris', 'of', 'entities', 'that', 'are', 'owned', 'by', '``', 'Universal', 'Pictures', ""''"", '(', 'wd', ':', 'Q168383', ')', '?']"	['Кто', 'владелец', 'Universal', 'Studios', '?']	0.2149	0.2211	0.0	75.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct uris of entities that are owned by ""Universal Pictures"" (wd:Q168383)?"	Кто владелец студии Universal Studios?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q168383 wdt:P127 ?uri . }	"['What', 'are', 'the', 'distinct', 'uris', 'of', 'entities', 'that', 'are', 'owned', 'by', '``', 'Universal', 'Pictures', ""''"", '(', 'wd', ':', 'Q168383', ')', '?']"	['Кто', 'владелец', 'студии', 'Universal', 'Studios', '?']	0.2149	0.2462	0.0	74.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct uris of entities that are owned by ""Universal Pictures"" (wd:Q168383)?"	Кто владедец Universal Studios?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q168383 wdt:P127 ?uri . }	"['What', 'are', 'the', 'distinct', 'uris', 'of', 'entities', 'that', 'are', 'owned', 'by', '``', 'Universal', 'Pictures', ""''"", '(', 'wd', ':', 'Q168383', ')', '?']"	['Кто', 'владедец', 'Universal', 'Studios', '?']	0.2149	0.2211	0.0	75.0
16	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 ; wdt:P2046 ?area ; wdt:P1082 ?population . BIND((?population/?area) AS ?density) . } ORDER BY DESC(?density) LIMIT 1 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q35657 именуется как ""штат США.""
 wdt:P2046 именуется как ""площадь.""
 wdt:P1082 именуется как ""численность населения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the state in the USA with the highest population density as determined by dividing its population by its area?	В каком штате США наиболее высокая плотность населения?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 ; wdt:P2046 ?area ; wdt:P1082 ?population . BIND((?population/?area) AS ?density) . } ORDER BY DESC(?density) LIMIT 1	['What', 'is', 'the', 'state', 'in', 'the', 'USA', 'with', 'the', 'highest', 'population', 'density', 'as', 'determined', 'by', 'dividing', 'its', 'population', 'by', 'its', 'area', '?']	['В', 'каком', 'штате', 'США', 'наиболее', 'высокая', 'плотность', 'населения', '?']	0.1796	0.1441	0.0	110.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the state in the USA with the highest population density as determined by dividing its population by its area?	Какой штат США имеет наивысшую плотность населения?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 ; wdt:P2046 ?area ; wdt:P1082 ?population . BIND((?population/?area) AS ?density) . } ORDER BY DESC(?density) LIMIT 1	['What', 'is', 'the', 'state', 'in', 'the', 'USA', 'with', 'the', 'highest', 'population', 'density', 'as', 'determined', 'by', 'dividing', 'its', 'population', 'by', 'its', 'area', '?']	['Какой', 'штат', 'США', 'имеет', 'наивысшую', 'плотность', 'населения', '?']	0.1796	0.1364	0.0	111.0
17	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q116 ; wdt:P26 ?spouse . ?spouse wdt:P27 wd:Q183 . } 
 Где:
 wdt:P106 именуется как ""род занятий.""
 wd:Q116 именуется как ""монарх.""
 wdt:P26 именуется как ""супруг(а).""
 wdt:P27 именуется как ""гражданство.""
 wd:Q183 именуется как ""Германия.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of individuals who are monarchs and have the occupation ""rod zanyatij"" (рода занятий, or rod zanyatij being Russian for ""branch of activity"" or ""occupation""), and whose spouse holds the nationality ""Германия"" (Germany)?"	Какие монархи были женаты на немках?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q116 ; wdt:P26 ?spouse . ?spouse wdt:P27 wd:Q183 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'are', 'monarchs', 'and', 'have', 'the', 'occupation', '``', 'rod', 'zanyatij', ""''"", '(', 'рода', 'занятий', ',', 'or', 'rod', 'zanyatij', 'being', 'Russian', 'for', '``', 'branch', 'of', 'activity', ""''"", 'or', '``', 'occupation', ""''"", ')', ',', 'and', 'whose', 'spouse', 'holds', 'the', 'nationality', '``', 'Германия', ""''"", '(', 'Germany', ')', '?']"	['Какие', 'монархи', 'были', 'женаты', 'на', 'немках', '?']	0.1566	0.053	0.0	236.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of individuals who are monarchs and have the occupation ""rod zanyatij"" (рода занятий, or rod zanyatij being Russian for ""branch of activity"" or ""occupation""), and whose spouse holds the nationality ""Германия"" (Germany)?"	Какие монархи имели жен из Германии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q116 ; wdt:P26 ?spouse . ?spouse wdt:P27 wd:Q183 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'are', 'monarchs', 'and', 'have', 'the', 'occupation', '``', 'rod', 'zanyatij', ""''"", '(', 'рода', 'занятий', ',', 'or', 'rod', 'zanyatij', 'being', 'Russian', 'for', '``', 'branch', 'of', 'activity', ""''"", 'or', '``', 'occupation', ""''"", ')', ',', 'and', 'whose', 'spouse', 'holds', 'the', 'nationality', '``', 'Германия', ""''"", '(', 'Germany', ')', '?']"	['Какие', 'монархи', 'имели', 'жен', 'из', 'Германии', '?']	0.1566	0.053	0.0	231.0
18	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q43229 . ?uri wdt:P31 ?type . ?uri wdt:P571 ?foundedAt . FILTER CONTAINS(STR(?foundedAt), ""1950"") } 
 Где:
 wdt:P279 именуется как ""подкласс от.""
 wd:Q43229 именуется как ""организация.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P571 именуется как ""дата основания / создания / возникновения.""
