id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of organizations with a known number of employees (property ""P1128"") that include ""Google"" (wd:Q95) as their entity?"	Сколько сотрудников работают в Гугл?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q95 wdt:P1128 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'organizations', 'with', 'a', 'known', 'number', 'of', 'employees', '(', 'property', '``', 'P1128', ""''"", ')', 'that', 'include', '``', 'Google', ""''"", '(', 'wd', ':', 'Q95', ')', 'as', 'their', 'entity', '?']"	['Сколько', 'сотрудников', 'работают', 'в', 'Гугл', '?']	0.1685	0.076	0.0	139.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of organizations with a known number of employees (property ""P1128"") that include ""Google"" (wd:Q95) as their entity?"	Сколько человек работает в Гугл?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q95 wdt:P1128 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'organizations', 'with', 'a', 'known', 'number', 'of', 'employees', '(', 'property', '``', 'P1128', ""''"", ')', 'that', 'include', '``', 'Google', ""''"", '(', 'wd', ':', 'Q95', ')', 'as', 'their', 'entity', '?']"	['Сколько', 'человек', 'работает', 'в', 'Гугл', '?']	0.1685	0.076	0.0	139.0
86	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 ; wdt:P19 wd:Q64 . } 
 Где:
 wdt:P106 именуется как ""род занятий.""
 wd:Q33999 именуется как ""актёр.""
 wdt:P19 именуется как ""место рождения.""
 wd:Q64 именуется как ""Берлин.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI identifiers of individuals who are actors and were born in Berlin, stated as the place of birth property?	Назови мне всех актеров родившихся в Берлине.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 ; wdt:P19 wd:Q64 . }	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'individuals', 'who', 'are', 'actors', 'and', 'were', 'born', 'in', 'Berlin', ',', 'stated', 'as', 'the', 'place', 'of', 'birth', 'property', '?']	['Назови', 'мне', 'всех', 'актеров', 'родившихся', 'в', 'Берлине', '.']	0.0	0.0	0.0	125.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's that represent the creators of ""Gúfit"" (Q111135)?"	Кто создал Гуфи?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q111135> <http://www.wikidata.org/prop/direct/P170> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'that', 'represent', 'the', 'creators', 'of', '``', 'Gúfit', ""''"", '(', 'Q111135', ')', '?']"	['Кто', 'создал', 'Гуфи', '?']	0.1843	0.1111	0.0	74.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's that represent the creators of ""Gúfit"" (Q111135)?"	Кто придумал Гуфи?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q111135> <http://www.wikidata.org/prop/direct/P170> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'that', 'represent', 'the', 'creators', 'of', '``', 'Gúfit', ""''"", '(', 'Q111135', ')', '?']"	['Кто', 'придумал', 'Гуфи', '?']	0.1843	0.1111	0.0	74.0
88	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { { wd:Q1318118 wdt:P361 ?uri . } UNION { VALUES ?albumType { wd:Q482994 wd:Q208569 } ?uri wdt:P31|wdt:P7937 ?albumType ; wdt:P658 wd:Q1318118 . }} 
 Где:
 wd:Q1318118 именуется как ""Last Christmas.""
 wdt:P361 именуется как ""является частью.""
 wd:Q482994 именуется как ""музыкальный альбом.""
 wd:Q208569 именуется как ""студийный альбом.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P7937 именуется как ""форма творческой работы.""
 wdt:P658 именуется как ""композиции.""
 wd:Q1318118 именуется как ""Last Christmas.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI's of the studio or musical albums that are part of ""Last Christmas"" (wd:Q1318118)?"	"Какие музыкальные альбомы содержат песню ""Последние рождество""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { { wd:Q1318118 wdt:P361 ?uri . } UNION { VALUES ?albumType { wd:Q482994 wd:Q208569 } ?uri wdt:P31|wdt:P7937 ?albumType ; wdt:P658 wd:Q1318118 . }}	"['What', 'are', 'the', 'URI', ""'s"", 'of', 'the', 'studio', 'or', 'musical', 'albums', 'that', 'are', 'part', 'of', '``', 'Last', 'Christmas', ""''"", '(', 'wd', ':', 'Q1318118', ')', '?']"	"['Какие', 'музыкальные', 'альбомы', 'содержат', 'песню', '``', 'Последние', 'рождество', ""''"", '?']"	0.2322	0.3986	0.0	91.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI's of the studio or musical albums that are part of ""Last Christmas"" (wd:Q1318118)?"	В каких музыкальных альбомах есть песня Last Christmas?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { { wd:Q1318118 wdt:P361 ?uri . } UNION { VALUES ?albumType { wd:Q482994 wd:Q208569 } ?uri wdt:P31|wdt:P7937 ?albumType ; wdt:P658 wd:Q1318118 . }}	"['What', 'are', 'the', 'URI', ""'s"", 'of', 'the', 'studio', 'or', 'musical', 'albums', 'that', 'are', 'part', 'of', '``', 'Last', 'Christmas', ""''"", '(', 'wd', ':', 'Q1318118', ')', '?']"	['В', 'каких', 'музыкальных', 'альбомах', 'есть', 'песня', 'Last', 'Christmas', '?']	0.1326	0.3804	0.0	78.0
89	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?date WHERE { wd:Q1951 wdt:P571 ?date . } 
 Где:
 wd:Q1951 именуется как ""Альберта.""
 wdt:P571 именуется как ""дата основания / создания / возникновения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the distinct date of foundation for Albert?	В каком году Альберта была признана провинцией?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?date WHERE { wd:Q1951 wdt:P571 ?date . }	['What', 'is', 'the', 'distinct', 'date', 'of', 'foundation', 'for', 'Albert', '?']	['В', 'каком', 'году', 'Альберта', 'была', 'признана', 'провинцией', '?']	0.1955	0.3	0.0	46.0
""How many times is an entity a part of 'Union' in Wikidata?"""	Сколько миссий имела программа Союз?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P361 wd:Q207329 }	"['``', 'Сколько', 'раз', 'сущность', 'является', 'частью', '``', 'Союза', ""''"", 'в', 'Wikidata', '?', ""''"", '``', 'How', 'many', 'times', 'is', 'an', 'entity', 'a', 'part', 'of', ""'Union"", ""'"", 'in', 'Wikidata', '?', ""''""]"	['Сколько', 'миссий', 'имела', 'программа', 'Союз', '?']	0.2053	0.1783	0.0	102.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI identifiers of the entities that are telecasts and have a subclass relationship with the type ""television program"" and have Neil Patrick Harris in the roles, along with their respective types?"	Перечислите все ТВ шоу с Нилом Патриком Харрисом?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?type wdt:P279* wd:Q15416 . ?uri wdt:P161 wd:Q485310 . ?uri wdt:P31 ?type . }	"['What', 'are', 'the', 'URI', 'identifiers', 'of', 'the', 'entities', 'that', 'are', 'telecasts', 'and', 'have', 'a', 'subclass', 'relationship', 'with', 'the', 'type', '``', 'television', 'program', ""''"", 'and', 'have', 'Neil', 'Patrick', 'Harris', 'in', 'the', 'roles', ',', 'along', 'with', 'their', 'respective', 'types', '?']"	['Перечислите', 'все', 'ТВ', 'шоу', 'с', 'Нилом', 'Патриком', 'Харрисом', '?']	0.1655	0.0834	0.0	201.0
92	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?date WHERE { wd:Q622188 wdt:P571 ?date . } 
 Где:
 wd:Q622188 именуется как ""Ангелы ада.""
 wdt:P571 именуется как ""дата основания / создания / возникновения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the date that ""Angels of Hell"" were founded or created?"	Когда были основаны Hells Angels?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?date WHERE { wd:Q622188 wdt:P571 ?date . }	"['What', 'is', 'the', 'date', 'that', '``', 'Angels', 'of', 'Hell', ""''"", 'were', 'founded', 'or', 'created', '?']"	['Когда', 'были', 'основаны', 'Hells', 'Angels', '?']	0.2239	0.3447	0.0	52.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the date that ""Angels of Hell"" were founded or created?"	Когда Хелз Анджелес был основан?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?date WHERE { wd:Q622188 wdt:P571 ?date . }	"['What', 'is', 'the', 'date', 'that', '``', 'Angels', 'of', 'Hell', ""''"", 'were', 'founded', 'or', 'created', '?']"	['Когда', 'Хелз', 'Анджелес', 'был', 'основан', '?']	0.1883	0.1723	0.0	58.0
93	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q312 wdt:P2295 ?uri . } 
 Где:
 wd:Q312 именуется как ""Apple.""
 wdt:P2295 именуется как ""чистая прибыль.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that have a ""clean profit"" property with value for the entity ""Apple""?"	Какой чистый доход Эпл?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q312 wdt:P2295 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'a', '``', 'clean', 'profit', ""''"", 'property', 'with', 'value', 'for', 'the', 'entity', '``', 'Apple', ""''"", '?']"	['Какой', 'чистый', 'доход', 'Эпл', '?']	0.1764	0.0929	0.0	106.0
94	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q1401522 . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q1401522 именуется как ""Праздники Швеции.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""Which URI represents an instance of the concept 'Festivals in Sweden' (wd:Q1401522) as a subclass?"""	Перечислите все шведские праздники?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q1401522 . }	"['``', 'Which', 'URI', 'represents', 'an', 'instance', 'of', 'the', 'concept', ""'Festivals"", 'in', 'Sweden', ""'"", '(', 'wd', ':', 'Q1401522', ')', 'as', 'a', 'subclass', '?', ""''""]"	['Перечислите', 'все', 'шведские', 'праздники', '?']	0.1785	0.101	0.0	96.0
95	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q154946 wdt:P119 ?uri . } 
 Где:
 wd:Q154946 именуется как ""Юлиана Нидерландская.""
 wdt:P119 именуется как ""место погребения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct places of burial for Julianna of the Netherlands (wd:Q154946)?	В каком городе похоронена бывшая голландская королева Юлиана?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q154946 wdt:P119 ?uri . }	['What', 'are', 'the', 'distinct', 'places', 'of', 'burial', 'for', 'Julianna', 'of', 'the', 'Netherlands', '(', 'wd', ':', 'Q154946', ')', '?']	['В', 'каком', 'городе', 'похоронена', 'бывшая', 'голландская', 'королева', 'Юлиана', '?']	0.1843	0.1761	0.0	77.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct places of burial for Julianna of the Netherlands (wd:Q154946)?	В каком городе была похоронена бывшая королева Дании Джулиана?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q154946 wdt:P119 ?uri . }	['What', 'are', 'the', 'distinct', 'places', 'of', 'burial', 'for', 'Julianna', 'of', 'the', 'Netherlands', '(', 'wd', ':', 'Q154946', ')', '?']	['В', 'каком', 'городе', 'была', 'похоронена', 'бывшая', 'королева', 'Дании', 'Джулиана', '?']	0.1843	0.1846	0.0	76.0
96	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q2743 ; wdt:P86 wd:Q152505 . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q2743 именуется как ""мюзикл.""
 wdt:P86 именуется как ""композитор.""
 wd:Q152505 именуется как ""Леонард Бернстайн.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of musicals that have a composer with the given name ""Леонард Бернстайн""?"	Перечислите все мюзиклы Леонарда Бернстайна.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q2743 ; wdt:P86 wd:Q152505 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'musicals', 'that', 'have', 'a', 'composer', 'with', 'the', 'given', 'name', '``', 'Леонард', 'Бернстайн', ""''"", '?']"	['Перечислите', 'все', 'мюзиклы', 'Леонарда', 'Бернстайна', '.']	0.0	0.0	0.0	92.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of musicals that have a composer with the given name ""Леонард Бернстайн""?"	Назовите все мюзклы, где автором музыки был Леонард Бернштейн.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q2743 ; wdt:P86 wd:Q152505 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'musicals', 'that', 'have', 'a', 'composer', 'with', 'the', 'given', 'name', '``', 'Леонард', 'Бернстайн', ""''"", '?']"	['Назовите', 'все', 'мюзклы', ',', 'где', 'автором', 'музыки', 'был', 'Леонард', 'Бернштейн', '.']	0.1807	0.1647	0.0	89.0
97	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4830453 ; wdt:P452 wd:Q39809 . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q4830453 именуется как ""бизнес-предприятие.""
 wdt:P452 именуется как ""отрасль.""
 wd:Q39809 именуется как ""рынковедение.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive business entities, each belonging to the concept of ""business enterprise,"" and which can be classified into the field of ""market research"" as their sector or industry?"	Перечислите все компании в индустрии рекламы.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4830453 ; wdt:P452 wd:Q39809 . }	"['What', 'are', 'the', 'distinctive', 'business', 'entities', ',', 'each', 'belonging', 'to', 'the', 'concept', 'of', '``', 'business', 'enterprise', ',', ""''"", 'and', 'which', 'can', 'be', 'classified', 'into', 'the', 'field', 'of', '``', 'market', 'research', ""''"", 'as', 'their', 'sector', 'or', 'industry', '?']"	['Перечислите', 'все', 'компании', 'в', 'индустрии', 'рекламы', '.']	0.0	0.0	0.0	187.0
99	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1203 wdt:P157 ?uri . } 
 Где:
 wd:Q1203 именуется как ""Джон Леннон.""
 wdt:P157 именуется как ""кто убил.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of individuals who have the occupation ""writer"" and attended an educational institution located in ""Istanbul"" (Q406)?"	Кто из писателей учился в Стамбуле?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q36180> . ?uri <http://www.wikidata.org/prop/direct/P69>/<http://www.wikidata.org/prop/direct/P131>  <http://www.wikidata.org/entity/Q406> . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'have', 'the', 'occupation', '``', 'writer', ""''"", 'and', 'attended', 'an', 'educational', 'institution', 'located', 'in', '``', 'Istanbul', ""''"", '(', 'Q406', ')', '?']"	['Кто', 'из', 'писателей', 'учился', 'в', 'Стамбуле', '?']	0.1726	0.0968	0.0	139.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of musical groups that are a subclass of ""musical group"" and originate from ""Australia"" and belong to the genre ""metalcore""?"	Перечислите все австралийские металкор группы	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q215380 ; wdt:P495 wd:Q408 ; wdt:P136 wd:Q183862 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'musical', 'groups', 'that', 'are', 'a', 'subclass', 'of', '``', 'musical', 'group', ""''"", 'and', 'originate', 'from', '``', 'Australia', ""''"", 'and', 'belong', 'to', 'the', 'genre', '``', 'metalcore', ""''"", '?']"	['Перечислите', 'все', 'австралийские', 'металкор', 'группы']	0.0	0.0	0.0	148.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of countries that have Europe as their currency according to the Wikidata database?	Какие страны приняли Евро	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256> . ?uri <http://www.wikidata.org/prop/direct/P38> <http://www.wikidata.org/entity/Q4916>   . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'countries', 'that', 'have', 'Europe', 'as', 'their', 'currency', 'according', 'to', 'the', 'Wikidata', 'database', '?']"	['Какие', 'страны', 'приняли', 'Евро']	0.0	0.0	0.0	108.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of countries that have Europe as their currency according to the Wikidata database?	В каких странах используют Евро?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q6256> . ?uri <http://www.wikidata.org/prop/direct/P38> <http://www.wikidata.org/entity/Q4916>   . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'countries', 'that', 'have', 'Europe', 'as', 'their', 'currency', 'according', 'to', 'the', 'Wikidata', 'database', '?']"	['В', 'каких', 'странах', 'используют', 'Евро', '?']	0.1818	0.1292	0.0	106.0
103	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279 wd:Q373822 . } 
 Где:
 wdt:P279 именуется как ""подкласс от.""
 wd:Q373822 именуется как ""расстройство приёма пищи.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that have the property ""subclass of"" with the value ""disorder of eating""?

Translated SPARQL query:
```vbnet
SELECT DISTINCT ?uri 
  ?uri wdt:<http://www.wikidata.org/prop/direct/P279>. 
  ?uri wdt:<http://www.wikidata.org/entity/Q373822>. 
}
```

Natural language question:

Which entities have ""subclass of"" the property with the value ""disorder of eating""?
Only the transformed question: Which entities have the 'subclass of' property with the value ""disorder of eating""?"	Перечислите все виды пищевых расстройств	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279 wd:Q373822 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'subclass', 'of', ""''"", 'with', 'the', 'value', '``', 'disorder', 'of', 'eating', ""''"", '?', 'Translated', 'SPARQL', 'query', ':', '``', '`', 'vbnet', 'SELECT', 'DISTINCT', '?', 'uri', 'WHERE', '{', '?', 'uri', 'wdt', ':', '<', 'http', ':', '//www.wikidata.org/prop/direct/P279', '>', '.', '?', 'uri', 'wdt', ':', '<', 'http', ':', '//www.wikidata.org/entity/Q373822', '>', '.', '}', '``', '`', 'Natural', 'language', 'question', ':', 'Which', 'entities', 'have', '``', 'subclass', 'of', ""''"", 'the', 'property', 'with', 'the', 'value', '``', 'disorder', 'of', 'eating', ""''"", '?', 'Only', 'the', 'transformed', 'question', ':', 'Which', 'entities', 'have', 'the', ""'subclass"", 'of', ""'"", 'property', 'with', 'the', 'value', '``', 'disorder', 'of', 'eating', ""''"", '?']"	['Перечислите', 'все', 'виды', 'пищевых', 'расстройств']	0.0	0.0	0.0	529.0
104	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q93284 wdt:P172 wd:Q7325 . } 
 Где:
 wd:Q93284 именуется как ""Марк Захарович Шагал.""
 wdt:P172 именуется как ""этническая группа.""
 wd:Q7325 именуется как ""евреи.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the ethnic group of Mark Zakharovich Shagal?

Transformed SPARQL query in natural language question:

What is the ethnicity of Mark Zakharovich Shagal?
Answer:

The ethnic group of Mark Zakharovich Shagal is Jews."	Марк Шагал был евреем	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q93284 wdt:P172 wd:Q7325 . }	['What', 'is', 'the', 'ethnic', 'group', 'of', 'Mark', 'Zakharovich', 'Shagal', '?', 'Transformed', 'SPARQL', 'query', 'in', 'natural', 'language', 'question', ':', 'What', 'is', 'the', 'ethnicity', 'of', 'Mark', 'Zakharovich', 'Shagal', '?', 'Answer', ':', 'The', 'ethnic', 'group', 'of', 'Mark', 'Zakharovich', 'Shagal', 'is', 'Jews', '.']	['Марк', 'Шагал', 'был', 'евреем']	0.0	0.0	0.0	218.0
The ethnic group of Mark Zakharovich Shagal is Jews."	Был ли евреем Марк Шагал?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q93284 wdt:P172 wd:Q7325 . }	['What', 'is', 'the', 'ethnic', 'group', 'of', 'Mark', 'Zakharovich', 'Shagal', '?', 'Transformed', 'SPARQL', 'query', 'in', 'natural', 'language', 'question', ':', 'What', 'is', 'the', 'ethnicity', 'of', 'Mark', 'Zakharovich', 'Shagal', '?', 'Answer', ':', 'The', 'ethnic', 'group', 'of', 'Mark', 'Zakharovich', 'Shagal', 'is', 'Jews', '.']	['Был', 'ли', 'евреем', 'Марк', 'Шагал', '?']	0.1648	0.0663	0.0	216.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which is the position of the Brazil National Football Team, determined by the FIFA Rankings, with the highest value for the property ""Position""?"	Какое самое низкое место занимала Бразилия в мировом рейтинге ФИФА	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?value WHERE { wd:Q83459 p:P1352 ?statement . ?statement pq:P459 wd:Q180825 ; ps:P1352 ?value . } ORDER BY DESC(?value) LIMIT 1	"['Which', 'is', 'the', 'position', 'of', 'the', 'Brazil', 'National', 'Football', 'Team', ',', 'determined', 'by', 'the', 'FIFA', 'Rankings', ',', 'with', 'the', 'highest', 'value', 'for', 'the', 'property', '``', 'Position', ""''"", '?']"	['Какое', 'самое', 'низкое', 'место', 'занимала', 'Бразилия', 'в', 'мировом', 'рейтинге', 'ФИФА']	0.0	0.0	0.0	135.0
106	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P31 wd:Q11424 ; wdt:P161 wd:Q38111 . } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q11424 именуется как ""фильм.""
 wdt:P161 именуется как ""в ролях.""
 wd:Q38111 именуется как ""Леонардо Ди Каприо.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the number of distinct films in which Leonardo Di Caprio has acted?	В скольких фильмах снялся Леонардо Ди Каприо	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P31 wd:Q11424 ; wdt:P161 wd:Q38111 . }	['What', 'is', 'the', 'number', 'of', 'distinct', 'films', 'in', 'which', 'Leonardo', 'Di', 'Caprio', 'has', 'acted', '?']	['В', 'скольких', 'фильмах', 'снялся', 'Леонардо', 'Ди', 'Каприо']	0.0	0.0	0.0	69.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the number of distinct films in which Leonardo Di Caprio has acted?	В скольких фильмах снялся Леонардо ДиКаприо?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P31 wd:Q11424 ; wdt:P161 wd:Q38111 . }	['What', 'is', 'the', 'number', 'of', 'distinct', 'films', 'in', 'which', 'Leonardo', 'Di', 'Caprio', 'has', 'acted', '?']	['В', 'скольких', 'фильмах', 'снялся', 'Леонардо', 'ДиКаприо', '?']	0.1883	0.1872	0.0	69.0
107	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7416 wdt:P106 wd:Q593644 . } 
 Где:
 wd:Q7416 именуется как ""Маргарет Тэтчер.""
 wdt:P106 именуется как ""род занятий.""
 wd:Q593644 именуется как ""химик.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Was Margaret Thatcher, identified by the code Q7416, engaged in the occupation designated by the code P106, which is known as ""rod zañatiyi"" or ""rods of employment""? If so, what was that occupation, identified by the code Q593644, which is referred to as ""khimik"" or ""chemist""?"	Маргарет Тэтчер была химиком	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7416 wdt:P106 wd:Q593644 . }	"['Was', 'Margaret', 'Thatcher', ',', 'identified', 'by', 'the', 'code', 'Q7416', ',', 'engaged', 'in', 'the', 'occupation', 'designated', 'by', 'the', 'code', 'P106', ',', 'which', 'is', 'known', 'as', '``', 'rod', 'zañatiyi', ""''"", 'or', '``', 'rods', 'of', 'employment', ""''"", '?', 'If', 'so', ',', 'what', 'was', 'that', 'occupation', ',', 'identified', 'by', 'the', 'code', 'Q593644', ',', 'which', 'is', 'referred', 'to', 'as', '``', 'khimik', ""''"", 'or', '``', 'chemist', ""''"", '?']"	['Маргарет', 'Тэтчер', 'была', 'химиком']	0.0	0.0	0.0	274.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Was Margaret Thatcher, identified by the code Q7416, engaged in the occupation designated by the code P106, which is known as ""rod zañatiyi"" or ""rods of employment""? If so, what was that occupation, identified by the code Q593644, which is referred to as ""khimik"" or ""chemist""?"	Была ли Маргаретт Тетчер химиком?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7416 wdt:P106 wd:Q593644 . }	"['Was', 'Margaret', 'Thatcher', ',', 'identified', 'by', 'the', 'code', 'Q7416', ',', 'engaged', 'in', 'the', 'occupation', 'designated', 'by', 'the', 'code', 'P106', ',', 'which', 'is', 'known', 'as', '``', 'rod', 'zañatiyi', ""''"", 'or', '``', 'rods', 'of', 'employment', ""''"", '?', 'If', 'so', ',', 'what', 'was', 'that', 'occupation', ',', 'identified', 'by', 'the', 'code', 'Q593644', ',', 'which', 'is', 'referred', 'to', 'as', '``', 'khimik', ""''"", 'or', '``', 'chemist', ""''"", '?']"	['Была', 'ли', 'Маргаретт', 'Тетчер', 'химиком', '?']	0.1524	0.0417	0.0	272.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which distinct URI's represent the books that are a subclass of ""Q571: Book"" and have ""Daniela Steil: Q72653"" as their author?"	Перечислите все книги, написанные Даниэлой Стил	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q571> . ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q72653> . } 	"['Which', 'distinct', 'URI', ""'s"", 'represent', 'the', 'books', 'that', 'are', 'a', 'subclass', 'of', '``', 'Q571', ':', 'Book', ""''"", 'and', 'have', '``', 'Daniela', 'Steil', ':', 'Q72653', ""''"", 'as', 'their', 'author', '?']"	['Перечислите', 'все', 'книги', ',', 'написанные', 'Даниэлой', 'Стил']	0.0	0.0	0.0	121.0
