id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of organizations that have a subclass relationship with ""организация"" ( Q43229 ) and were founded before the year 1950?"	Какие организации были созданы в 1950 году?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q43229 . ?uri wdt:P31 ?type . ?uri wdt:P571 ?foundedAt . FILTER CONTAINS(STR(?foundedAt), ""1950"") }"	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'organizations', 'that', 'have', 'a', 'subclass', 'relationship', 'with', '``', 'организация', ""''"", '(', 'Q43229', ')', 'and', 'were', 'founded', 'before', 'the', 'year', '1950', '?']"	['Какие', 'организации', 'были', 'созданы', 'в', '1950', 'году', '?']	0.2064	0.2143	0.0	130.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of organizations that have a subclass relationship with ""организация"" ( Q43229 ) and were founded before the year 1950?"	Какие организации основаны в 1950 году?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q43229 . ?uri wdt:P31 ?type . ?uri wdt:P571 ?foundedAt . FILTER CONTAINS(STR(?foundedAt), ""1950"") }"	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'organizations', 'that', 'have', 'a', 'subclass', 'relationship', 'with', '``', 'организация', ""''"", '(', 'Q43229', ')', 'and', 'were', 'founded', 'before', 'the', 'year', '1950', '?']"	['Какие', 'организации', 'основаны', 'в', '1950', 'году', '?']	0.2064	0.2005	0.0	131.0
19	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q190679 wdt:P170 ?uri . } 
 Где:
 wd:Q190679 именуется как ""Капитан Америка.""
 wdt:P170 именуется как ""создатель.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct uris of entities that were created by ""Капитан Америка"" (wd:Q190679)?"	"Кто создал комикс ""Капитан Америка""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q190679 wdt:P170 ?uri . }	"['What', 'are', 'the', 'distinct', 'uris', 'of', 'entities', 'that', 'were', 'created', 'by', '``', 'Капитан', 'Америка', ""''"", '(', 'wd', ':', 'Q190679', ')', '?']"	"['Кто', 'создал', 'комикс', '``', 'Капитан', 'Америка', ""''"", '?']"	0.1202	0.7143	0.1053	70.0
20	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q178871 wdt:P1029 ?uri } 
 Где:
 wd:Q178871 именуется как ""Аполлон-14.""
 wdt:P1029 именуется как ""члены экипажа.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the individuals who have been part of the team of Apollo-14?	"Скажите имена астронавтов ""Аполлон-14""."	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q178871 wdt:P1029 ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'individuals', 'who', 'have', 'been', 'part', 'of', 'the', 'team', 'of', 'Apollo-14', '?']"	"['Скажите', 'имена', 'астронавтов', '``', 'Аполлон-14', ""''"", '.']"	0.0	0.0	0.0	86.0
21	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1163227 wdt:P50 ?uri . } 
 Где:
 wd:Q1163227 именуется как ""Столпы Земли.""
 wdt:P50 именуется как ""автор.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the uris of the authors of ""Столпы Земли"" (wd:Q1163227)?"	"Кто написал книгу ""Столпы Земли""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1163227 wdt:P50 ?uri . }	"['What', 'are', 'the', 'uris', 'of', 'the', 'authors', 'of', '``', 'Столпы', 'Земли', ""''"", '(', 'wd', ':', 'Q1163227', ')', '?']"	"['Кто', 'написал', 'книгу', '``', 'Столпы', 'Земли', ""''"", '?']"	0.1422	0.8333	0.1429	47.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the uris of the authors of ""Столпы Земли"" (wd:Q1163227)?"	"Кто автор книги ""Столпы Земли""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1163227 wdt:P50 ?uri . }	"['What', 'are', 'the', 'uris', 'of', 'the', 'authors', 'of', '``', 'Столпы', 'Земли', ""''"", '(', 'wd', ':', 'Q1163227', ')', '?']"	"['Кто', 'автор', 'книги', '``', 'Столпы', 'Земли', ""''"", '?']"	0.1422	0.8333	0.1429	47.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the state in the USA with the highest population density as determined by dividing its population by its area?	Какой штат Соединенных Штатов Америки имет самую высокую плотность населения?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 ; wdt:P2046 ?area ; wdt:P1082 ?population . BIND((?population/?area) AS ?density) . } ORDER BY DESC(?density) LIMIT 1	['What', 'is', 'the', 'state', 'in', 'the', 'USA', 'with', 'the', 'highest', 'population', 'density', 'as', 'determined', 'by', 'dividing', 'its', 'population', 'by', 'its', 'area', '?']	['Какой', 'штат', 'Соединенных', 'Штатов', 'Америки', 'имет', 'самую', 'высокую', 'плотность', 'населения', '?']	0.1796	0.1572	0.0	108.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the state in the USA with the highest population density as determined by dividing its population by its area?	В каком штате США наибольшая плотность населения?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 ; wdt:P2046 ?area ; wdt:P1082 ?population . BIND((?population/?area) AS ?density) . } ORDER BY DESC(?density) LIMIT 1	['What', 'is', 'the', 'state', 'in', 'the', 'USA', 'with', 'the', 'highest', 'population', 'density', 'as', 'determined', 'by', 'dividing', 'its', 'population', 'by', 'its', 'area', '?']	['В', 'каком', 'штате', 'США', 'наибольшая', 'плотность', 'населения', '?']	0.1796	0.1364	0.0	111.0
23	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P1427 wd:Q177477 } 
 Где:
 wdt:P1427 именуется как ""начало пути.""
 wd:Q177477 именуется как ""Байконур.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that have the property ""beginning of paths"" with the value ""Байконур"" (Q177477)?

Or in simpler terms:
Which entities have the ""beginning of paths"" property set to ""Байконур"" (Q177477)?"	Какие космические корабли были запущены с Байконура?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P1427 wd:Q177477 }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'beginning', 'of', 'paths', ""''"", 'with', 'the', 'value', '``', 'Байконур', ""''"", '(', 'Q177477', ')', '?', 'Or', 'in', 'simpler', 'terms', ':', 'Which', 'entities', 'have', 'the', '``', 'beginning', 'of', 'paths', ""''"", 'property', 'set', 'to', '``', 'Байконур', ""''"", '(', 'Q177477', ')', '?']"	['Какие', 'космические', 'корабли', 'были', 'запущены', 'с', 'Байконура', '?']	0.1576	0.0588	0.0	217.0
Which entities have the ""beginning of paths"" property set to ""Байконур"" (Q177477)?"	Какие космические полеты запущены с Байконура?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P1427 wd:Q177477 }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'beginning', 'of', 'paths', ""''"", 'with', 'the', 'value', '``', 'Байконур', ""''"", '(', 'Q177477', ')', '?', 'Or', 'in', 'simpler', 'terms', ':', 'Which', 'entities', 'have', 'the', '``', 'beginning', 'of', 'paths', ""''"", 'property', 'set', 'to', '``', 'Байконур', ""''"", '(', 'Q177477', ')', '?']"	['Какие', 'космические', 'полеты', 'запущены', 'с', 'Байконура', '?']	0.1576	0.055	0.0	219.0
Which entities have the ""beginning of paths"" property set to ""Байконур"" (Q177477)?"	Какие космические полёты стартовали с Байконура?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P1427 wd:Q177477 }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'beginning', 'of', 'paths', ""''"", 'with', 'the', 'value', '``', 'Байконур', ""''"", '(', 'Q177477', ')', '?', 'Or', 'in', 'simpler', 'terms', ':', 'Which', 'entities', 'have', 'the', '``', 'beginning', 'of', 'paths', ""''"", 'property', 'set', 'to', '``', 'Байконур', ""''"", '(', 'Q177477', ')', '?']"	['Какие', 'космические', 'полёты', 'стартовали', 'с', 'Байконура', '?']	0.1576	0.055	0.0	219.0
24	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q158852 ; wdt:P1303 wd:Q8338 . } 
 Где:
 wdt:P106 именуется как ""род занятий.""
 wd:Q158852 именуется как ""дирижёр.""
 wdt:P1303 именуется как ""музыкальный инструмент.""
 wd:Q8338 именуется как ""труба.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that have the property ""occupation"" with value ""conductor"" and the property ""musical instrument"" with value ""trumpet""?"	Перечисите список всех трубачей, которые быи дирижерами оркестра?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q158852 ; wdt:P1303 wd:Q8338 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'occupation', ""''"", 'with', 'value', '``', 'conductor', ""''"", 'and', 'the', 'property', '``', 'musical', 'instrument', ""''"", 'with', 'value', '``', 'trumpet', ""''"", '?']"	['Перечисите', 'список', 'всех', 'трубачей', ',', 'которые', 'быи', 'дирижерами', 'оркестра', '?']	0.1693	0.1007	0.0	160.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that have the property ""occupation"" with value ""conductor"" and the property ""musical instrument"" with value ""trumpet""?"	Покажите список трубачей, которые были дирижерами?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q158852 ; wdt:P1303 wd:Q8338 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'occupation', ""''"", 'with', 'value', '``', 'conductor', ""''"", 'and', 'the', 'property', '``', 'musical', 'instrument', ""''"", 'with', 'value', '``', 'trumpet', ""''"", '?']"	['Покажите', 'список', 'трубачей', ',', 'которые', 'были', 'дирижерами', '?']	0.1693	0.0909	0.0	162.0
25	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q829 wdt:P421 ?timezone . ?uri wdt:P31 wd:Q35657 ; wdt:P421 ?timezone . FILTER(?uri != wd:Q829) } 
 Где:
 wd:Q829 именуется как ""Юта.""
 wdt:P421 именуется как ""часовой пояс.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q35657 именуется как ""штат США.""
 wdt:P421 именуется как ""часовой пояс.""
 wd:Q829 именуется как ""Юта.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of states in the United States, other than Utah, that have a different timezone?	Какие штаты США находятся в том же часов поясе, что и юта?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q829 wdt:P421 ?timezone . ?uri wdt:P31 wd:Q35657 ; wdt:P421 ?timezone . FILTER(?uri != wd:Q829) }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'states', 'in', 'the', 'United', 'States', ',', 'other', 'than', 'Utah', ',', 'that', 'have', 'a', 'different', 'timezone', '?']"	['Какие', 'штаты', 'США', 'находятся', 'в', 'том', 'же', 'часов', 'поясе', ',', 'что', 'и', 'юта', '?']	0.2122	0.3311	0.0	95.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of states in the United States, other than Utah, that have a different timezone?	Какие штаты США имеют тот же часовой пояс, что и Юта?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q829 wdt:P421 ?timezone . ?uri wdt:P31 wd:Q35657 ; wdt:P421 ?timezone . FILTER(?uri != wd:Q829) }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'states', 'in', 'the', 'United', 'States', ',', 'other', 'than', 'Utah', ',', 'that', 'have', 'a', 'different', 'timezone', '?']"	['Какие', 'штаты', 'США', 'имеют', 'тот', 'же', 'часовой', 'пояс', ',', 'что', 'и', 'Юта', '?']	0.2122	0.3218	0.0	96.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of states in the United States, other than Utah, that have a different timezone?	Какие штаты США имеют такой же часовой пояс как и Юта?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q829 wdt:P421 ?timezone . ?uri wdt:P31 wd:Q35657 ; wdt:P421 ?timezone . FILTER(?uri != wd:Q829) }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'states', 'in', 'the', 'United', 'States', ',', 'other', 'than', 'Utah', ',', 'that', 'have', 'a', 'different', 'timezone', '?']"	['Какие', 'штаты', 'США', 'имеют', 'такой', 'же', 'часовой', 'пояс', 'как', 'и', 'Юта', '?']	0.1785	0.1559	0.0	97.0
27	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q43247 wdt:P40 ?child . ?child wdt:P26 ?uri . } 
 Где:
 wd:Q43247 именуется как ""Ингрид Бергман.""
 wdt:P40 именуется как ""дети.""
 wdt:P26 именуется как ""супруг(а).""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the husbands (spouses) of the children of Ingrid Bergman?	За кем замужем дочь Ингрид Бергман?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q43247 wdt:P40 ?child . ?child wdt:P26 ?uri . }	['What', 'are', 'the', 'husbands', '(', 'spouses', ')', 'of', 'the', 'children', 'of', 'Ingrid', 'Bergman', '?']	['За', 'кем', 'замужем', 'дочь', 'Ингрид', 'Бергман', '?']	0.1897	0.2005	0.0	60.0
29	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q33506> . ?uri <http://www.wikidata.org/prop/direct/P276> <http://www.wikidata.org/entity/Q84> . } 
 Где:
 http://www.wikidata.org/prop/direct/P31 именуется как ""это частный случай понятия.""
 http://www.wikidata.org/entity/Q33506 именуется как ""музей.""
 http://www.wikidata.org/prop/direct/P276 именуется как ""местонахождение.""
 http://www.wikidata.org/entity/Q84 именуется как ""Лондон.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of museums that have the property ""this is a type of"" with the value ""museum"" and the property ""location"" with the value ""London""?"	Перечислите все музеи Лондона.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q33506> . ?uri <http://www.wikidata.org/prop/direct/P276> <http://www.wikidata.org/entity/Q84> . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'museums', 'that', 'have', 'the', 'property', '``', 'this', 'is', 'a', 'type', 'of', ""''"", 'with', 'the', 'value', '``', 'museum', ""''"", 'and', 'the', 'property', '``', 'location', ""''"", 'with', 'the', 'value', '``', 'London', ""''"", '?']"	['Перечислите', 'все', 'музеи', 'Лондона', '.']	0.0	0.0	0.0	155.0
31	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P54 wd:Q272059 ; wdt:P2048 ?height . } ORDER BY DESC(?height) LIMIT 1 
 Где:
 wdt:P54 именуется как ""член спортивной команды.""
 wd:Q272059 именуется как ""Атланта Фэлконс.""
 wdt:P2048 именуется как ""высота/рост.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the height of the team ""Atlanta Falcons"" with the most members in a sports team?"	Кто самый высокий игрок Атланта Фэлконс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P54 wd:Q272059 ; wdt:P2048 ?height . } ORDER BY DESC(?height) LIMIT 1	"['What', 'is', 'the', 'height', 'of', 'the', 'team', '``', 'Atlanta', 'Falcons', ""''"", 'with', 'the', 'most', 'members', 'in', 'a', 'sports', 'team', '?']"	['Кто', 'самый', 'высокий', 'игрок', 'Атланта', 'Фэлконс', '?']	0.1818	0.1404	0.0	82.0
33	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P106 wd:Q36180 . ?uri wdt:P166 wd:Q37922 . }  
 Где:
 wdt:P106 именуется как ""род занятий.""
 wd:Q36180 именуется как ""писатель.""
 wdt:P166 именуется как ""полученные награды.""
 wd:Q37922 именуется как ""Нобелевская премия по литературе.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which URI's represent writers who have received the Nobel Prize in Literature?	Назови всех писателей получивших Нобелевскую премию по литературе?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P106 wd:Q36180 . ?uri wdt:P166 wd:Q37922 . } 	"['Which', 'URI', ""'s"", 'represent', 'writers', 'who', 'have', 'received', 'the', 'Nobel', 'Prize', 'in', 'Literature', '?']"	['Назови', 'всех', 'писателей', 'получивших', 'Нобелевскую', 'премию', 'по', 'литературе', '?']	0.1897	0.2264	0.0	71.0
34	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q3665646> . ?uri <http://www.wikidata.org/prop/direct/P2048> ?height .  FILTER(?height > 200)} 
 Где:
 http://www.wikidata.org/prop/direct/P106 именуется как ""род занятий.""
 http://www.wikidata.org/entity/Q3665646 именуется как ""баскетболист.""
 http://www.wikidata.org/prop/direct/P2048 именуется как ""высота/рост.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of individuals who have the occupation of ""баскетболист"" and have a height/rost greater than 200?

(Note: In this question, "" URI's of individuals"" is used to refer to unique identifiers for entities in Wikidata, and ""occupation of 'баasketball player'"" refers to the property ""род занятий"" which holds the value ""баasketball player"" in Wikidata.)"	Покажи мне всех баскетболистов выше двух метров.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q3665646> . ?uri <http://www.wikidata.org/prop/direct/P2048> ?height .  FILTER(?height > 200)}	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'have', 'the', 'occupation', 'of', '``', 'баскетболист', ""''"", 'and', 'have', 'a', 'height/rost', 'greater', 'than', '200', '?', '(', 'Note', ':', 'In', 'this', 'question', ',', '``', 'URI', ""'s"", 'of', 'individuals', ""''"", 'is', 'used', 'to', 'refer', 'to', 'unique', 'identifiers', 'for', 'entities', 'in', 'Wikidata', ',', 'and', '``', 'occupation', 'of', ""'баasketball"", 'player', ""'"", ""''"", 'refers', 'to', 'the', 'property', '``', 'род', 'занятий', ""''"", 'which', 'holds', 'the', 'value', '``', 'баasketball', 'player', ""''"", 'in', 'Wikidata', '.', ')']"	['Покажи', 'мне', 'всех', 'баскетболистов', 'выше', 'двух', 'метров', '.']	0.1466	0.039	0.0	354.0
35	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?date WHERE { wd:Q9202 wdt:P571 ?date . } 
 Где:
 wd:Q9202 именуется как ""Статуя Свободы.""
 wdt:P571 именуется как ""дата основания / создания / возникновения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the distinct date when the Statue of Liberty was founded or created?	Когда была построена статуя свободы?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?date WHERE { wd:Q9202 wdt:P571 ?date . }	['What', 'is', 'the', 'distinct', 'date', 'when', 'the', 'Statue', 'of', 'Liberty', 'was', 'founded', 'or', 'created', '?']	['Когда', 'была', 'построена', 'статуя', 'свободы', '?']	0.1883	0.1723	0.0	71.0
36	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1204> <http://www.wikidata.org/prop/direct/P47> ?uri . } 
 Где:
 http://www.wikidata.org/entity/Q1204 именуется как ""Иллинойс.""
 http://www.wikidata.org/prop/direct/P47 именуется как ""имеет границы с.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that have ""Illinois"" as their boundary with?

(Note: In SPARQL, the question is already implied in the query structure itself, so there is no need for a verbatim translation into a question.)"	С какими штатами граничит Иллинойс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1204> <http://www.wikidata.org/prop/direct/P47> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', '``', 'Illinois', ""''"", 'as', 'their', 'boundary', 'with', '?', '(', 'Note', ':', 'In', 'SPARQL', ',', 'the', 'question', 'is', 'already', 'implied', 'in', 'the', 'query', 'structure', 'itself', ',', 'so', 'there', 'is', 'no', 'need', 'for', 'a', 'verbatim', 'translation', 'into', 'a', 'question', '.', ')']"	['С', 'какими', 'штатами', 'граничит', 'Иллинойс', '?']	0.1587	0.0528	0.0	226.0
37	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q49740 wdt:P178 ?uri . } 
 Где:
 wd:Q49740 именуется как ""Minecraft.""
 wdt:P178 именуется как ""разработчик.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI's of entities that have been developed by ""Minecraft"" (wd:Q49740)?"	Кто разработал Майнкрафт?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q49740 wdt:P178 ?uri . }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'been', 'developed', 'by', '``', 'Minecraft', ""''"", '(', 'wd', ':', 'Q49740', ')', '?']"	['Кто', 'разработал', 'Майнкрафт', '?']	0.1796	0.0909	0.0	92.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI's of entities that have been developed by ""Minecraft"" (wd:Q49740)?"	Кто создал Майнкрафт?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q49740 wdt:P178 ?uri . }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'been', 'developed', 'by', '``', 'Minecraft', ""''"", '(', 'wd', ':', 'Q49740', ')', '?']"	['Кто', 'создал', 'Майнкрафт', '?']	0.1796	0.0909	0.0	92.0
38	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q186924 wdt:P20 ?uri . } 
 Где:
 wd:Q186924 именуется как ""Словак, Хиллел.""
 wdt:P20 именуется как ""место смерти.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI's of the places where ""Hillel Slovak"" (wd:Q186924) passed away?"	Где умер Хиллел Словак?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q186924 wdt:P20 ?uri . }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'the', 'places', 'where', '``', 'Hillel', 'Slovak', ""''"", '(', 'wd', ':', 'Q186924', ')', 'passed', 'away', '?']"	['Где', 'умер', 'Хиллел', 'Словак', '?']	0.1796	0.1055	0.0	88.0
39	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q219512> . } 
 Где:
 http://www.wikidata.org/prop/direct/P161 именуется как ""в ролях.""
 http://www.wikidata.org/entity/Q219512 именуется как ""Джесси Айзенберг.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which URIs have the property ""in roles"" with the value ""Jessica Eisenberg"" (Q219512)?"	В каких фильмах сыграл Джесси Айзенберг?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q219512> . }	"['Which', 'URIs', 'have', 'the', 'property', '``', 'in', 'roles', ""''"", 'with', 'the', 'value', '``', 'Jessica', 'Eisenberg', ""''"", '(', 'Q219512', ')', '?']"	['В', 'каких', 'фильмах', 'сыграл', 'Джесси', 'Айзенберг', '?']	0.1818	0.1404	0.0	79.0
40	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q10843402 ; wdt:P19 wd:Q649 . } 
 Где:
 wdt:P106 именуется как ""род занятий.""
 wd:Q10843402 именуется как ""пловец.""
 wdt:P19 именуется как ""место рождения.""
 wd:Q649 именуется как ""Москва.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of individuals who have the occupation ""пловец"" (Q10843402) and were born in ""Москва"" (Q649)?"	Назови мне всех пловцов рожденных в Москве.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q10843402 ; wdt:P19 wd:Q649 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'individuals', 'who', 'have', 'the', 'occupation', '``', 'пловец', ""''"", '(', 'Q10843402', ')', 'and', 'were', 'born', 'in', '``', 'Москва', ""''"", '(', 'Q649', ')', '?']"	['Назови', 'мне', 'всех', 'пловцов', 'рожденных', 'в', 'Москве', '.']	0.0	0.0	0.0	115.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of individuals who have the occupation ""пловец"" (Q10843402) and were born in ""Москва"" (Q649)?"	Перечислите пловцов, родившихся в Москве	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q10843402 ; wdt:P19 wd:Q649 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'individuals', 'who', 'have', 'the', 'occupation', '``', 'пловец', ""''"", '(', 'Q10843402', ')', 'and', 'were', 'born', 'in', '``', 'Москва', ""''"", '(', 'Q649', ')', '?']"	['Перечислите', 'пловцов', ',', 'родившихся', 'в', 'Москве']	0.0	0.0	0.0	117.0
42	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q163740 . { ?uri wdt:P159 wd:Q39 . } UNION { ?uri wdt:P159 ?city . ?city wdt:P31 wd:Q70208 } } 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q163740 именуется как ""некоммерческая организация.""
 wdt:P159 именуется как ""расположение штаб-квартиры.""
 wd:Q39 именуется как ""Швейцария.""
 wdt:P159 именуется как ""расположение штаб-квартиры.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q70208 именуется как ""община Швейцарии.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of organizations that are based in Switzerland and have a headquarters located in a city?	Перечислите все швейцарские некоммерческие организации.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q163740 . { ?uri wdt:P159 wd:Q39 . } UNION { ?uri wdt:P159 ?city . ?city wdt:P31 wd:Q70208 } }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'organizations', 'that', 'are', 'based', 'in', 'Switzerland', 'and', 'have', 'a', 'headquarters', 'located', 'in', 'a', 'city', '?']"	['Перечислите', 'все', 'швейцарские', 'некоммерческие', 'организации', '.']	0.0	0.0	0.0	113.0
