id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the urban areas that are part of the administrative entity ""New Jersey"" and have a population greater than 100,000?"	Перечислите все города Нью-Джерси с населением более 100000 человек.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . ?uri <http://www.wikidata.org/prop/direct/P131>+ <http://www.wikidata.org/entity/Q1408> . ?uri <http://www.wikidata.org/prop/direct/P1082> ?population . FILTER(?population > 100000) }	"['What', 'are', 'the', 'urban', 'areas', 'that', 'are', 'part', 'of', 'the', 'administrative', 'entity', '``', 'New', 'Jersey', ""''"", 'and', 'have', 'a', 'population', 'greater', 'than', '100,000', '?']"	['Перечислите', 'все', 'города', 'Нью-Джерси', 'с', 'населением', 'более', '100000', 'человек', '.']	0.0	0.0	0.0	116.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the mountain URI's where the reported height in meters is greater than the height of Nanga Parbat (Q130736) ?	Какие горы выше Нанга Парбат?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/>  PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 . ?uri p:P2044 ?stmnode. ?stmnode psv:P2044 ?valuenode . ?valuenode wikibase:quantityAmount ?elevation . ?valuenode wikibase:quantityUnit ?unit . wd:Q130736 wdt:P2044 ?elevationNangaParbat . FILTER(?unit = wd:Q11573) FILTER (?elevation > ?elevationNangaParbat) }	"['What', 'are', 'the', 'mountain', 'URI', ""'s"", 'where', 'the', 'reported', 'height', 'in', 'meters', 'is', 'greater', 'than', 'the', 'height', 'of', 'Nanga', 'Parbat', '(', 'Q130736', ')', '?']"	['Какие', 'горы', 'выше', 'Нанга', 'Парбат', '?']	0.1774	0.1077	0.0	113.0
177	"Имея следующий SPARQL запрос: SELECT DISTINCT ?date WHERE {  <http://www.wikidata.org/entity/Q53713> <http://www.wikidata.org/prop/P570> ?date } 
 Где:
 http://www.wikidata.org/entity/Q53713 именуется как ""Улоф Пальме.""
 http://www.wikidata.org/prop/P570 именуется как ""дата смерти.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the distinct date of death for Ulof Palme?	Когда был застрелен Улоф Пальме?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?date WHERE {  <http://www.wikidata.org/entity/Q53713> <http://www.wikidata.org/prop/P570> ?date }	['What', 'is', 'the', 'distinct', 'date', 'of', 'death', 'for', 'Ulof', 'Palme', '?']	['Когда', 'был', 'застрелен', 'Улоф', 'Пальме', '?']	0.1941	0.235	0.0	45.0
178	"Имея следующий SPARQL запрос: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT * WHERE { ?res wdt:P39 wd:Q55375123 . } 
 Где:
 wdt:P39 именуется как ""занимаемая должность.""
 wd:Q55375123 именуется как ""древнеримский царь.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the entities that hold the position ""drevnerimsky king"" (Wikidata property P39)?"	Перечислите семь королей Рима.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT * WHERE { ?res wdt:P39 wd:Q55375123 . }	"['What', 'are', 'the', 'entities', 'that', 'hold', 'the', 'position', '``', 'drevnerimsky', 'king', ""''"", '(', 'Wikidata', 'property', 'P39', ')', '?']"	['Перечислите', 'семь', 'королей', 'Рима', '.']	0.0	0.0	0.0	86.0
179	"Имея следующий SPARQL запрос: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?uri WHERE {{ ?uri wdt:P19/wdt:P131* wd:Q1741 . { SELECT ?uri WHERE { ?uri wdt:P20 wd:Q64 . }}} UNION { ?uri wdt:P20/wdt:P131* wd:Q64 . { SELECT ?uri WHERE { ?uri wdt:P19 wd:Q1741 . }}} UNION { ?uri wdt:P19/wdt:P131+ wd:Q1741 . { SELECT ?uri WHERE { ?uri wdt:P20/wdt:P131+ wd:Q64 . }}}} 
 Где:
 wdt:P19 именуется как ""место рождения.""
 wdt:P131 именуется как ""административно-территориальная единица.""
 wd:Q1741 именуется как ""Вена.""
 wdt:P20 именуется как ""место смерти.""
 wd:Q64 именуется как ""Берлин.""
 wdt:P20 именуется как ""место смерти.""
 wdt:P131 именуется как ""административно-территориальная единица.""
 wd:Q64 именуется как ""Берлин.""
 wdt:P19 именуется как ""место рождения.""
 wd:Q1741 именуется как ""Вена.""
 wdt:P19 именуется как ""место рождения.""
 wdt:P131 именуется как ""административно-территориальная единица.""
 wd:Q1741 именуется как ""Вена.""
 wdt:P20 именуется как ""место смерти.""
 wdt:P131 именуется как ""административно-территориальная единица.""
 wd:Q64 именуется как ""Берлин.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which URI identifiers represent individuals who were born in Vienna and died in Berlin or were born in Vienna and spent some time in an administrative unit before dying in Berlin?	Перечислите всех людей, рожденных с Венне и умерших в Берлине.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?uri WHERE {{ ?uri wdt:P19/wdt:P131* wd:Q1741 . { SELECT ?uri WHERE { ?uri wdt:P20 wd:Q64 . }}} UNION { ?uri wdt:P20/wdt:P131* wd:Q64 . { SELECT ?uri WHERE { ?uri wdt:P19 wd:Q1741 . }}} UNION { ?uri wdt:P19/wdt:P131+ wd:Q1741 . { SELECT ?uri WHERE { ?uri wdt:P20/wdt:P131+ wd:Q64 . }}}}	['Which', 'URI', 'identifiers', 'represent', 'individuals', 'who', 'were', 'born', 'in', 'Vienna', 'and', 'died', 'in', 'Berlin', 'or', 'were', 'born', 'in', 'Vienna', 'and', 'spent', 'some', 'time', 'in', 'an', 'administrative', 'unit', 'before', 'dying', 'in', 'Berlin', '?']	['Перечислите', 'всех', 'людей', ',', 'рожденных', 'с', 'Венне', 'и', 'умерших', 'в', 'Берлине', '.']	0.0	0.0	0.0	170.0
180	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12206942 wdt:P40 wd:Q51746 . } 
 Где:
 wd:Q12206942 именуется как ""Дарт Вейдер.""
 wdt:P40 именуется как ""дети.""
 wd:Q51746 именуется как ""Люк Скайуокер.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Does the entity with the label ""Dart Vader"" have a child named ""Luke Skywalker""?"	Отец Люка - Дарт Вейдер?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12206942 wdt:P40 wd:Q51746 . }	"['Does', 'the', 'entity', 'with', 'the', 'label', '``', 'Dart', 'Vader', ""''"", 'have', 'a', 'child', 'named', '``', 'Luke', 'Skywalker', ""''"", '?']"	['Отец', 'Люка', '-', 'Дарт', 'Вейдер', '?']	0.1831	0.1361	0.0	75.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that represent a brewery and are located in Australia according to Wikidata? (where ""brewery"" is a subclass of ""piwarnya"" or ""пивоварня"" and their location is specified by the ""государство"" or ""country"" property with value ""Австралия"" or ""Австралия"")."	Покажи мне все пивоварни в Австралии.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q131734 . ?uri wdt:P17 wd:Q408 . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'represent', 'a', 'brewery', 'and', 'are', 'located', 'in', 'Australia', 'according', 'to', 'Wikidata', '?', '(', 'where', '``', 'brewery', ""''"", 'is', 'a', 'subclass', 'of', '``', 'piwarnya', ""''"", 'or', '``', 'пивоварня', ""''"", 'and', 'their', 'location', 'is', 'specified', 'by', 'the', '``', 'государство', ""''"", 'or', '``', 'country', ""''"", 'property', 'with', 'value', '``', 'Австралия', ""''"", 'or', '``', 'Австралия', ""''"", ')', '.']"	['Покажи', 'мне', 'все', 'пивоварни', 'в', 'Австралии', '.']	0.152	0.0446	0.0	277.0
182	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P162 wd:Q8877 ; wdt:P31/wdt:P279* wd:Q11424 ; wdt:P2130 ?cost . FILTER(?cost > 80000000)} 
 Где:
 wdt:P162 именуется как ""продюсер.""
 wd:Q8877 именуется как ""Стивен Спилберг.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q11424 именуется как ""фильм.""
 wdt:P2130 именуется как ""стоимость.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of films produced by Steven Spielberg and have a cost greater than 80 million dollars, that are subclasses of or directly belong to the film category, and are not the most general class (i.e. have specific subclasses)?	Назови мне все фильмы спродюсированные Стивеном Спилбергом с бюджетом не менее 80 миллионов долларов.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P162 wd:Q8877 ; wdt:P31/wdt:P279* wd:Q11424 ; wdt:P2130 ?cost . FILTER(?cost > 80000000)}	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'produced', 'by', 'Steven', 'Spielberg', 'and', 'have', 'a', 'cost', 'greater', 'than', '80', 'million', 'dollars', ',', 'that', 'are', 'subclasses', 'of', 'or', 'directly', 'belong', 'to', 'the', 'film', 'category', ',', 'and', 'are', 'not', 'the', 'most', 'general', 'class', '(', 'i.e', '.', 'have', 'specific', 'subclasses', ')', '?']"	['Назови', 'мне', 'все', 'фильмы', 'спродюсированные', 'Стивеном', 'Спилбергом', 'с', 'бюджетом', 'не', 'менее', '80', 'миллионов', 'долларов', '.']	0.1888	0.1595	0.04	232.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of football clubs that are a subclass of ""Футбольный клуб"" and located in the country ""Испания"" (Spain)?"	Назови мне все футбольные клубы Испании.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q476028> . ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q29> . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'football', 'clubs', 'that', 'are', 'a', 'subclass', 'of', '``', 'Футбольный', 'клуб', ""''"", 'and', 'located', 'in', 'the', 'country', '``', 'Испания', ""''"", '(', 'Spain', ')', '?']"	['Назови', 'мне', 'все', 'футбольные', 'клубы', 'Испании', '.']	0.0	0.0	0.0	109.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the films that have the property ""this is a subclass of: <http://www.wikidata.org/entity/Q11424>"" (film), have the actor <http://www.wikidata.org/entity/Q37876> (Natalie Portman) in the role <http://www.wikidata.org/prop/direct/P161> (in roles), and have a producer ?uri using the property <http://www.wikidata.org/prop/direct/P162> (producer)?"	Кто продюсировал фильмы с участием Натали Портман?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?film <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?film <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q37876> . ?film <http://www.wikidata.org/prop/direct/P162> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'films', 'that', 'have', 'the', 'property', '``', 'this', 'is', 'a', 'subclass', 'of', ':', '<', 'http', ':', '//www.wikidata.org/entity/Q11424', '>', ""''"", '(', 'film', ')', ',', 'have', 'the', 'actor', '<', 'http', ':', '//www.wikidata.org/entity/Q37876', '>', '(', 'Natalie', 'Portman', ')', 'in', 'the', 'role', '<', 'http', ':', '//www.wikidata.org/prop/direct/P161', '>', '(', 'in', 'roles', ')', ',', 'and', 'have', 'a', 'producer', '?', 'uri', 'using', 'the', 'property', '<', 'http', ':', '//www.wikidata.org/prop/direct/P162', '>', '(', 'producer', ')', '?']"	['Кто', 'продюсировал', 'фильмы', 'с', 'участием', 'Натали', 'Портман', '?']	0.148	0.0411	0.0	368.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the films that have the property ""this is a subclass of: <http://www.wikidata.org/entity/Q11424>"" (film), have the actor <http://www.wikidata.org/entity/Q37876> (Natalie Portman) in the role <http://www.wikidata.org/prop/direct/P161> (in roles), and have a producer ?uri using the property <http://www.wikidata.org/prop/direct/P162> (producer)?"	Кто продюссировал фильмы с участием Натали Портман?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?film <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?film <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q37876> . ?film <http://www.wikidata.org/prop/direct/P162> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'films', 'that', 'have', 'the', 'property', '``', 'this', 'is', 'a', 'subclass', 'of', ':', '<', 'http', ':', '//www.wikidata.org/entity/Q11424', '>', ""''"", '(', 'film', ')', ',', 'have', 'the', 'actor', '<', 'http', ':', '//www.wikidata.org/entity/Q37876', '>', '(', 'Natalie', 'Portman', ')', 'in', 'the', 'role', '<', 'http', ':', '//www.wikidata.org/prop/direct/P161', '>', '(', 'in', 'roles', ')', ',', 'and', 'have', 'a', 'producer', '?', 'uri', 'using', 'the', 'property', '<', 'http', ':', '//www.wikidata.org/prop/direct/P162', '>', '(', 'producer', ')', '?']"	['Кто', 'продюссировал', 'фильмы', 'с', 'участием', 'Натали', 'Портман', '?']	0.148	0.0411	0.0	368.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI identifiers of entities that are subclasses of ""German Shepherd"" (wd:Q38280) but are not ""German Shepherd"" itself?"	Назови мне все виды парод немецкой овчарки.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279* wd:Q38280 FILTER(?uri != wd:Q38280) }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'are', 'subclasses', 'of', '``', 'German', 'Shepherd', ""''"", '(', 'wd', ':', 'Q38280', ')', 'but', 'are', 'not', '``', 'German', 'Shepherd', ""''"", 'itself', '?']"	['Назови', 'мне', 'все', 'виды', 'парод', 'немецкой', 'овчарки', '.']	0.0	0.0	0.0	134.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which member of the Chicago Bulls team has the greatest mass value (in kilograms or pounds) recorded for their career start date, excluding those with an recorded end date or an end career date?	Кто самый тяжелый игрок Чикаго Буллз?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P54 wd:Q128109 ; p:P54 ?memberOfStatement . ?memberOfStatement a wikibase:BestRank; ?_ wd:Q128109 ; pq:P580 ?startTime . MINUS { ?memberOfStatement pq:P582 ?endTime . } MINUS { ?uri wdt:P2032 ?endCareer . } ?uri p:P2067 ?stmnode . ?stmnode psv:P2067 ?valuenode . ?valuenode wikibase:quantityAmount ?mass . ?valuenode wikibase:quantityUnit ?unit . BIND(IF(?unit = wd:Q11570, ?mass, ?mass*0.453592) AS ?massUnified) } ORDER BY DESC(?massUnified) LIMIT 1	['Which', 'member', 'of', 'the', 'Chicago', 'Bulls', 'team', 'has', 'the', 'greatest', 'mass', 'value', '(', 'in', 'kilograms', 'or', 'pounds', ')', 'recorded', 'for', 'their', 'career', 'start', 'date', ',', 'excluding', 'those', 'with', 'an', 'recorded', 'end', 'date', 'or', 'an', 'end', 'career', 'date', '?']	['Кто', 'самый', 'тяжелый', 'игрок', 'Чикаго', 'Буллз', '?']	0.1655	0.0739	0.0	188.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Which member of the Chicago Bulls team has the greatest mass value (in kilograms or pounds) recorded for their career start date, excluding those with an recorded end date or an end career date?	Кто из игроков Чикаго Буллс самый тяжелый?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P54 wd:Q128109 ; p:P54 ?memberOfStatement . ?memberOfStatement a wikibase:BestRank; ?_ wd:Q128109 ; pq:P580 ?startTime . MINUS { ?memberOfStatement pq:P582 ?endTime . } MINUS { ?uri wdt:P2032 ?endCareer . } ?uri p:P2067 ?stmnode . ?stmnode psv:P2067 ?valuenode . ?valuenode wikibase:quantityAmount ?mass . ?valuenode wikibase:quantityUnit ?unit . BIND(IF(?unit = wd:Q11570, ?mass, ?mass*0.453592) AS ?massUnified) } ORDER BY DESC(?massUnified) LIMIT 1	['Which', 'member', 'of', 'the', 'Chicago', 'Bulls', 'team', 'has', 'the', 'greatest', 'mass', 'value', '(', 'in', 'kilograms', 'or', 'pounds', ')', 'recorded', 'for', 'their', 'career', 'start', 'date', ',', 'excluding', 'those', 'with', 'an', 'recorded', 'end', 'date', 'or', 'an', 'end', 'career', 'date', '?']	['Кто', 'из', 'игроков', 'Чикаго', 'Буллс', 'самый', 'тяжелый', '?']	0.1655	0.0789	0.0	187.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the uri of the concept that is a subclass of a state and has the largest area?	Какая самая большая страна в мире?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31>/<http://www.wikidata.org/prop/direct/P279>* <http://www.wikidata.org/entity/Q3624078> . ?uri <http://www.wikidata.org/prop/direct/P2046> ?area . } ORDER BY DESC(?area) LIMIT 1	['What', 'is', 'the', 'uri', 'of', 'the', 'concept', 'that', 'is', 'a', 'subclass', 'of', 'a', 'state', 'and', 'has', 'the', 'largest', 'area', '?']	['Какая', 'самая', 'большая', 'страна', 'в', 'мире', '?']	0.1818	0.1404	0.0	80.0
189	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P17 wd:Q30 . ?res wdt:P31/wdt:P279* wd:Q515 . ?res wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1 
 Где:
 wdt:P17 именуется как ""государство.""
 wd:Q30 именуется как ""США.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q515 именуется как ""город.""
 wdt:P1082 именуется как ""численность населения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the city with the largest population that is a part of the United States and is a subclass of a country or a state?	Какой самый большой город в Америке?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P17 wd:Q30 . ?res wdt:P31/wdt:P279* wd:Q515 . ?res wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1	['What', 'is', 'the', 'city', 'with', 'the', 'largest', 'population', 'that', 'is', 'a', 'part', 'of', 'the', 'United', 'States', 'and', 'is', 'a', 'subclass', 'of', 'a', 'country', 'or', 'a', 'state', '?']	['Какой', 'самый', 'большой', 'город', 'в', 'Америке', '?']	0.1745	0.104	0.0	117.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the city with the largest population that is a part of the United States and is a subclass of a country or a state?	Самый крупный город Америки?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P17 wd:Q30 . ?res wdt:P31/wdt:P279* wd:Q515 . ?res wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1	['What', 'is', 'the', 'city', 'with', 'the', 'largest', 'population', 'that', 'is', 'a', 'part', 'of', 'the', 'United', 'States', 'and', 'is', 'a', 'subclass', 'of', 'a', 'country', 'or', 'a', 'state', '?']	['Самый', 'крупный', 'город', 'Америки', '?']	0.1745	0.086	0.0	119.0
190	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/>  SELECT ?res WHERE { wd:Q1471987 wdt:P571 ?founded . ?res wdt:P39 wd:Q19546 . ?res p:P39 _:a . _:a ps:P39 wd:Q19546 . _:a pq:P580 ?start . _:a pq:P582 ?end . FILTER( ?start <= ?founded && ?founded <= ?end) . } 
 Где:
 wdt:P571 именуется как ""дата основания / создания / возникновения.""
 wdt:P39 именуется как ""занимаемая должность.""
 wd:Q19546 именуется как ""Папа Римский.""
 p:P39 именуется как ""занимаемая должность.""
 ps:P39 именуется как ""занимаемая должность.""
 wd:Q19546 именуется как ""Папа Римский.""
 pq:P580 именуется как ""дата начала.""
 pq:P582 именуется как ""дата окончания.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the dates (both starting and ending) of the papacies (the occupied position of the Pope) for the entity with ID ""Папа Римский"" (wd:Q19546), where the year of foundation (wd:P571) falls between the start date (pq:P580) and end date (pq:P582)?"	Какой папа римский основал телевидение Ватикана?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/>  SELECT ?res WHERE { wd:Q1471987 wdt:P571 ?founded . ?res wdt:P39 wd:Q19546 . ?res p:P39 _:a . _:a ps:P39 wd:Q19546 . _:a pq:P580 ?start . _:a pq:P582 ?end . FILTER( ?start <= ?founded && ?founded <= ?end) . }	"['What', 'are', 'the', 'dates', '(', 'both', 'starting', 'and', 'ending', ')', 'of', 'the', 'papacies', '(', 'the', 'occupied', 'position', 'of', 'the', 'Pope', ')', 'for', 'the', 'entity', 'with', 'ID', '``', 'Папа', 'Римский', ""''"", '(', 'wd', ':', 'Q19546', ')', ',', 'where', 'the', 'year', 'of', 'foundation', '(', 'wd', ':', 'P571', ')', 'falls', 'between', 'the', 'start', 'date', '(', 'pq', ':', 'P580', ')', 'and', 'end', 'date', '(', 'pq', ':', 'P582', ')', '?']"	['Какой', 'папа', 'римский', 'основал', 'телевидение', 'Ватикана', '?']	0.1511	0.0432	0.0	235.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the dates (both starting and ending) of the papacies (the occupied position of the Pope) for the entity with ID ""Папа Римский"" (wd:Q19546), where the year of foundation (wd:P571) falls between the start date (pq:P580) and end date (pq:P582)?"	Кто из понтификов основал телевидение Ватикана?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/>  SELECT ?res WHERE { wd:Q1471987 wdt:P571 ?founded . ?res wdt:P39 wd:Q19546 . ?res p:P39 _:a . _:a ps:P39 wd:Q19546 . _:a pq:P580 ?start . _:a pq:P582 ?end . FILTER( ?start <= ?founded && ?founded <= ?end) . }	"['What', 'are', 'the', 'dates', '(', 'both', 'starting', 'and', 'ending', ')', 'of', 'the', 'papacies', '(', 'the', 'occupied', 'position', 'of', 'the', 'Pope', ')', 'for', 'the', 'entity', 'with', 'ID', '``', 'Папа', 'Римский', ""''"", '(', 'wd', ':', 'Q19546', ')', ',', 'where', 'the', 'year', 'of', 'foundation', '(', 'wd', ':', 'P571', ')', 'falls', 'between', 'the', 'start', 'date', '(', 'pq', ':', 'P580', ')', 'and', 'end', 'date', '(', 'pq', ':', 'P582', ')', '?']"	['Кто', 'из', 'понтификов', 'основал', 'телевидение', 'Ватикана', '?']	0.1511	0.0432	0.0	241.0
191	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q596> <http://www.wikidata.org/prop/direct/P61> ?uri  . } 
 Где:
 http://www.wikidata.org/entity/Q596 именуется как ""Церера.""
 http://www.wikidata.org/prop/direct/P61 именуется как ""первооткрыватель или изобретатель.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of the entities that were discovered or invented by Ceres (<http://www.wikidata.org/entity/Q596>)?	Кто открыл Цереру?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q596> <http://www.wikidata.org/prop/direct/P61> ?uri  . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'were', 'discovered', 'or', 'invented', 'by', 'Ceres', '(', '<', 'http', ':', '//www.wikidata.org/entity/Q596', '>', ')', '?']"	['Кто', 'открыл', 'Цереру', '?']	0.1774	0.0833	0.0	123.0
192	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q55> <http://www.wikidata.org/prop/direct/P35> ?uri . ?uri <http://www.wikidata.org/prop/direct/P39> <http://www.wikidata.org/entity/Q2045066> . } 
 Где:
 http://www.wikidata.org/entity/Q55 именуется как ""Нидерланды.""
 http://www.wikidata.org/prop/direct/P35 именуется как ""глава государства.""
 http://www.wikidata.org/prop/direct/P39 именуется как ""занимаемая должность.""
 http://www.wikidata.org/entity/Q2045066 именуется как ""монарх Нидерландов.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of individuals who are the head of state of the Netherlands and hold the position of monarch?	Кто являесятся королем Голандии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q55> <http://www.wikidata.org/prop/direct/P35> ?uri . ?uri <http://www.wikidata.org/prop/direct/P39> <http://www.wikidata.org/entity/Q2045066> . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'are', 'the', 'head', 'of', 'state', 'of', 'the', 'Netherlands', 'and', 'hold', 'the', 'position', 'of', 'monarch', '?']"	['Кто', 'являесятся', 'королем', 'Голандии', '?']	0.1774	0.0967	0.0	117.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of individuals who are the head of state of the Netherlands and hold the position of monarch?	Кто король Нидерландов?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q55> <http://www.wikidata.org/prop/direct/P35> ?uri . ?uri <http://www.wikidata.org/prop/direct/P39> <http://www.wikidata.org/entity/Q2045066> . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'are', 'the', 'head', 'of', 'state', 'of', 'the', 'Netherlands', 'and', 'hold', 'the', 'position', 'of', 'monarch', '?']"	['Кто', 'король', 'Нидерландов', '?']	0.1774	0.0833	0.0	118.0
193	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q134041 wdt:P279+ wd:Q40050 . } 
 Где:
 wd:Q134041 именуется как ""кола.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q40050 именуется как ""напиток.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Is there a substance with the label ""cola"" that is a subclass of the class ""beverage"" or ""drink"" in Wikidata?"	Является ли Кола напитком?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q134041 wdt:P279+ wd:Q40050 . }	"['Is', 'there', 'a', 'substance', 'with', 'the', 'label', '``', 'cola', ""''"", 'that', 'is', 'a', 'subclass', 'of', 'the', 'class', '``', 'beverage', ""''"", 'or', '``', 'drink', ""''"", 'in', 'Wikidata', '?']"	['Является', 'ли', 'Кола', 'напитком', '?']	0.1745	0.086	0.0	105.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Is there a substance with the label ""cola"" that is a subclass of the class ""beverage"" or ""drink"" in Wikidata?"	Кола - это напиток?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q134041 wdt:P279+ wd:Q40050 . }	"['Is', 'there', 'a', 'substance', 'with', 'the', 'label', '``', 'cola', ""''"", 'that', 'is', 'a', 'subclass', 'of', 'the', 'class', '``', 'beverage', ""''"", 'or', '``', 'drink', ""''"", 'in', 'Wikidata', '?']"	['Кола', '-', 'это', 'напиток', '?']	0.1745	0.086	0.0	105.0
194	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q567 wdt:P69 ?res . ?res wdt:P31/wdt:P279* wd:Q3918 . } 
 Где:
 wd:Q567 именуется как ""Ангела Меркель.""
 wdt:P69 именуется как ""учебное заведение.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q3918 именуется как ""университет.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the university that Angela Merkel attended?	Какой университет является альма-матер канцелра Германии Ангелы Меркель?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q567 wdt:P69 ?res . ?res wdt:P31/wdt:P279* wd:Q3918 . }	['What', 'is', 'the', 'university', 'that', 'Angela', 'Merkel', 'attended', '?']	['Какой', 'университет', 'является', 'альма-матер', 'канцелра', 'Германии', 'Ангелы', 'Меркель', '?']	0.1969	0.3522	0.0	65.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the university that Angela Merkel attended?	Какой университет окончила канцлер Германии Ангела Меркель?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q567 wdt:P69 ?res . ?res wdt:P31/wdt:P279* wd:Q3918 . }	['What', 'is', 'the', 'university', 'that', 'Angela', 'Merkel', 'attended', '?']	['Какой', 'университет', 'окончила', 'канцлер', 'Германии', 'Ангела', 'Меркель', '?']	0.1969	0.3333	0.0	54.0
195	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?res WHERE { wd:Q1163227 wdt:P50 ?res. } 
 Где:
 wd:Q1163227 именуется как ""Столпы Земли.""
 wdt:P50 именуется как ""автор.""
