id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which universities has Angela Merkel visited?	An welcher Universität studierte die deutsche Kanzlerin Angela Merkel?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q567 wdt:P69 ?res . ?res wdt:P31/wdt:P279* wd:Q3918 . }	['Which', 'universities', 'has', 'Angela', 'Merkel', 'visited', '?']	['An', 'welcher', 'Universität', 'studierte', 'die', 'deutsche', 'Kanzlerin', 'Angela', 'Merkel', '?']	0.1499	0.8327	0.1333	47.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of the airline hubs connected to Yeti Airlines?	Welche Flughäfen bedient Yeti Airlines?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1480118 wdt:P113 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'airline', 'hubs', 'connected', 'to', 'Yeti', 'Airlines', '?']"	['Welche', 'Flughäfen', 'bedient', 'Yeti', 'Airlines', '?']	0.1459	0.517	0.2353	47.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the birthplace of Johann Wolfgang von Goethe?	Wo wurde Goethe geboren?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q5879 wdt:P19 ?res . } 	['What', 'is', 'the', 'birthplace', 'of', 'Johann', 'Wolfgang', 'von', 'Goethe', '?']	['Wo', 'wurde', 'Goethe', 'geboren', '?']	0.2325	0.4644	0.0	41.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct Uris of the ingredients that make up a Rüeblitorte?	Welche Zutaten braucht man für einen Karottenkuchen?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q656071 wdt:P527 ?uri . }	['What', 'are', 'the', 'distinct', 'Uris', 'of', 'the', 'ingredients', 'that', 'make', 'up', 'a', 'Rüeblitorte', '?']	['Welche', 'Zutaten', 'braucht', 'man', 'für', 'einen', 'Karottenkuchen', '?']	0.1897	0.2143	0.0	55.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the mountain (Berg) with the greatest height that lies in the administrative unit (Verwaltungseinheit) of Sachsen (Sachsen)?	Wie heißt der höchste Berg in Sachsen?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P31 wd:Q8502 . ?res wdt:P131+ wd:Q1202 . ?res wdt:P2044 ?height . } ORDER BY DESC(?height) LIMIT 1	['What', 'is', 'the', 'mountain', '(', 'Berg', ')', 'with', 'the', 'greatest', 'height', 'that', 'lies', 'in', 'the', 'administrative', 'unit', '(', 'Verwaltungseinheit', ')', 'of', 'Sachsen', '(', 'Sachsen', ')', '?']	['Wie', 'heißt', 'der', 'höchste', 'Berg', 'in', 'Sachsen', '?']	0.2481	0.4615	0.0833	101.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which public office or position has started most recently among those that the given resource holds, and what is the start time for that public office or position, which is the German Federal Finance Minister?	Wer ist momentan Finanzminister in Deutschland?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/>  SELECT ?res WHERE { ?res p:P39 _:a . _:a ps:P39 wd:Q22575092 . :a pq:P580 ?start . } ORDER BY DESC(?start) LIMIT 1	['Which', 'public', 'office', 'or', 'position', 'has', 'started', 'most', 'recently', 'among', 'those', 'that', 'the', 'given', 'resource', 'holds', ',', 'and', 'what', 'is', 'the', 'start', 'time', 'for', 'that', 'public', 'office', 'or', 'position', ',', 'which', 'is', 'the', 'German', 'Federal', 'Finance', 'Minister', '?']	['Wer', 'ist', 'momentan', 'Finanzminister', 'in', 'Deutschland', '?']	0.1655	0.0739	0.0	173.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinctive districts (wd:Q5800) that are administratively part of the country (wd:Q6256) Mekka?	Zu welchem Land gehört Mekka?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?res WHERE { wd:Q5806 wdt:P131+ ?res . ?res wdt:P31 wd:Q6256 . }	['What', 'are', 'the', 'distinctive', 'districts', '(', 'wd', ':', 'Q5800', ')', 'that', 'are', 'administratively', 'part', 'of', 'the', 'country', '(', 'wd', ':', 'Q6256', ')', 'Mekka', '?']	['Zu', 'welchem', 'Land', 'gehört', 'Mekka', '?']	0.122	0.2154	0.1111	91.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What is the state or local government administrative unit that the ""State University of Pennsylvania"" is a part of, and what is the superclass of that administrative unit?"	Zu welchem Bundesstaat gehört die Penn State Universität?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q739627 wdt:P131 ?res . ?res wdt:P31/wdt:P279* wd:Q106458883 . }	"['What', 'is', 'the', 'state', 'or', 'local', 'government', 'administrative', 'unit', 'that', 'the', '``', 'State', 'University', 'of', 'Pennsylvania', ""''"", 'is', 'a', 'part', 'of', ',', 'and', 'what', 'is', 'the', 'superclass', 'of', 'that', 'administrative', 'unit', '?']"	['Zu', 'welchem', 'Bundesstaat', 'gehört', 'die', 'Penn', 'State', 'Universität', '?']	0.2022	0.1981	0.0	135.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which Stadion, as determined by the given properties, has the highest capacity in Spain or is a subclass of Stadion, and what is its capacity value?	Welches ist das größte Stadion in Spanien?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q483110> .  } UNION { ?uri <http://www.wikidata.org/prop/direct/P31> ?type . ?type <http://www.wikidata.org/prop/direct/P279> <http://www.wikidata.org/entity/Q483110> } ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q29> .  ?uri <http://www.wikidata.org/prop/direct/P1083> ?num .  } ORDER BY DESC(?num) LIMIT 1	['Which', 'Stadion', ',', 'as', 'determined', 'by', 'the', 'given', 'properties', ',', 'has', 'the', 'highest', 'capacity', 'in', 'Spain', 'or', 'is', 'a', 'subclass', 'of', 'Stadion', ',', 'and', 'what', 'is', 'its', 'capacity', 'value', '?']	['Welches', 'ist', 'das', 'größte', 'Stadion', 'in', 'Spanien', '?']	0.226	0.3	0.069	120.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which area has the United Kingdom a total size of?	Wie groß ist die Fläche des Vereinigten Königsreichs?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?area WHERE { wd:Q145 wdt:P2046 ?area . }	['Which', 'area', 'has', 'the', 'United', 'Kingdom', 'a', 'total', 'size', 'of', '?']	['Wie', 'groß', 'ist', 'die', 'Fläche', 'des', 'Vereinigten', 'Königsreichs', '?']	0.1941	0.2882	0.0	41.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of entities that are the authors of ""Batman""?"	Wer hat Batmann erfunden?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q2695156 wdt:P170 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'are', 'the', 'authors', 'of', '``', 'Batman', ""''"", '?']"	['Wer', 'hat', 'Batmann', 'erfunden', '?']	0.1856	0.1366	0.0	58.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of entities that are the authors of ""Batman""?"	Von wem ist Batman?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q2695156 wdt:P170 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'are', 'the', 'authors', 'of', '``', 'Batman', ""''"", '?']"	['Von', 'wem', 'ist', 'Batman', '?']	0.2207	0.2732	0.0	59.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which distinct URI's represent films that have a director, who is a subclass of ""Film director"" (Francis Ford Coppola) and belong to the film genre?"	In welchen Filmen hat Francis Ford Coppola Regie geführt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q11424 ; wdt:P57 wd:Q56094 . }	"['Which', 'distinct', 'URI', ""'s"", 'represent', 'films', 'that', 'have', 'a', 'director', ',', 'who', 'is', 'a', 'subclass', 'of', '``', 'Film', 'director', ""''"", '(', 'Francis', 'Ford', 'Coppola', ')', 'and', 'belong', 'to', 'the', 'film', 'genre', '?']"	['In', 'welchen', 'Filmen', 'hat', 'Francis', 'Ford', 'Coppola', 'Regie', 'geführt', '?']	0.0882	0.4152	0.0606	105.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Is there a superordinate taxon for the Laubfrösche (Q53696) that belongs to the Amphibien (Q10908) taxonomic group?	Gehören Baumsteiger zu den Amphibien?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q53696> <http://www.wikidata.org/prop/direct/P171>* <http://www.wikidata.org/entity/Q10908> . }	['Is', 'there', 'a', 'superordinate', 'taxon', 'for', 'the', 'Laubfrösche', '(', 'Q53696', ')', 'that', 'belongs', 'to', 'the', 'Amphibien', '(', 'Q10908', ')', 'taxonomic', 'group', '?']	['Gehören', 'Baumsteiger', 'zu', 'den', 'Amphibien', '?']	0.2135	0.235	0.0	91.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of the administrative units in which the Westminster Palace lies?	Wo hat das britische Parlament seinen Sitz?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q62408 wdt:P131 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'administrative', 'units', 'in', 'which', 'the', 'Westminster', 'Palace', 'lies', '?']"	['Wo', 'hat', 'das', 'britische', 'Parlament', 'seinen', 'Sitz', '?']	0.1856	0.1765	0.0	70.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the URI of the monarch of England with the earliest known start date for their public office or position?	Wer war der erste König von Engeland?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P39 wd:Q18810062 . ?uri p:P39 ?stmnode . ?stmnode pq:P580 ?startDate . } ORDER BY ?startDate LIMIT 1	['What', 'is', 'the', 'URI', 'of', 'the', 'monarch', 'of', 'England', 'with', 'the', 'earliest', 'known', 'start', 'date', 'for', 'their', 'public', 'office', 'or', 'position', '?']	['Wer', 'war', 'der', 'erste', 'König', 'von', 'Engeland', '?']	0.1796	0.1364	0.0	93.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of the entities that have been acknowledged or honored by Douglas R. Hofstadter?	Welchen Preis gewann Douglas Hofstadter?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q319308> <http://www.wikidata.org/prop/direct/P166> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'have', 'been', 'acknowledged', 'or', 'honored', 'by', 'Douglas', 'R.', 'Hofstadter', '?']"	['Welchen', 'Preis', 'gewann', 'Douglas', 'Hofstadter', '?']	0.1465	0.3877	0.1818	74.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which Dart player has the most recent recorded birthdate?	Wer ist der jüngste Darts-Spieler?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q18574233 ; wdt:P569 ?dateOfBirth . } ORDER BY DESC(?dateOfBirth) LIMIT 1	['Which', 'Dart', 'player', 'has', 'the', 'most', 'recent', 'recorded', 'birthdate', '?']	['Wer', 'ist', 'der', 'jüngste', 'Darts-Spieler', '?']	0.1955	0.2585	0.0	43.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the sport type that is a subclass of horse racing?	Ist Pferderennen einen Sport?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q187916 wdt:P279* wd:Q349 . }	['What', 'is', 'the', 'sport', 'type', 'that', 'is', 'a', 'subclass', 'of', 'horse', 'racing', '?']	['Ist', 'Pferderennen', 'einen', 'Sport', '?']	0.1911	0.1786	0.0	48.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which leader of a government or administration in the United States started their term after the seventh leader with the earliest start time, as recorded in Wikidata?	Wer war der 8. Präsident der Vereinigten Staaten?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { wd:Q30 p:P6 ?statement . ?statement pq:P580 ?startTime ; ps:P6 ?uri . } ORDER BY ?startTime OFFSET 7 LIMIT 1	['Which', 'leader', 'of', 'a', 'government', 'or', 'administration', 'in', 'the', 'United', 'States', 'started', 'their', 'term', 'after', 'the', 'seventh', 'leader', 'with', 'the', 'earliest', 'start', 'time', ',', 'as', 'recorded', 'in', 'Wikidata', '?']	['Wer', 'war', 'der', '8', '.', 'Präsident', 'der', 'Vereinigten', 'Staaten', '?']	0.1726	0.1145	0.0	133.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of entities that have the property ""Einwohnerzahl"" (population) with the entity ""Europäische Union"" (European Union) as the subject?"	Wie viele Einwohner hat die Europäische Union?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q458 wdt:P1082 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'Einwohnerzahl', ""''"", '(', 'population', ')', 'with', 'the', 'entity', '``', 'Europäische', 'Union', ""''"", '(', 'European', 'Union', ')', 'as', 'the', 'subject', '?']"	['Wie', 'viele', 'Einwohner', 'hat', 'die', 'Europäische', 'Union', '?']	0.1169	0.2727	0.0	118.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which unique spaceports have a NASA as their operator?	Liste alle Startrampen der NASA auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q194188 ; wdt:P137 wd:Q23548 . }	['Which', 'unique', 'spaceports', 'have', 'a', 'NASA', 'as', 'their', 'operator', '?']	['Liste', 'alle', 'Startrampen', 'der', 'NASA', 'auf', '.']	0.1955	0.2807	0.1333	42.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	How many distinct people were at some point married to Jane Fonda?	Wie oft war Jane Fonda verheiratet?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { wd:Q41142 wdt:P26 ?uri . }	['How', 'many', 'distinct', 'people', 'were', 'at', 'some', 'point', 'married', 'to', 'Jane', 'Fonda', '?']	['Wie', 'oft', 'war', 'Jane', 'Fonda', 'verheiratet', '?']	0.1771	0.6479	0.1111	50.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which person is the spouse of Abraham Lincoln with the label containing the string ""Mary""?"	Hieß die Ehefrau von Präsident Lincoln Mary?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q91> <http://www.wikidata.org/prop/direct/P26> ?spouse .  ?spouse <http://www.w3.org/2000/01/rdf-schema#label> ?name .  FILTER(regex(?name,'Mary')) }	"['Which', 'person', 'is', 'the', 'spouse', 'of', 'Abraham', 'Lincoln', 'with', 'the', 'label', 'containing', 'the', 'string', '``', 'Mary', ""''"", '?']"	['Hieß', 'die', 'Ehefrau', 'von', 'Präsident', 'Lincoln', 'Mary', '?']	0.2425	0.5	0.1	65.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI identifiers of entities that have the property ""Programmiersprache"" with the entity ""GIMP"" ( WaldDATa ID wd:Q8038 ) as the subject?"	In welcher Programmiersprache ist GIMP geschrieben?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q8038 wdt:P277 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'Programmiersprache', ""''"", 'with', 'the', 'entity', '``', 'GIMP', ""''"", '(', 'WaldDATa', 'ID', 'wd', ':', 'Q8038', ')', 'as', 'the', 'subject', '?']"	['In', 'welcher', 'Programmiersprache', 'ist', 'GIMP', 'geschrieben', '?']	0.2238	0.2632	0.0	117.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinct URI's represent universities, specifically state universities, that Angela Merkel has visited?	An welcher Universität hat Angela Merkel studiert?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { VALUES ?types { wd:Q3918 wd:Q875538 } wd:Q567 wdt:P69 ?uri . ?uri wdt:P31 ?types . }	"['Which', 'distinct', 'URI', ""'s"", 'represent', 'universities', ',', 'specifically', 'state', 'universities', ',', 'that', 'Angela', 'Merkel', 'has', 'visited', '?']"	['An', 'welcher', 'Universität', 'hat', 'Angela', 'Merkel', 'studiert', '?']	0.1575	0.5294	0.2105	73.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the unique URI identifiers of dramatic-music Works that have Elton John as their composer and are subclasses of a Work type?	Für welche Musicals hat Elton John die Musik geschrieben?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q58483083 ; wdt:P86 wd:Q2808 . }	['What', 'are', 'the', 'unique', 'URI', 'identifiers', 'of', 'dramatic-music', 'Works', 'that', 'have', 'Elton', 'John', 'as', 'their', 'composer', 'and', 'are', 'subclasses', 'of', 'a', 'Work', 'type', '?']	['Für', 'welche', 'Musicals', 'hat', 'Elton', 'John', 'die', 'Musik', 'geschrieben', '?']	0.135	0.4152	0.1333	98.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which is the longest fluid (river) with a recorded length, and what is that length in meters, taking into account any given precision and converting it to the SI unit?	Wie heißt der längste Fluss der Welt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	"PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4022 . ?uri p:P2043 ?stmnode. ?stmnode psv:P2043 ?valuenode . ?valuenode wikibase:quantityAmount ?length . ?valuenode wikibase:quantityUnit ?unit . ?valuenode wikibase:quantityLowerBound ?lowerbound. ?valuenode wikibase:quantityUpperBound ?upperbound. BIND((?upperbound-?lowerbound)/2 AS ?precision). BIND(IF(?precision=0, ?length, (CONCAT(str(?length), ""±"", str(?precision)))) AS ?length2). ?unit p:P2370 ?unitstmnode . ?unitstmnode psv:P2370 ?unitvaluenode . ?unitvaluenode wikibase:quantityAmount ?conversion . ?unitvaluenode wikibase:quantityUnit wd:Q11573 . BIND(?length * ?conversion AS ?length_in_m) . } ORDER BY DESC(?length_in_m) LIMIT 1"	['Which', 'is', 'the', 'longest', 'fluid', '(', 'river', ')', 'with', 'a', 'recorded', 'length', ',', 'and', 'what', 'is', 'that', 'length', 'in', 'meters', ',', 'taking', 'into', 'account', 'any', 'given', 'precision', 'and', 'converting', 'it', 'to', 'the', 'SI', 'unit', '?']	['Wie', 'heißt', 'der', 'längste', 'Fluss', 'der', 'Welt', '?']	0.1677	0.0857	0.0	139.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of hovercrafts that are a type of ""Luftkissenfahrzeug"" and have a known manufacturer?"	Welche Firmen produzieren Luftkissenfahrzeuge?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?hovercraft wdt:P31/wdt:P279* wd:Q185757 ; wdt:P176 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'hovercrafts', 'that', 'are', 'a', 'type', 'of', '``', 'Luftkissenfahrzeug', ""''"", 'and', 'have', 'a', 'known', 'manufacturer', '?']"	['Welche', 'Firmen', 'produzieren', 'Luftkissenfahrzeuge', '?']	0.1796	0.1055	0.0	80.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinct URIs represent the spouses of Abraham Lincoln?	Wie hieß der Frau von US-Präsident Lincoln?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q91 wdt:P26 ?uri . }	['Which', 'distinct', 'URIs', 'represent', 'the', 'spouses', 'of', 'Abraham', 'Lincoln', '?']	['Wie', 'hieß', 'der', 'Frau', 'von', 'US-Präsident', 'Lincoln', '?']	0.1792	0.6	0.125	42.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the distinct population size of the capitals of Australia?	Wie viele Menschen leben in der Hauptstadt von Australien?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?number WHERE { <http://www.wikidata.org/entity/Q408> <http://www.wikidata.org/prop/direct/P36> ?uri . ?uri <http://www.wikidata.org/prop/direct/P1082> ?number . }	['What', 'is', 'the', 'distinct', 'population', 'size', 'of', 'the', 'capitals', 'of', 'Australia', '?']	['Wie', 'viele', 'Menschen', 'leben', 'in', 'der', 'Hauptstadt', 'von', 'Australien', '?']	0.1926	0.2768	0.0	43.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of the currency entities that have the property ""Währung"" with the value ""Kakaobohne"" in Wikidata?"	In welchem alten Reich waren Kakaobohnen Zahlungsmittel?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P38 wd:Q208008 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'currency', 'entities', 'that', 'have', 'the', 'property', '``', 'Währung', ""''"", 'with', 'the', 'value', '``', 'Kakaobohne', ""''"", 'in', 'Wikidata', '?']"	['In', 'welchem', 'alten', 'Reich', 'waren', 'Kakaobohnen', 'Zahlungsmittel', '?']	0.1754	0.1154	0.0	97.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"""How many significant works were produced by Albert Einstein?"""	Wie viele Theorien hatte Albert Einstein?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) as ?cnt) WHERE { wd:Q937 wdt:P800 ?uri . }	"['``', 'How', 'many', 'significant', 'works', 'were', 'produced', 'by', 'Albert', 'Einstein', '?', ""''""]"	['Wie', 'viele', 'Theorien', 'hatte', 'Albert', 'Einstein', '?']	0.1735	0.7018	0.1333	38.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinctive URI's of the composers linked to the entity with label ""Titanic"" ?"	Wer hat den Soundtrack zu Camerons Film Titanic geschrieben?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q44578> <http://www.wikidata.org/prop/direct/P86> ?uri }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'the', 'composers', 'linked', 'to', 'the', 'entity', 'with', 'label', '``', 'Titanic', ""''"", '?']"	['Wer', 'hat', 'den', 'Soundtrack', 'zu', 'Camerons', 'Film', 'Titanic', 'geschrieben', '?']	0.2177	0.3497	0.0	69.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What is the duration of the film ""Toy Story""?"	Wie lang geht der Film Toy Story?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?val WHERE { wd:Q171048 wdt:P2047 ?val . }	"['What', 'is', 'the', 'duration', 'of', 'the', 'film', '``', 'Toy', 'Story', ""''"", '?']"	['Wie', 'lang', 'geht', 'der', 'Film', 'Toy', 'Story', '?']	0.1834	0.75	0.0	24.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What is the duration of the film ""Toy Story""?"	Gib mir die Länge von Toy Story.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?val WHERE { wd:Q171048 wdt:P2047 ?val . }	"['What', 'is', 'the', 'duration', 'of', 'the', 'film', '``', 'Toy', 'Story', ""''"", '?']"	['Gib', 'mir', 'die', 'Länge', 'von', 'Toy', 'Story', '.']	0.1657	0.5	0.0	27.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the URI's of countries that share a border with Iran?	An welche Länder grenzt der Iran?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q794 wdt:P47 ?uri . }	"['What', 'are', 'the', 'URI', ""'s"", 'of', 'countries', 'that', 'share', 'a', 'border', 'with', 'Iran', '?']"	['An', 'welche', 'Länder', 'grenzt', 'der', 'Iran', '?']	0.155	0.4011	0.1111	43.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct companies in the Consumer-Electronics industry that have been founded in Peking?	Welche Elektronikunternehmen wurden in Beijing gegründet?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?company WHERE { ?company  <http://www.wikidata.org/prop/direct/P452> <http://www.wikidata.org/entity/Q581105> ;  <http://www.wikidata.org/prop/direct/P740> <http://www.wikidata.org/entity/Q956> . } 	['What', 'are', 'the', 'distinct', 'companies', 'in', 'the', 'Consumer-Electronics', 'industry', 'that', 'have', 'been', 'founded', 'in', 'Peking', '?']	['Welche', 'Elektronikunternehmen', 'wurden', 'in', 'Beijing', 'gegründet', '?']	0.2223	0.3509	0.1053	76.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of entities that have the property ""Leiter der Regierung oder Verwaltung"" with Paris as the value for this property?"	Wer ist der Bürgermeister von Paris?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q90> <http://www.wikidata.org/prop/direct/P6> ?uri  . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'Leiter', 'der', 'Regierung', 'oder', 'Verwaltung', ""''"", 'with', 'Paris', 'as', 'the', 'value', 'for', 'this', 'property', '?']"	['Wer', 'ist', 'der', 'Bürgermeister', 'von', 'Paris', '?']	0.2284	0.3008	0.0714	118.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which universities has Arnold Schwarzenegger visited?	War Arnold Schwarzenegger an einer Universität eingeschrieben?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2685 wdt:P69 ?uri . ?uri wdt:P31/wdt:P279* wd:Q3918 . }	['Which', 'universities', 'has', 'Arnold', 'Schwarzenegger', 'visited', '?']	['War', 'Arnold', 'Schwarzenegger', 'an', 'einer', 'Universität', 'eingeschrieben', '?']	0.1995	1.1926	0.3077	49.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which Gewerbebetrieb in Indien has the most number of employees?	Welches indische Unternehmen hat die meisten Mitarbeiter?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q4830453>  . ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q668> . ?uri <http://www.wikidata.org/prop/direct/P1128> ?employees . } ORDER BY DESC(?employees) LIMIT 1	['Which', 'Gewerbebetrieb', 'in', 'Indien', 'has', 'the', 'most', 'number', 'of', 'employees', '?']	['Welches', 'indische', 'Unternehmen', 'hat', 'die', 'meisten', 'Mitarbeiter', '?']	0.1941	0.2727	0.0	44.0
