id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the duration for the ""History of Toys"" entity?"	Дайте мне длительность Истории Игрушек.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?val WHERE { wd:Q171048 wdt:P2047 ?val . }	"['What', 'is', 'the', 'duration', 'for', 'the', '``', 'History', 'of', 'Toys', ""''"", 'entity', '?']"	['Дайте', 'мне', 'длительность', 'Истории', 'Игрушек', '.']	0.0	0.0	0.0	50.0
262	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q794 wdt:P47 ?uri . } 
 Где:
 wd:Q794 именуется как ""Иран.""
 wdt:P47 именуется как ""имеет границы с.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI identifiers of the countries or territories that share a border with ""Iran"" (wd:Q794)?"	Со сколькими странами граничит Иран	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q794 wdt:P47 ?uri . }	"['What', 'are', 'the', 'URI', 'identifiers', 'of', 'the', 'countries', 'or', 'territories', 'that', 'share', 'a', 'border', 'with', '``', 'Iran', ""''"", '(', 'wd', ':', 'Q794', ')', '?']"	['Со', 'сколькими', 'странами', 'граничит', 'Иран']	0.0	0.0	0.0	99.0
263	"Имея следующий SPARQL запрос: SELECT DISTINCT ?company WHERE { ?company  <http://www.wikidata.org/prop/direct/P452> <http://www.wikidata.org/entity/Q581105> ;  <http://www.wikidata.org/prop/direct/P740> <http://www.wikidata.org/entity/Q956> . }  
 Где:
 http://www.wikidata.org/prop/direct/P452 именуется как ""отрасль.""
 http://www.wikidata.org/entity/Q581105 именуется как ""бытовая электроника.""
 http://www.wikidata.org/prop/direct/P740 именуется как ""место основания.""
 http://www.wikidata.org/entity/Q956 именуется как ""Пекин.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct companies that belong to the consumer electronics industry and have their headquarters in Beijing?	Какие компании по производству электроники были основаны в Пекине	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?company WHERE { ?company  <http://www.wikidata.org/prop/direct/P452> <http://www.wikidata.org/entity/Q581105> ;  <http://www.wikidata.org/prop/direct/P740> <http://www.wikidata.org/entity/Q956> . } 	['What', 'are', 'the', 'distinct', 'companies', 'that', 'belong', 'to', 'the', 'consumer', 'electronics', 'industry', 'and', 'have', 'their', 'headquarters', 'in', 'Beijing', '?']	['Какие', 'компании', 'по', 'производству', 'электроники', 'были', 'основаны', 'в', 'Пекине']	0.0	0.0	0.0	112.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct companies that belong to the consumer electronics industry and have their headquarters in Beijing?	Каке компании, производящие электронику, были основаны в Пекине?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?company WHERE { ?company  <http://www.wikidata.org/prop/direct/P452> <http://www.wikidata.org/entity/Q581105> ;  <http://www.wikidata.org/prop/direct/P740> <http://www.wikidata.org/entity/Q956> . } 	['What', 'are', 'the', 'distinct', 'companies', 'that', 'belong', 'to', 'the', 'consumer', 'electronics', 'industry', 'and', 'have', 'their', 'headquarters', 'in', 'Beijing', '?']	['Каке', 'компании', ',', 'производящие', 'электронику', ',', 'были', 'основаны', 'в', 'Пекине', '?']	0.1831	0.1821	0.0	112.0
264	"Имея следующий SPARQL запрос: PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?uri WHERE { wd:Q9696 p:P39 ?statement . ?statement ps:P39 wd:Q11696 ; pq:P1366 ?uri . } 
 Где:
 wd:Q9696 именуется как ""Джон Фицджеральд Кеннеди.""
 p:P39 именуется как ""занимаемая должность.""
 ps:P39 именуется как ""занимаемая должность.""
 wd:Q11696 именуется как ""президент США.""
 pq:P1366 именуется как ""заменён на.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which URI represents the entity that was previously held the position of ""president of the United States"" for ""John F. Kennedy""?"	Кто преемник Джона Кеннеди?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?uri WHERE { wd:Q9696 p:P39 ?statement . ?statement ps:P39 wd:Q11696 ; pq:P1366 ?uri . }	"['Which', 'URI', 'represents', 'the', 'entity', 'that', 'was', 'previously', 'held', 'the', 'position', 'of', '``', 'president', 'of', 'the', 'United', 'States', ""''"", 'for', '``', 'John', 'F.', 'Kennedy', ""''"", '?']"	['Кто', 'преемник', 'Джона', 'Кеннеди', '?']	0.1754	0.0893	0.0	124.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Which URI represents the entity that was previously held the position of ""president of the United States"" for ""John F. Kennedy""?"	Кто был преемником Джона Ф. Кеннеди?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?uri WHERE { wd:Q9696 p:P39 ?statement . ?statement ps:P39 wd:Q11696 ; pq:P1366 ?uri . }	"['Which', 'URI', 'represents', 'the', 'entity', 'that', 'was', 'previously', 'held', 'the', 'position', 'of', '``', 'president', 'of', 'the', 'United', 'States', ""''"", 'for', '``', 'John', 'F.', 'Kennedy', ""''"", '?']"	['Кто', 'был', 'преемником', 'Джона', 'Ф.', 'Кеннеди', '?']	0.1754	0.108	0.0	121.0
265	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q90> <http://www.wikidata.org/prop/direct/P6> ?uri  . } 
 Где:
 http://www.wikidata.org/entity/Q90 именуется как ""Париж.""
 http://www.wikidata.org/prop/direct/P6 именуется как ""глава правительства.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI identifiers for entities that have been the head of government of Paris?	Кто мэр Парижа?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q90> <http://www.wikidata.org/prop/direct/P6> ?uri  . }	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'for', 'entities', 'that', 'have', 'been', 'the', 'head', 'of', 'government', 'of', 'Paris', '?']	['Кто', 'мэр', 'Парижа', '?']	0.1843	0.1111	0.0	95.0
266	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2685 wdt:P69 ?uri . ?uri wdt:P31/wdt:P279* wd:Q3918 . } 
 Где:
 wd:Q2685 именуется как ""Арнольд Шварценеггер.""
 wdt:P69 именуется как ""учебное заведение.""
 wdt:P31 именуется как ""это частный случай понятия.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q3918 именуется как ""университет.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What universities has Arnold Schwarzenegger attended, where its type is a subclass of?	Арнольд Шварцнеггер учился в университете?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2685 wdt:P69 ?uri . ?uri wdt:P31/wdt:P279* wd:Q3918 . }	['What', 'universities', 'has', 'Arnold', 'Schwarzenegger', 'attended', ',', 'where', 'its', 'type', 'is', 'a', 'subclass', 'of', '?']	['Арнольд', 'Шварцнеггер', 'учился', 'в', 'университете', '?']	0.1883	0.1723	0.0	81.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What universities has Arnold Schwarzenegger attended, where its type is a subclass of?	Арнольд Шварцнегр учился в университете?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2685 wdt:P69 ?uri . ?uri wdt:P31/wdt:P279* wd:Q3918 . }	['What', 'universities', 'has', 'Arnold', 'Schwarzenegger', 'attended', ',', 'where', 'its', 'type', 'is', 'a', 'subclass', 'of', '?']	['Арнольд', 'Шварцнегр', 'учился', 'в', 'университете', '?']	0.1883	0.1723	0.0	81.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What universities has Arnold Schwarzenegger attended, where its type is a subclass of?	Учился ли Шварцнегр в университете?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2685 wdt:P69 ?uri . ?uri wdt:P31/wdt:P279* wd:Q3918 . }	['What', 'universities', 'has', 'Arnold', 'Schwarzenegger', 'attended', ',', 'where', 'its', 'type', 'is', 'a', 'subclass', 'of', '?']	['Учился', 'ли', 'Шварцнегр', 'в', 'университете', '?']	0.1883	0.1723	0.0	81.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What universities has Arnold Schwarzenegger attended, where its type is a subclass of?	Учился ли Арнольд Шварцнегер в университете?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2685 wdt:P69 ?uri . ?uri wdt:P31/wdt:P279* wd:Q3918 . }	['What', 'universities', 'has', 'Arnold', 'Schwarzenegger', 'attended', ',', 'where', 'its', 'type', 'is', 'a', 'subclass', 'of', '?']	['Учился', 'ли', 'Арнольд', 'Шварцнегер', 'в', 'университете', '?']	0.1883	0.1872	0.0	80.0
267	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2009573 wdt:P26 ?o1 . } 
 Где:
 wd:Q2009573 именуется как ""Джеймс Бонд.""
 wdt:P26 именуется как ""супруг(а).""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"""EXISTS a person with the label 'James Bond' who has a spouse?"""	Женат ли Джеймс Бонд?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2009573 wdt:P26 ?o1 . }	"['``', 'EXISTS', 'a', 'person', 'with', 'the', 'label', ""'James"", 'Bond', ""'"", 'who', 'has', 'a', 'spouse', '?', ""''""]"	['Женат', 'ли', 'Джеймс', 'Бонд', '?']	0.1869	0.1451	0.0	59.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the lake that the ""Isar"" river flows into?"	Изар впадает в озеро?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	ASK WHERE { <http://www.wikidata.org/entity/Q106588> <http://www.wikidata.org/prop/direct/P403> ?uri . ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q23397>  . } 	"['What', 'is', 'the', 'lake', 'that', 'the', '``', 'Isar', ""''"", 'river', 'flows', 'into', '?']"	['Изар', 'впадает', 'в', 'озеро', '?']	0.1911	0.1786	0.0	46.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the business entity with the highest number of employees that is a subclass of ""business"" and located in ""India""?"	В какой индийской компании наибольшее количество сотрудников?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q4830453>  . ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q668> . ?uri <http://www.wikidata.org/prop/direct/P1128> ?employees . } ORDER BY DESC(?employees) LIMIT 1	"['What', 'is', 'the', 'business', 'entity', 'with', 'the', 'highest', 'number', 'of', 'employees', 'that', 'is', 'a', 'subclass', 'of', '``', 'business', ""''"", 'and', 'located', 'in', '``', 'India', ""''"", '?']"	['В', 'какой', 'индийской', 'компании', 'наибольшее', 'количество', 'сотрудников', '?']	0.1754	0.1154	0.0	114.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the business entity with the highest number of employees that is a subclass of ""business"" and located in ""India""?"	В какой идийской компании работает больше всего людей?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q4830453>  . ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q668> . ?uri <http://www.wikidata.org/prop/direct/P1128> ?employees . } ORDER BY DESC(?employees) LIMIT 1	"['What', 'is', 'the', 'business', 'entity', 'with', 'the', 'highest', 'number', 'of', 'employees', 'that', 'is', 'a', 'subclass', 'of', '``', 'business', ""''"", 'and', 'located', 'in', '``', 'India', ""''"", '?']"	['В', 'какой', 'идийской', 'компании', 'работает', 'больше', 'всего', 'людей', '?']	0.1754	0.1219	0.0	113.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the business entity with the highest number of employees that is a subclass of ""business"" and located in ""India""?"	Какая индийская компания имеет наибольшее число наемных работников?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q4830453>  . ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q668> . ?uri <http://www.wikidata.org/prop/direct/P1128> ?employees . } ORDER BY DESC(?employees) LIMIT 1	"['What', 'is', 'the', 'business', 'entity', 'with', 'the', 'highest', 'number', 'of', 'employees', 'that', 'is', 'a', 'subclass', 'of', '``', 'business', ""''"", 'and', 'located', 'in', '``', 'India', ""''"", '?']"	['Какая', 'индийская', 'компания', 'имеет', 'наибольшее', 'число', 'наемных', 'работников', '?']	0.1754	0.1219	0.0	113.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the business entity with the highest number of employees that is a subclass of ""business"" and located in ""India""?"	В какой индийской компании больше всего сотрудников?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q4830453>  . ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q668> . ?uri <http://www.wikidata.org/prop/direct/P1128> ?employees . } ORDER BY DESC(?employees) LIMIT 1	"['What', 'is', 'the', 'business', 'entity', 'with', 'the', 'highest', 'number', 'of', 'employees', 'that', 'is', 'a', 'subclass', 'of', '``', 'business', ""''"", 'and', 'located', 'in', '``', 'India', ""''"", '?']"	['В', 'какой', 'индийской', 'компании', 'больше', 'всего', 'сотрудников', '?']	0.1754	0.1154	0.0	114.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the URI of an entity that had the job ""president of the United States"" from the start date to the end date, and also had the job ""vice president of the United States"" during that same time period?

Where:
""John F. Kennedy"" has the job ""president of the United States"" stated in `?presStatement`. The start and end dates are stored in `?startPres` and `?endPres`, respectively.
""president of the United States"" is represented by the property ""P39"".

""United States president"" is represented by the entity ""wd:Q11696"".

""Start date"" is represented by the property qualifier ""P580"".

""End date"" is represented by the property qualifier ""P582"".

""John F. Kennedy"" also has the job ""vice president of the United States"" stated in `?viceStatement`, with the start and end dates stored in `?startVice` and `?endVice`, and the start date being greater than or equal to, and less than or equal to, the president start and end dates, respectively.

""Vice president of the United States"" is represented by the entity ""wd:Q11699""."	Кто был вице-президентом Джона Кеннеди?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q9696 p:P39 ?presStatement . ?presStatement ps:P39 wd:Q11696 ; pq:P580 ?startPres ; pq:P582 ?endPres . ?uri p:P39 ?viceStatement . ?viceStatement ps:P39 wd:Q11699 ; pq:P580 ?startVice ; pq:P582 ?endVice . FILTER(?startVice >= ?startPres && ?startVice <= ?endPres) }	"['What', 'is', 'the', 'URI', 'of', 'an', 'entity', 'that', 'had', 'the', 'job', '``', 'president', 'of', 'the', 'United', 'States', ""''"", 'from', 'the', 'start', 'date', 'to', 'the', 'end', 'date', ',', 'and', 'also', 'had', 'the', 'job', '``', 'vice', 'president', 'of', 'the', 'United', 'States', ""''"", 'during', 'that', 'same', 'time', 'period', '?', 'Where', ':', ""''"", 'John', 'F.', 'Kennedy', ""''"", 'has', 'the', 'job', '``', 'president', 'of', 'the', 'United', 'States', ""''"", 'stated', 'in', '`', '?', 'presStatement', '`', '.', 'The', 'start', 'and', 'end', 'dates', 'are', 'stored', 'in', '`', '?', 'startPres', '`', 'and', '`', '?', 'endPres', '`', ',', 'respectively', '.', '``', 'president', 'of', 'the', 'United', 'States', ""''"", 'is', 'represented', 'by', 'the', 'property', '``', 'P39', ""''"", '.', '``', 'United', 'States', 'president', ""''"", 'is', 'represented', 'by', 'the', 'entity', '``', 'wd', ':', 'Q11696', ""''"", '.', '``', 'Start', 'date', ""''"", 'is', 'represented', 'by', 'the', 'property', 'qualifier', '``', 'P580', ""''"", '.', '``', 'End', 'date', ""''"", 'is', 'represented', 'by', 'the', 'property', 'qualifier', '``', 'P582', ""''"", '.', '``', 'John', 'F.', 'Kennedy', ""''"", 'also', 'has', 'the', 'job', '``', 'vice', 'president', 'of', 'the', 'United', 'States', ""''"", 'stated', 'in', '`', '?', 'viceStatement', '`', ',', 'with', 'the', 'start', 'and', 'end', 'dates', 'stored', 'in', '`', '?', 'startVice', '`', 'and', '`', '?', 'endVice', '`', ',', 'and', 'the', 'start', 'date', 'being', 'greater', 'than', 'or', 'equal', 'to', ',', 'and', 'less', 'than', 'or', 'equal', 'to', ',', 'the', 'president', 'start', 'and', 'end', 'dates', ',', 'respectively', '.', '``', 'Vice', 'president', 'of', 'the', 'United', 'States', ""''"", 'is', 'represented', 'by', 'the', 'entity', '``', 'wd', ':', 'Q11699', ""''"", '.']"	['Кто', 'был', 'вице-президентом', 'Джона', 'Кеннеди', '?']	0.1178	0.0109	0.0	1021.0
""Vice president of the United States"" is represented by the entity ""wd:Q11699""."	Кто был вице-президентом у Джона Ф. Кеннеди?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q9696 p:P39 ?presStatement . ?presStatement ps:P39 wd:Q11696 ; pq:P580 ?startPres ; pq:P582 ?endPres . ?uri p:P39 ?viceStatement . ?viceStatement ps:P39 wd:Q11699 ; pq:P580 ?startVice ; pq:P582 ?endVice . FILTER(?startVice >= ?startPres && ?startVice <= ?endPres) }	"['What', 'is', 'the', 'URI', 'of', 'an', 'entity', 'that', 'had', 'the', 'job', '``', 'president', 'of', 'the', 'United', 'States', ""''"", 'from', 'the', 'start', 'date', 'to', 'the', 'end', 'date', ',', 'and', 'also', 'had', 'the', 'job', '``', 'vice', 'president', 'of', 'the', 'United', 'States', ""''"", 'during', 'that', 'same', 'time', 'period', '?', 'Where', ':', ""''"", 'John', 'F.', 'Kennedy', ""''"", 'has', 'the', 'job', '``', 'president', 'of', 'the', 'United', 'States', ""''"", 'stated', 'in', '`', '?', 'presStatement', '`', '.', 'The', 'start', 'and', 'end', 'dates', 'are', 'stored', 'in', '`', '?', 'startPres', '`', 'and', '`', '?', 'endPres', '`', ',', 'respectively', '.', '``', 'president', 'of', 'the', 'United', 'States', ""''"", 'is', 'represented', 'by', 'the', 'property', '``', 'P39', ""''"", '.', '``', 'United', 'States', 'president', ""''"", 'is', 'represented', 'by', 'the', 'entity', '``', 'wd', ':', 'Q11696', ""''"", '.', '``', 'Start', 'date', ""''"", 'is', 'represented', 'by', 'the', 'property', 'qualifier', '``', 'P580', ""''"", '.', '``', 'End', 'date', ""''"", 'is', 'represented', 'by', 'the', 'property', 'qualifier', '``', 'P582', ""''"", '.', '``', 'John', 'F.', 'Kennedy', ""''"", 'also', 'has', 'the', 'job', '``', 'vice', 'president', 'of', 'the', 'United', 'States', ""''"", 'stated', 'in', '`', '?', 'viceStatement', '`', ',', 'with', 'the', 'start', 'and', 'end', 'dates', 'stored', 'in', '`', '?', 'startVice', '`', 'and', '`', '?', 'endVice', '`', ',', 'and', 'the', 'start', 'date', 'being', 'greater', 'than', 'or', 'equal', 'to', ',', 'and', 'less', 'than', 'or', 'equal', 'to', ',', 'the', 'president', 'start', 'and', 'end', 'dates', ',', 'respectively', '.', '``', 'Vice', 'president', 'of', 'the', 'United', 'States', ""''"", 'is', 'represented', 'by', 'the', 'entity', '``', 'wd', ':', 'Q11699', ""''"", '.']"	['Кто', 'был', 'вице-президентом', 'у', 'Джона', 'Ф.', 'Кеннеди', '?']	0.1178	0.0126	0.0	1018.0
271	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q1501505 wdt:P170 ?creator . ?creator wdt:P27 ?uri . } 
 Где:
 wd:Q1501505 именуется как ""Миффи.""
 wdt:P170 именуется как ""создатель.""
 wdt:P27 именуется как ""гражданство.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the citizenship of the creator of ""Mifffi"" (wd:Q1501505)?"	"Из какой страны автор ""Miffy""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q1501505 wdt:P170 ?creator . ?creator wdt:P27 ?uri . }	"['What', 'is', 'the', 'citizenship', 'of', 'the', 'creator', 'of', '``', 'Mifffi', ""''"", '(', 'wd', ':', 'Q1501505', ')', '?']"	"['Из', 'какой', 'страны', 'автор', '``', 'Miffy', ""''"", '?']"	0.2442	0.5294	0.0	54.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the citizenship of the creator of ""Mifffi"" (wd:Q1501505)?"	Из какой страны создатель Miffy?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q1501505 wdt:P170 ?creator . ?creator wdt:P27 ?uri . }	"['What', 'is', 'the', 'citizenship', 'of', 'the', 'creator', 'of', '``', 'Mifffi', ""''"", '(', 'wd', ':', 'Q1501505', ')', '?']"	['Из', 'какой', 'страны', 'создатель', 'Miffy', '?']	0.1856	0.1521	0.0	56.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the citizenship of the creator of ""Mifffi"" (wd:Q1501505)?"	Страна происхождения создателя Miffy?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q1501505 wdt:P170 ?creator . ?creator wdt:P27 ?uri . }	"['What', 'is', 'the', 'citizenship', 'of', 'the', 'creator', 'of', '``', 'Mifffi', ""''"", '(', 'wd', ':', 'Q1501505', ')', '?']"	['Страна', 'происхождения', 'создателя', 'Miffy', '?']	0.1856	0.1366	0.0	57.0
273	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q854383> <http://www.wikidata.org/prop/direct/P176>/<http://www.wikidata.org/prop/direct/P159> ?uri . } 
 Где:
 http://www.wikidata.org/prop/direct/P176 именуется как ""производитель.""
 http://www.wikidata.org/prop/direct/P159 именуется как ""расположение штаб-квартиры.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the entities that have the ""producer"" property with the value of ""headquarters location"" ?

(Note: In plain English, this query is asking for the distinct URI's of entities that have a ""producer"" property with the value of their ""headquarters location""?)"	В каком городе находится пивоварня Heineken?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q854383> <http://www.wikidata.org/prop/direct/P176>/<http://www.wikidata.org/prop/direct/P159> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'have', 'the', '``', 'producer', ""''"", 'property', 'with', 'the', 'value', 'of', '``', 'headquarters', 'location', ""''"", '?', '(', 'Note', ':', 'In', 'plain', 'English', ',', 'this', 'query', 'is', 'asking', 'for', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'a', '``', 'producer', ""''"", 'property', 'with', 'the', 'value', 'of', 'their', '``', 'headquarters', 'location', ""''"", '?', ')']"	['В', 'каком', 'городе', 'находится', 'пивоварня', 'Heineken', '?']	0.1528	0.046	0.0	272.0
(Note: In plain English, this query is asking for the distinct URI's of entities that have a ""producer"" property with the value of their ""headquarters location""?)"	В каком городе пиваварни Хейнекен?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q854383> <http://www.wikidata.org/prop/direct/P176>/<http://www.wikidata.org/prop/direct/P159> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'have', 'the', '``', 'producer', ""''"", 'property', 'with', 'the', 'value', 'of', '``', 'headquarters', 'location', ""''"", '?', '(', 'Note', ':', 'In', 'plain', 'English', ',', 'this', 'query', 'is', 'asking', 'for', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'a', '``', 'producer', ""''"", 'property', 'with', 'the', 'value', 'of', 'their', '``', 'headquarters', 'location', ""''"", '?', ')']"	['В', 'каком', 'городе', 'пиваварни', 'Хейнекен', '?']	0.1528	0.0424	0.0	280.0
(Note: In plain English, this query is asking for the distinct URI's of entities that have a ""producer"" property with the value of their ""headquarters location""?)"	В каком городе находится пивоварня Хайнекен?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q854383> <http://www.wikidata.org/prop/direct/P176>/<http://www.wikidata.org/prop/direct/P159> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'have', 'the', '``', 'producer', ""''"", 'property', 'with', 'the', 'value', 'of', '``', 'headquarters', 'location', ""''"", '?', '(', 'Note', ':', 'In', 'plain', 'English', ',', 'this', 'query', 'is', 'asking', 'for', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'a', '``', 'producer', ""''"", 'property', 'with', 'the', 'value', 'of', 'their', '``', 'headquarters', 'location', ""''"", '?', ')']"	['В', 'каком', 'городе', 'находится', 'пивоварня', 'Хайнекен', '?']	0.1528	0.046	0.0	279.0
274	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q76 wdt:P102 wd:Q29552 . } 
 Где:
 wd:Q76 именуется как ""Барак Обама.""
 wdt:P102 именуется как ""член политической партии.""
 wd:Q29552 именуется как ""Демократическая партия.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	Was Barack Obama a member of the Democratic Party?	Барак Обама - демократ?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q76 wdt:P102 wd:Q29552 . }	['Was', 'Barack', 'Obama', 'a', 'member', 'of', 'the', 'Democratic', 'Party', '?']	['Барак', 'Обама', '-', 'демократ', '?']	0.1955	0.2322	0.0	46.0
275	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q7416 wdt:P40 ?uri . } 
 Где:
 wd:Q7416 именуется как ""Маргарет Тэтчер.""
 wdt:P40 именуется как ""дети.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI representations for entities that are children of Margaret Thatcher?	Перечислите детей Маргарет Тетчер.	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q7416 wdt:P40 ?uri . }	['What', 'are', 'the', 'distinct', 'URI', 'representations', 'for', 'entities', 'that', 'are', 'children', 'of', 'Margaret', 'Thatcher', '?']	['Перечислите', 'детей', 'Маргарет', 'Тетчер', '.']	0.0	0.0	0.0	91.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the distinct area size of ""North Rhine-Westphalia"" (wd:Q1198)?"	Какова общая площадь области Северный Рейн - Вестфалия?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q1198 wdt:P2046 ?val . }	"['What', 'is', 'the', 'distinct', 'area', 'size', 'of', '``', 'North', 'Rhine-Westphalia', ""''"", '(', 'wd', ':', 'Q1198', ')', '?']"	['Какова', 'общая', 'площадь', 'области', 'Северный', 'Рейн', '-', 'Вестфалия', '?']	0.1856	0.1865	0.0	64.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the distinct area size of ""North Rhine-Westphalia"" (wd:Q1198)?"	Какова общая площадь земли Северный Рейн-Вестфалия?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q1198 wdt:P2046 ?val . }	"['What', 'is', 'the', 'distinct', 'area', 'size', 'of', '``', 'North', 'Rhine-Westphalia', ""''"", '(', 'wd', ':', 'Q1198', ')', '?']"	['Какова', 'общая', 'площадь', 'земли', 'Северный', 'Рейн-Вестфалия', '?']	0.1856	0.1651	0.0	65.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the distinct area size of ""North Rhine-Westphalia"" (wd:Q1198)?"	Какова площадь Северного Рейна-Вестфалии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q1198 wdt:P2046 ?val . }	"['What', 'is', 'the', 'distinct', 'area', 'size', 'of', '``', 'North', 'Rhine-Westphalia', ""''"", '(', 'wd', ':', 'Q1198', ')', '?']"	['Какова', 'площадь', 'Северного', 'Рейна-Вестфалии', '?']	0.1856	0.1366	0.0	65.0
279	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:279* wd:Q515 ; wdt:P1082 ?population . } ORDER BY DESC(?population) LIMIT 1 
 Где:
 wdt:P31 именуется как ""это частный случай понятия.""
 wd:Q515 именуется как ""город.""
 wdt:P1082 именуется как ""численность населения.""
