id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the URI identifiers of entities that are a type of ""Brettspiel"" (Board game)?"	Liste die Brettspiele von GMT auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q131436 . }	"['What', 'are', 'the', 'URI', 'identifiers', 'of', 'entities', 'that', 'are', 'a', 'type', 'of', '``', 'Brettspiel', ""''"", '(', 'Board', 'game', ')', '?']"	['Liste', 'die', 'Brettspiele', 'von', 'GMT', 'auf', '.']	0.0	0.0	0.0	67.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the URI identifiers of entities that are a type of ""Brettspiel"" (Board game)?"	Zeige mir alle Brettspiele von GMT.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q131436 . }	"['What', 'are', 'the', 'URI', 'identifiers', 'of', 'entities', 'that', 'are', 'a', 'type', 'of', '``', 'Brettspiel', ""''"", '(', 'Board', 'game', ')', '?']"	['Zeige', 'mir', 'alle', 'Brettspiele', 'von', 'GMT', '.']	0.0	0.0	0.0	63.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the developer of Skype?	Wer entwickelte Skype?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q40984 wdt:P178 ?uri . }	['What', 'is', 'the', 'developer', 'of', 'Skype', '?']	['Wer', 'entwickelte', 'Skype', '?']	0.208	0.5714	0.2222	18.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What is the URI of any resource represented in Wikidata with property ""Geburtsort"" set to the value ""Heraklion""?"	Welche Personen wurden in Heraklion geboren?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P19 wd:Q160544 . }	"['What', 'is', 'the', 'URI', 'of', 'any', 'resource', 'represented', 'in', 'Wikidata', 'with', 'property', '``', 'Geburtsort', ""''"", 'set', 'to', 'the', 'value', '``', 'Heraklion', ""''"", '?']"	['Welche', 'Personen', 'wurden', 'in', 'Heraklion', 'geboren', '?']	0.2349	0.3662	0.087	86.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct administrative units that Area 51 lies in?	In welchem Bundesstaat liegt Area 51?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q177397 wdt:P131 ?obj . ?obj wdt:P131 ?uri . }	['What', 'are', 'the', 'distinct', 'administrative', 'units', 'that', 'Area', '51', 'lies', 'in', '?']	['In', 'welchem', 'Bundesstaat', 'liegt', 'Area', '51', '?']	0.1834	0.7018	0.1176	42.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI identifiers for the airline hubs that Air China is associated with?	Welche Flughäfen werden durch Air China angeflogen?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q51747 wdt:P113 ?uri . }	['What', 'are', 'the', 'distinct', 'URI', 'identifiers', 'for', 'the', 'airline', 'hubs', 'that', 'Air', 'China', 'is', 'associated', 'with', '?']	['Welche', 'Flughäfen', 'werden', 'durch', 'Air', 'China', 'angeflogen', '?']	0.1575	0.5294	0.1818	65.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of films where William Shatner is both the Director and Actor?	Liste alle Schauspieler, die in Filmen mitspielen, in denen William Shatner Regie führte und auch die Hauptrolle spielte.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?film wdt:P57 wd:Q16297 ; wdt:P161 wd:Q16297   . ?film wdt:P161 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'where', 'William', 'Shatner', 'is', 'both', 'the', 'Director', 'and', 'Actor', '?']"	['Liste', 'alle', 'Schauspieler', ',', 'die', 'in', 'Filmen', 'mitspielen', ',', 'in', 'denen', 'William', 'Shatner', 'Regie', 'führte', 'und', 'auch', 'die', 'Hauptrolle', 'spielte', '.']	0.1174	0.4415	0.129	79.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of entities that have ""Philippines"" as their official language?"	Was ist die Amtssprache der Philippinen?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q928 wdt:P37 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', '``', 'Philippines', ""''"", 'as', 'their', 'official', 'language', '?']"	['Was', 'ist', 'die', 'Amtssprache', 'der', 'Philippinen', '?']	0.1843	0.156	0.0	67.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of films that belong to a subclass and have Denmark as their origin country?	Liste als dänischen Filme auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q11424 . ?uri wdt:P31 ?type ; wdt:P495 wd:Q35 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'that', 'belong', 'to', 'a', 'subclass', 'and', 'have', 'Denmark', 'as', 'their', 'origin', 'country', '?']"	['Liste', 'als', 'dänischen', 'Filme', 'auf', '.']	0.0	0.0	0.0	86.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of films that have the subclass relationship ""Underclass of"" film and are both acted by Brad Pitt and directed by Guy Ritchie?"	Liste Brad Pitt Filme auf, in denen Guy Ritchie Regie geführt hat.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q11424 . ?uri wdt:P31 ?type ; wdt:P161 wd:Q35332 ; wdt:P57 wd:Q192990 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'that', 'have', 'the', 'subclass', 'relationship', '``', 'Underclass', 'of', ""''"", 'film', 'and', 'are', 'both', 'acted', 'by', 'Brad', 'Pitt', 'and', 'directed', 'by', 'Guy', 'Ritchie', '?']"	['Liste', 'Brad', 'Pitt', 'Filme', 'auf', ',', 'in', 'denen', 'Guy', 'Ritchie', 'Regie', 'geführt', 'hat', '.']	0.1537	0.4913	0.1714	122.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of the children of Bruce Lee?	Zeige die Enkelkinder von Bruce Lee?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q16397 wdt:P40 ?children . ?children wdt:P40 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'children', 'of', 'Bruce', 'Lee', '?']"	['Zeige', 'die', 'Enkelkinder', 'von', 'Bruce', 'Lee', '?']	0.163	0.6479	0.2667	35.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which Uris represent weapons that are subclasses of a weapon, but are not the Uzi, and have designers assigned to them?	Welche anderen Waffen wurden vom Designer der Uzi entwickelt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q728 . wd:Q155644 wdt:P287 ?designer . ?uri wdt:P279 ?type ; wdt:P287 ?designer . FILTER (?uri != wd:Q155644) }	['Which', 'Uris', 'represent', 'weapons', 'that', 'are', 'subclasses', 'of', 'a', 'weapon', ',', 'but', 'are', 'not', 'the', 'Uzi', ',', 'and', 'have', 'designers', 'assigned', 'to', 'them', '?']	['Welche', 'anderen', 'Waffen', 'wurden', 'vom', 'Designer', 'der', 'Uzi', 'entwickelt', '?']	0.211	0.2768	0.0	89.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of monarchs who had a spouse from Germany?	Welche Monarchen waren mit Deutschen verheiratet?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q116 ; wdt:P26 ?spouse . ?spouse wdt:P27 wd:Q183 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'monarchs', 'who', 'had', 'a', 'spouse', 'from', 'Germany', '?']"	['Welche', 'Monarchen', 'waren', 'mit', 'Deutschen', 'verheiratet', '?']	0.1883	0.1872	0.0	55.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which unique URI's represent organizations that are subclasses of a organization and were founded before the year 1950?	Welche Organisationen wurden 1950 gegründet?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q43229 . ?uri wdt:P31 ?type . ?uri wdt:P571 ?foundedAt . FILTER CONTAINS(STR(?foundedAt), ""1950"") }"	"['Which', 'unique', 'URI', ""'s"", 'represent', 'organizations', 'that', 'are', 'subclasses', 'of', 'a', 'organization', 'and', 'were', 'founded', 'before', 'the', 'year', '1950', '?']"	['Welche', 'Organisationen', 'wurden', '1950', 'gegründet', '?']	0.2163	0.2585	0.0	92.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of the creators of Captain America?	Wer ist der Schöpfer von Captain America?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q190679 wdt:P170 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'creators', 'of', 'Captain', 'America', '?']"	['Wer', 'ist', 'der', 'Schöpfer', 'von', 'Captain', 'America', '?']	0.163	0.6923	0.25	34.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which individuals were members of the Apollo 14 mission team?	Wer war an Bord der Apollo 14?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q178871 wdt:P1029 ?uri }	['Which', 'individuals', 'were', 'members', 'of', 'the', 'Apollo', '14', 'mission', 'team', '?']	['Wer', 'war', 'an', 'Bord', 'der', 'Apollo', '14', '?']	0.1904	0.8182	0.1176	42.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of locations that serve as geographical start points for Kosmodrom Baikonur?	Welche Raumflüge starteten von Baikonur aus?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P1427 wd:Q177477 }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'locations', 'that', 'serve', 'as', 'geographical', 'start', 'points', 'for', 'Kosmodrom', 'Baikonur', '?']"	['Welche', 'Raumflüge', 'starteten', 'von', 'Baikonur', 'aus', '?']	0.2192	0.3119	0.0	79.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which Uris represent a Dirigent (person) who has conducted (P106) an orchestra that included a Trombone (P1303)?	Liste alle Trompetenspieler auf, die Bandleader einer Band waren.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q158852 ; wdt:P1303 wd:Q8338 . }	['Which', 'Uris', 'represent', 'a', 'Dirigent', '(', 'person', ')', 'who', 'has', 'conducted', '(', 'P106', ')', 'an', 'orchestra', 'that', 'included', 'a', 'Trombone', '(', 'P1303', ')', '?']	['Liste', 'alle', 'Trompetenspieler', 'auf', ',', 'die', 'Bandleader', 'einer', 'Band', 'waren', '.']	0.0	0.0	0.0	87.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinct U.S. states have a specified timezone different from Utah's?	Welche US-Staaten liegen in der gleichen Zeitzone wie Utah?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q829 wdt:P421 ?timezone . ?uri wdt:P31 wd:Q35657 ; wdt:P421 ?timezone . FILTER(?uri != wd:Q829) }	"['Which', 'distinct', 'U.S.', 'states', 'have', 'a', 'specified', 'timezone', 'different', 'from', 'Utah', ""'s"", '?']"	['Welche', 'US-Staaten', 'liegen', 'in', 'der', 'gleichen', 'Zeitzone', 'wie', 'Utah', '?']	0.2273	0.5111	0.0	50.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which unique Museums are located in London?	Liste alle Museen in London auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q33506> . ?uri <http://www.wikidata.org/prop/direct/P276> <http://www.wikidata.org/entity/Q84> . }	['Which', 'unique', 'Museums', 'are', 'located', 'in', 'London', '?']	['Liste', 'alle', 'Museen', 'in', 'London', 'auf', '.']	0.1968	0.7018	0.1538	29.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which Uris represent writers who have been awarded the Nobel Prize for Literature and have carried out the occupation of being a writer?	Liste alle Schriftsteller auf, die den Nobelpreis gewonnen haben.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P106 wd:Q36180 . ?uri wdt:P166 wd:Q37922 . } 	['Which', 'Uris', 'represent', 'writers', 'who', 'have', 'been', 'awarded', 'the', 'Nobel', 'Prize', 'for', 'Literature', 'and', 'have', 'carried', 'out', 'the', 'occupation', 'of', 'being', 'a', 'writer', '?']	['Liste', 'alle', 'Schriftsteller', 'auf', ',', 'die', 'den', 'Nobelpreis', 'gewonnen', 'haben', '.']	0.0	0.0	0.0	105.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of individuals who have the profession ""Basketballplayer"" and have a height greater than 200?"	Liste alle Basketballspieler auf, die größer als 2 Meter sind.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q3665646> . ?uri <http://www.wikidata.org/prop/direct/P2048> ?height .  FILTER(?height > 200)}	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'who', 'have', 'the', 'profession', '``', 'Basketballplayer', ""''"", 'and', 'have', 'a', 'height', 'greater', 'than', '200', '?']"	['Liste', 'alle', 'Basketballspieler', 'auf', ',', 'die', 'größer', 'als', '2', 'Meter', 'sind', '.']	0.0	0.0	0.0	92.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which URI represents a swimmer's birthplace, where the activity is identified as swimming?	Liste alle Schwimmer auf, die in Moskau geboren wurden.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q10843402 ; wdt:P19 wd:Q649 . }	"['Which', 'URI', 'represents', 'a', 'swimmer', ""'s"", 'birthplace', ',', 'where', 'the', 'activity', 'is', 'identified', 'as', 'swimming', '?']"	['Liste', 'alle', 'Schwimmer', 'auf', ',', 'die', 'in', 'Moskau', 'geboren', 'wurden', '.']	0.1869	0.2162	0.0	67.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinct URIs represent individuals who were Raumfahrer (astronauts) of the Soviet Union or Russia?	Liste alle Kosmonauten auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri  <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q11631> . { ?uri <http://www.wikidata.org/prop/direct/P27> <http://www.wikidata.org/entity/Q15180> } UNION { ?uri <http://www.wikidata.org/prop/direct/P27> <http://www.wikidata.org/entity/Q159> } }	['Which', 'distinct', 'URIs', 'represent', 'individuals', 'who', 'were', 'Raumfahrer', '(', 'astronauts', ')', 'of', 'the', 'Soviet', 'Union', 'or', 'Russia', '?']	['Liste', 'alle', 'Kosmonauten', 'auf', '.']	0.0	0.0	0.0	86.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which Non-Profit Organizations have their headquarters in Switzerland or in a Swiss community?	Liste alle Schweizer NGOs auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q163740 . { ?uri wdt:P159 wd:Q39 . } UNION { ?uri wdt:P159 ?city . ?city wdt:P31 wd:Q70208 } }	['Which', 'Non-Profit', 'Organizations', 'have', 'their', 'headquarters', 'in', 'Switzerland', 'or', 'in', 'a', 'Swiss', 'community', '?']	['Liste', 'alle', 'Schweizer', 'NGOs', 'auf', '.']	0.0	0.0	0.0	78.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of individuals holding the public office of a President and were born in the year 1945?	Welche Präsidenten wurden 1945 geboren?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P39>/<http://www.wikidata.org/prop/direct/P279> <http://www.wikidata.org/entity/Q30461> . ?uri <http://www.wikidata.org/prop/direct/P569> ?date . FILTER(year(?date)=1945) }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'individuals', 'holding', 'the', 'public', 'office', 'of', 'a', 'President', 'and', 'were', 'born', 'in', 'the', 'year', '1945', '?']"	['Welche', 'Präsidenten', 'wurden', '1945', 'geboren', '?']	0.2122	0.2248	0.0	92.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"Which distinct URI's represent the genre of the musician ""Lou Reed""?"	Welchen Musikstil spielte Lou Reed?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q189080> <http://www.wikidata.org/prop/direct/P136> ?uri . }	"['Which', 'distinct', 'URI', ""'s"", 'represent', 'the', 'genre', 'of', 'the', 'musician', '``', 'Lou', 'Reed', ""''"", '?']"	['Welchen', 'Musikstil', 'spielte', 'Lou', 'Reed', '?']	0.1664	0.517	0.0	46.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the distinctive URI of a resource that is the home stadium of the Boston Red Sox?	Wo haben die Red Sox gespielt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q213959> <http://www.wikidata.org/prop/direct/P115> ?uri }	['What', 'is', 'the', 'distinctive', 'URI', 'of', 'a', 'resource', 'that', 'is', 'the', 'home', 'stadium', 'of', 'the', 'Boston', 'Red', 'Sox', '?']	['Wo', 'haben', 'die', 'Red', 'Sox', 'gespielt', '?']	0.1499	0.4433	0.1	72.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of football clubs that are a type of ""Footballverein"" and play in ""Fußball-Bundesliga"" which is a type of ""Liga""?"	Liste alle Fußballvereine auf, die in der Bundesliga spielen.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q476028 ; wdt:P118 wd:Q82595 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'football', 'clubs', 'that', 'are', 'a', 'type', 'of', '``', 'Footballverein', ""''"", 'and', 'play', 'in', '``', 'Fußball-Bundesliga', ""''"", 'which', 'is', 'a', 'type', 'of', '``', 'Liga', ""''"", '?']"	['Liste', 'alle', 'Fußballvereine', 'auf', ',', 'die', 'in', 'der', 'Bundesliga', 'spielen', '.']	0.1701	0.1081	0.0714	102.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the unique URI's of bridges (wd:Q12280) that have a queried body of water (wd:Q1471) as their waterway?	Welche Brücken führen über die Seine?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q12280 ; wdt:P177 wd:Q1471 . }	"['What', 'are', 'the', 'unique', 'URI', ""'s"", 'of', 'bridges', '(', 'wd', ':', 'Q12280', ')', 'that', 'have', 'a', 'queried', 'body', 'of', 'water', '(', 'wd', ':', 'Q1471', ')', 'as', 'their', 'waterway', '?']"	['Welche', 'Brücken', 'führen', 'über', 'die', 'Seine', '?']	0.1726	0.0968	0.0	91.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the URI of the entity that is the cause of death for the most number of individuals?	Was ist die häufigste Todesursache?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?s wdt:P509 ?uri . } GROUP BY ?uri ORDER BY DESC(COUNT(DISTINCT ?s)) LIMIT 1	['What', 'is', 'the', 'URI', 'of', 'the', 'entity', 'that', 'is', 'the', 'cause', 'of', 'death', 'for', 'the', 'most', 'number', 'of', 'individuals', '?']	['Was', 'ist', 'die', 'häufigste', 'Todesursache', '?']	0.1818	0.1292	0.0	71.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which four basketball players, ordered by descending birth date, have been awarded the Most Valuable Player (MVP) title in their careers?	Wer sind die jüngsten MVP Basketballspieler?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	"PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P106 wd:Q3665646 ; wdt:P569 ?birthDate ; wdt:P166 ?award . ?award rdfs:label ?awardLabel FILTER (CONTAINS(STR(?awardLabel), ""MVP"") || CONTAINS(STR(?awardLabel), ""Most Valuable Player"")) . FILTER (LANGMATCHES(LANG(?awardLabel), ""EN"" ) ) } ORDER BY DESC(?birthDate) LIMIT 4"	['Which', 'four', 'basketball', 'players', ',', 'ordered', 'by', 'descending', 'birth', 'date', ',', 'have', 'been', 'awarded', 'the', 'Most', 'Valuable', 'Player', '(', 'MVP', ')', 'title', 'in', 'their', 'careers', '?']	['Wer', 'sind', 'die', 'jüngsten', 'MVP', 'Basketballspieler', '?']	0.2086	0.216	0.0	112.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of types that are subclasses of ""Gewerbebetrieb"" and have their main administration in ""München""?"	Liste alle Unternehmen in München auf.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q4830453 . ?uri wdt:P31 ?type ; wdt:P159 wd:Q1726 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'types', 'that', 'are', 'subclasses', 'of', '``', 'Gewerbebetrieb', ""''"", 'and', 'have', 'their', 'main', 'administration', 'in', '``', 'München', ""''"", '?']"	['Liste', 'alle', 'Unternehmen', 'in', 'München', 'auf', '.']	0.2098	0.2246	0.087	101.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the URI's of the capitals of the states in the Himalayas?	Wie heißen die Hauptstädte der Länder, auf denen sich das Himalayagebirge befindet?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q5451 wdt:P17 ?country . ?country wdt:P36 ?uri . }	"['What', 'are', 'the', 'URI', ""'s"", 'of', 'the', 'capitals', 'of', 'the', 'states', 'in', 'the', 'Himalayas', '?']"	['Wie', 'heißen', 'die', 'Hauptstädte', 'der', 'Länder', ',', 'auf', 'denen', 'sich', 'das', 'Himalayagebirge', 'befindet', '?']	0.1883	0.2538	0.0	61.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	How many distinct film directors (P57 property) have worked on projects associated with Park Chan-wook (Q315484)?	Bei wie vielen Filmen führte Park Chan-wook Regie?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT (COUNT(DISTINCT ?uri) as ?count) WHERE {  ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q315484> . }	['How', 'many', 'distinct', 'film', 'directors', '(', 'P57', 'property', ')', 'have', 'worked', 'on', 'projects', 'associated', 'with', 'Park', 'Chan-wook', '(', 'Q315484', ')', '?']	['Bei', 'wie', 'vielen', 'Filmen', 'führte', 'Park', 'Chan-wook', 'Regie', '?']	0.1434	0.4528	0.1667	82.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of the lakes that are located in a country and have a river as their tribut?	Welche Flüsse münden in einen deutschen See?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4022 . ?lake wdt:P31 wd:Q23397 ; wdt:P17 wd:183 . ?uri wdt:P200 ?lake . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'lakes', 'that', 'are', 'located', 'in', 'a', 'country', 'and', 'have', 'a', 'river', 'as', 'their', 'tribut', '?']"	['Welche', 'Flüsse', 'münden', 'in', 'einen', 'deutschen', 'See', '?']	0.2122	0.2609	0.08	81.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	How many unique Fluggesellschaften (i.e. types) are there in Wikidata?	Wie viele Luftlinien gibt es?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) AS ?uri) WHERE { ?uri wdt:P31 wd:Q46970 }	['How', 'many', 'unique', 'Fluggesellschaften', '(', 'i.e', '.', 'types', ')', 'are', 'there', 'in', 'Wikidata', '?']	['Wie', 'viele', 'Luftlinien', 'gibt', 'es', '?']	0.1897	0.1846	0.0	56.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinct islands are located in Japan?	Liste alle Inseln auf, die zu Japan gehören.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q23442 ; wdt:P17 wd:Q17 . }	['Which', 'distinct', 'islands', 'are', 'located', 'in', 'Japan', '?']	['Liste', 'alle', 'Inseln', 'auf', ',', 'die', 'zu', 'Japan', 'gehören', '.']	0.1543	0.3366	0.0	37.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	"What are the distinct URI's of entities that are subclasses of ""Gewerbebetrieb"" (Q4830453) and have more than one million ""Beschäftigte"" (P1128)?"	Liste alle Unternehmen auf, die mehr als 1 Million Angestellte haben.	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q4830453 . ?uri wdt:P31 ?type ; wdt:P1128 ?num . FILTER(?num > 1000000) }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'are', 'subclasses', 'of', '``', 'Gewerbebetrieb', ""''"", '(', 'Q4830453', ')', 'and', 'have', 'more', 'than', 'one', 'million', '``', 'Beschäftigte', ""''"", '(', 'P1128', ')', '?']"	['Liste', 'alle', 'Unternehmen', 'auf', ',', 'die', 'mehr', 'als', '1', 'Million', 'Angestellte', 'haben', '.']	0.0	0.0	0.0	112.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What are the distinct URI's of films with Garry Marshall as the director and Julia Roberts as an actor?	In welchen Filmen unter der Regie von Garry Marshall hat Julia Roberts mitgespielt?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q315087> . ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q40523> . } 	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'films', 'with', 'Garry', 'Marshall', 'as', 'the', 'director', 'and', 'Julia', 'Roberts', 'as', 'an', 'actor', '?']"	['In', 'welchen', 'Filmen', 'unter', 'der', 'Regie', 'von', 'Garry', 'Marshall', 'hat', 'Julia', 'Roberts', 'mitgespielt', '?']	0.1937	0.9065	0.2667	60.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	Which distinctive Footballverein instances belong to the Premier League?	Welche Fußballvereine spielen in der Premier League?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q476028> . ?uri <http://www.wikidata.org/prop/direct/P118> <http://www.wikidata.org/entity/Q9448> . }	['Which', 'distinctive', 'Footballverein', 'instances', 'belong', 'to', 'the', 'Premier', 'League', '?']	['Welche', 'Fußballvereine', 'spielen', 'in', 'der', 'Premier', 'League', '?']	0.2004	0.9	0.25	34.0
 Transformiere die SPARQL-Anfrage in eine Frage in natürlicher Sprache. Gib nur die transformierte Frage aus."	What is the URI of the highest point related to the Ural entity?	Welches ist die höchste Ort im Ural?	de	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q35600> <http://www.wikidata.org/prop/direct/P610> ?uri . }	['What', 'is', 'the', 'URI', 'of', 'the', 'highest', 'point', 'related', 'to', 'the', 'Ural', 'entity', '?']	['Welches', 'ist', 'die', 'höchste', 'Ort', 'im', 'Ural', '?']	0.2256	0.4286	0.0	45.0
