id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query	tokenized_generated_nl	tokenized_gold_standard_nl	sentence_bleu	sentence_nist	rougeL	levenshtein
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct administrative-territorial units (wd:P131) associated with the entity ""Вестминстерский дворец"" (wd:Q62408)?"	Где расположено здание Парламента?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q62408 wdt:P131 ?uri . }	"['What', 'are', 'the', 'distinct', 'administrative-territorial', 'units', '(', 'wd', ':', 'P131', ')', 'associated', 'with', 'the', 'entity', '``', 'Вестминстерский', 'дворец', ""''"", '(', 'wd', ':', 'Q62408', ')', '?']"	['Где', 'расположено', 'здание', 'Парламента', '?']	0.1764	0.0929	0.0	122.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities with a height above sea level specified, where the entity ""Düsseldorf"" (wd:Q58226) has this property?"	Какая высота у аэропорта Дюссельдорфа?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q58226 wdt:P2044 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'with', 'a', 'height', 'above', 'sea', 'level', 'specified', ',', 'where', 'the', 'entity', '``', 'Düsseldorf', ""''"", '(', 'wd', ':', 'Q58226', ')', 'has', 'this', 'property', '?']"	['Какая', 'высота', 'у', 'аэропорта', 'Дюссельдорфа', '?']	0.1709	0.0834	0.0	136.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities with a height above sea level specified, where the entity ""Düsseldorf"" (wd:Q58226) has this property?"	На какой высоте находится аэропорт Дюссельдорф?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q58226 wdt:P2044 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'with', 'a', 'height', 'above', 'sea', 'level', 'specified', ',', 'where', 'the', 'entity', '``', 'Düsseldorf', ""''"", '(', 'wd', ':', 'Q58226', ')', 'has', 'this', 'property', '?']"	['На', 'какой', 'высоте', 'находится', 'аэропорт', 'Дюссельдорф', '?']	0.1709	0.0906	0.0	135.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI's of the entities that have the population size as their property value for the entity with the label ""Mexico"" (wd:Q1489)?"	Какова численность населения Мехико?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1489 wdt:P1082 ?uri . }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'have', 'the', 'population', 'size', 'as', 'their', 'property', 'value', 'for', 'the', 'entity', 'with', 'the', 'label', '``', 'Mexico', ""''"", '(', 'wd', ':', 'Q1489', ')', '?']"	['Какова', 'численность', 'населения', 'Мехико', '?']	0.1693	0.0704	0.0	147.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI's of the entities that have the population size as their property value for the entity with the label ""Mexico"" (wd:Q1489)?"	Сколько людей живет в Мехико?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1489 wdt:P1082 ?uri . }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'have', 'the', 'population', 'size', 'as', 'their', 'property', 'value', 'for', 'the', 'entity', 'with', 'the', 'label', '``', 'Mexico', ""''"", '(', 'wd', ':', 'Q1489', ')', '?']"	['Сколько', 'людей', 'живет', 'в', 'Мехико', '?']	0.1693	0.0783	0.0	146.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI's of the entities that have the population size as their property value for the entity with the label ""Mexico"" (wd:Q1489)?"	Каково население Мехико?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1489 wdt:P1082 ?uri . }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'have', 'the', 'population', 'size', 'as', 'their', 'property', 'value', 'for', 'the', 'entity', 'with', 'the', 'label', '``', 'Mexico', ""''"", '(', 'wd', ':', 'Q1489', ')', '?']"	['Каково', 'население', 'Мехико', '?']	0.1693	0.0606	0.0	148.0
218	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q200686 wdt:P571 ?uri . } 
 Где:
 wd:Q200686 именуется как ""Пятая французская республика.""
 wdt:P571 именуется как ""дата основания / создания / возникновения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's for the entities that have the property ""date of foundation"" with respect to the entity represented by the URI ""http://www.wikidata.org/entity/Q200686"" (Fifth French Republic)?"	Дата основания пятой французской республики?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q200686 wdt:P571 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'for', 'the', 'entities', 'that', 'have', 'the', 'property', '``', 'date', 'of', 'foundation', ""''"", 'with', 'respect', 'to', 'the', 'entity', 'represented', 'by', 'the', 'URI', '``', 'http', ':', '//www.wikidata.org/entity/Q200686', ""''"", '(', 'Fifth', 'French', 'Republic', ')', '?']"	['Дата', 'основания', 'пятой', 'французской', 'республики', '?']	0.1655	0.068	0.0	199.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's for the entities that have the property ""date of foundation"" with respect to the entity represented by the URI ""http://www.wikidata.org/entity/Q200686"" (Fifth French Republic)?"	Когда была основана Пятая Французская Республика?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q200686 wdt:P571 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'for', 'the', 'entities', 'that', 'have', 'the', 'property', '``', 'date', 'of', 'foundation', ""''"", 'with', 'respect', 'to', 'the', 'entity', 'represented', 'by', 'the', 'URI', '``', 'http', ':', '//www.wikidata.org/entity/Q200686', ""''"", '(', 'Fifth', 'French', 'Republic', ')', '?']"	['Когда', 'была', 'основана', 'Пятая', 'Французская', 'Республика', '?']	0.1655	0.0739	0.0	198.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's for the entities that have the property ""date of foundation"" with respect to the entity represented by the URI ""http://www.wikidata.org/entity/Q200686"" (Fifth French Republic)?"	Когда была основана французская пятая республика?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q200686 wdt:P571 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'for', 'the', 'entities', 'that', 'have', 'the', 'property', '``', 'date', 'of', 'foundation', ""''"", 'with', 'respect', 'to', 'the', 'entity', 'represented', 'by', 'the', 'URI', '``', 'http', ':', '//www.wikidata.org/entity/Q200686', ""''"", '(', 'Fifth', 'French', 'Republic', ')', '?']"	['Когда', 'была', 'основана', 'французская', 'пятая', 'республика', '?']	0.1655	0.0739	0.0	198.0
219	"Имея следующий SPARQL запрос: PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P39 wd:Q18810062 . ?uri p:P39 ?stmnode . ?stmnode pq:P580 ?startDate . } ORDER BY ?startDate LIMIT 1 
 Где:
 wdt:P39 именуется как ""занимаемая должность.""
 wd:Q18810062 именуется как ""король Англии.""
 p:P39 именуется как ""занимаемая должность.""
 pq:P580 именуется как ""дата начала.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the URI of an entity that is a ""King of England"" and has the earliest ""occupation start date"" for the position?"	Кто был первым королем Англии?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P39 wd:Q18810062 . ?uri p:P39 ?stmnode . ?stmnode pq:P580 ?startDate . } ORDER BY ?startDate LIMIT 1	"['What', 'is', 'the', 'URI', 'of', 'an', 'entity', 'that', 'is', 'a', '``', 'King', 'of', 'England', ""''"", 'and', 'has', 'the', 'earliest', '``', 'occupation', 'start', 'date', ""''"", 'for', 'the', 'position', '?']"	['Кто', 'был', 'первым', 'королем', 'Англии', '?']	0.1735	0.0923	0.0	114.0
220	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q25161472 wdt:P98 ?uri . } 
 Где:
 wd:Q25161472 именуется как ""Forbes.""
 wdt:P98 именуется как ""редактор.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI identifiers for entities that have been labeled as ""Forbes"" and have the property ""redactor"" in Wikidata?"	Кто является редактором Forbes?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q25161472 wdt:P98 ?uri . }	"['What', 'are', 'the', 'URI', 'identifiers', 'for', 'entities', 'that', 'have', 'been', 'labeled', 'as', '``', 'Forbes', ""''"", 'and', 'have', 'the', 'property', '``', 'redactor', ""''"", 'in', 'Wikidata', '?']"	['Кто', 'является', 'редактором', 'Forbes', '?']	0.2098	0.1858	0.0	112.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI identifiers for entities that have been labeled as ""Forbes"" and have the property ""redactor"" in Wikidata?"	Кто редактор журнала Форбс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q25161472 wdt:P98 ?uri . }	"['What', 'are', 'the', 'URI', 'identifiers', 'for', 'entities', 'that', 'have', 'been', 'labeled', 'as', '``', 'Forbes', ""''"", 'and', 'have', 'the', 'property', '``', 'redactor', ""''"", 'in', 'Wikidata', '?']"	['Кто', 'редактор', 'журнала', 'Форбс', '?']	0.1764	0.0929	0.0	118.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI identifiers for entities that have been labeled as ""Forbes"" and have the property ""redactor"" in Wikidata?"	Кто редактор журнала Forbes?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q25161472 wdt:P98 ?uri . }	"['What', 'are', 'the', 'URI', 'identifiers', 'for', 'entities', 'that', 'have', 'been', 'labeled', 'as', '``', 'Forbes', ""''"", 'and', 'have', 'the', 'property', '``', 'redactor', ""''"", 'in', 'Wikidata', '?']"	['Кто', 'редактор', 'журнала', 'Forbes', '?']	0.2098	0.1858	0.0	112.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the URI identifiers for entities that have been labeled as ""Forbes"" and have the property ""redactor"" in Wikidata?"	Кто является редактором Форбс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q25161472 wdt:P98 ?uri . }	"['What', 'are', 'the', 'URI', 'identifiers', 'for', 'entities', 'that', 'have', 'been', 'labeled', 'as', '``', 'Forbes', ""''"", 'and', 'have', 'the', 'property', '``', 'redactor', ""''"", 'in', 'Wikidata', '?']"	['Кто', 'является', 'редактором', 'Форбс', '?']	0.1764	0.0929	0.0	118.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's representing the entities that Douglass Hofstadter (<http://www.wikidata.org/entity/Q319308>) has received awards from?	Какие награды получил Дуглас Хофштадтер?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q319308> <http://www.wikidata.org/prop/direct/P166> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'representing', 'the', 'entities', 'that', 'Douglass', 'Hofstadter', '(', '<', 'http', ':', '//www.wikidata.org/entity/Q319308', '>', ')', 'has', 'received', 'awards', 'from', '?']"	['Какие', 'награды', 'получил', 'Дуглас', 'Хофштадтер', '?']	0.1774	0.1077	0.0	142.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's representing the entities that Douglass Hofstadter (<http://www.wikidata.org/entity/Q319308>) has received awards from?	Какие награды есть у Дугласа Хофштадтера?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q319308> <http://www.wikidata.org/prop/direct/P166> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'representing', 'the', 'entities', 'that', 'Douglass', 'Hofstadter', '(', '<', 'http', ':', '//www.wikidata.org/entity/Q319308', '>', ')', 'has', 'received', 'awards', 'from', '?']"	['Какие', 'награды', 'есть', 'у', 'Дугласа', 'Хофштадтера', '?']	0.1774	0.117	0.0	141.0
222	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q18574233 ; wdt:P569 ?dateOfBirth . } ORDER BY DESC(?dateOfBirth) LIMIT 1 
 Где:
 wdt:P106 именуется как ""род занятий.""
 wd:Q18574233 именуется как ""дартсмен.""
 wdt:P569 именуется как ""дата рождения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the birthdate of the person who is a darts player and has the occupation ""dartsman"" listed as their main occupation, ordered from newest to oldest and returning only the most recent result?"	Кто является самым молодым игроком в дартс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q18574233 ; wdt:P569 ?dateOfBirth . } ORDER BY DESC(?dateOfBirth) LIMIT 1	"['What', 'is', 'the', 'birthdate', 'of', 'the', 'person', 'who', 'is', 'a', 'darts', 'player', 'and', 'has', 'the', 'occupation', '``', 'dartsman', ""''"", 'listed', 'as', 'their', 'main', 'occupation', ',', 'ordered', 'from', 'newest', 'to', 'oldest', 'and', 'returning', 'only', 'the', 'most', 'recent', 'result', '?']"	['Кто', 'является', 'самым', 'молодым', 'игроком', 'в', 'дартс', '?']	0.1655	0.0789	0.0	190.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What is the birthdate of the person who is a darts player and has the occupation ""dartsman"" listed as their main occupation, ordered from newest to oldest and returning only the most recent result?"	Кто самый юный игрок в дартс?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q18574233 ; wdt:P569 ?dateOfBirth . } ORDER BY DESC(?dateOfBirth) LIMIT 1	"['What', 'is', 'the', 'birthdate', 'of', 'the', 'person', 'who', 'is', 'a', 'darts', 'player', 'and', 'has', 'the', 'occupation', '``', 'dartsman', ""''"", 'listed', 'as', 'their', 'main', 'occupation', ',', 'ordered', 'from', 'newest', 'to', 'oldest', 'and', 'returning', 'only', 'the', 'most', 'recent', 'result', '?']"	['Кто', 'самый', 'юный', 'игрок', 'в', 'дартс', '?']	0.1655	0.0739	0.0	191.0
223	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q187916 wdt:P279* wd:Q349 . } 
 Где:
 wd:Q187916 именуется как ""конные скачки.""
 wdt:P279 именуется как ""подкласс от.""
 wd:Q349 именуется как ""спорт.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Does the concept ""конные скачки"" (wd:Q187916) have a subclass relationship with the concept ""спорт"" (wd:Q349)?"	Являются ли лошадиные скачки спортом?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q187916 wdt:P279* wd:Q349 . }	"['Does', 'the', 'concept', '``', 'конные', 'скачки', ""''"", '(', 'wd', ':', 'Q187916', ')', 'have', 'a', 'subclass', 'relationship', 'with', 'the', 'concept', '``', 'спорт', ""''"", '(', 'wd', ':', 'Q349', ')', '?']"	['Являются', 'ли', 'лошадиные', 'скачки', 'спортом', '?']	0.2064	0.1846	0.0	92.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"Does the concept ""конные скачки"" (wd:Q187916) have a subclass relationship with the concept ""спорт"" (wd:Q349)?"	Скачки на лошадях - это спорт?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q187916 wdt:P279* wd:Q349 . }	"['Does', 'the', 'concept', '``', 'конные', 'скачки', ""''"", '(', 'wd', ':', 'Q187916', ')', 'have', 'a', 'subclass', 'relationship', 'with', 'the', 'concept', '``', 'спорт', ""''"", '(', 'wd', ':', 'Q349', ')', '?']"	['Скачки', 'на', 'лошадях', '-', 'это', 'спорт', '?']	0.2064	0.2005	0.0	94.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of the entities that the ""Bruklynsky most"" (Q125006) property ""passes over/under"" (P177)?"	Какую реку пересекает Бруклинский Мост?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q125006> <http://www.wikidata.org/prop/direct/P177> ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'the', '``', 'Bruklynsky', 'most', ""''"", '(', 'Q125006', ')', 'property', '``', 'passes', 'over/under', ""''"", '(', 'P177', ')', '?']"	['Какую', 'реку', 'пересекает', 'Бруклинский', 'Мост', '?']	0.1745	0.0957	0.0	112.0
225	"Имея следующий SPARQL запрос: SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q36> <http://www.wikidata.org/prop/direct/P1082> ?uri } 
 Где:
 http://www.wikidata.org/entity/Q36 именуется как ""Польша.""
 http://www.wikidata.org/prop/direct/P1082 именуется как ""численность населения.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's representing the populations of Poland?	Какова численность Польши?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q36> <http://www.wikidata.org/prop/direct/P1082> ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'representing', 'the', 'populations', 'of', 'Poland', '?']"	['Какова', 'численность', 'Польши', '?']	0.1926	0.1667	0.0	64.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's representing the populations of Poland?	Сколько людей проживает в Польше?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q36> <http://www.wikidata.org/prop/direct/P1082> ?uri }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'representing', 'the', 'populations', 'of', 'Poland', '?']"	['Сколько', 'людей', 'проживает', 'в', 'Польше', '?']	0.1926	0.2154	0.0	62.0
226	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q79784 wdt:P582 ?uri . } 
 Где:
 wd:Q79784 именуется как ""Друзья.""
 wdt:P582 именуется как ""дата окончания.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that have the property ""date of ending"" associated with the entity ""Friends"" (wd:Q79784) ?"	Когда вышла в эфир последняя серия сериала «Друзья»?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q79784 wdt:P582 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'date', 'of', 'ending', ""''"", 'associated', 'with', 'the', 'entity', '``', 'Friends', ""''"", '(', 'wd', ':', 'Q79784', ')', '?']"	['Когда', 'вышла', 'в', 'эфир', 'последняя', 'серия', 'сериала', '«', 'Друзья', '»', '?']	0.1717	0.1153	0.0	122.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that have the property ""date of ending"" associated with the entity ""Friends"" (wd:Q79784) ?"	"Когда появился в эфире последний эпизод сериала ""Друзья""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q79784 wdt:P582 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'date', 'of', 'ending', ""''"", 'associated', 'with', 'the', 'entity', '``', 'Friends', ""''"", '(', 'wd', ':', 'Q79784', ')', '?']"	"['Когда', 'появился', 'в', 'эфире', 'последний', 'эпизод', 'сериала', '``', 'Друзья', ""''"", '?']"	0.226	0.3459	0.0	120.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that have the property ""date of ending"" associated with the entity ""Friends"" (wd:Q79784) ?"	Когда вышел в эфир последний эпизод телесериала Друзья?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q79784 wdt:P582 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'date', 'of', 'ending', ""''"", 'associated', 'with', 'the', 'entity', '``', 'Friends', ""''"", '(', 'wd', ':', 'Q79784', ')', '?']"	['Когда', 'вышел', 'в', 'эфир', 'последний', 'эпизод', 'телесериала', 'Друзья', '?']	0.1717	0.1057	0.0	122.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinct URI's of entities that have the property ""date of ending"" associated with the entity ""Friends"" (wd:Q79784) ?"	"Когда вышла последняя серия телесериала ""Друзья""?"	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q79784 wdt:P582 ?uri . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'entities', 'that', 'have', 'the', 'property', '``', 'date', 'of', 'ending', ""''"", 'associated', 'with', 'the', 'entity', '``', 'Friends', ""''"", '(', 'wd', ':', 'Q79784', ')', '?']"	"['Когда', 'вышла', 'последняя', 'серия', 'телесериала', '``', 'Друзья', ""''"", '?']"	0.226	0.317	0.0	122.0
227	"Имея следующий SPARQL запрос: PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q76 wdt:P26 ?wife . ?wife rdfs:label ?name . FILTER regex(?name, ""Michelle"") } 
 Где:
 wd:Q76 именуется как ""Барак Обама.""
 wdt:P26 именуется как ""супруг(а).""
 rdfs:label именуется как ""label.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the label of Michelle, who is the wife of Barak Obama?	Зовут ли жену президента Обама Мишель?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	"PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q76 wdt:P26 ?wife . ?wife rdfs:label ?name . FILTER regex(?name, ""Michelle"") }"	['What', 'is', 'the', 'label', 'of', 'Michelle', ',', 'who', 'is', 'the', 'wife', 'of', 'Barak', 'Obama', '?']	['Зовут', 'ли', 'жену', 'президента', 'Обама', 'Мишель', '?']	0.1883	0.1872	0.0	56.0
229	"Имея следующий SPARQL запрос: PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { wd:Q30 p:P6 ?statement . ?statement pq:P580 ?startTime ; ps:P6 ?uri . } ORDER BY ?startTime OFFSET 7 LIMIT 1 
 Где:
 wd:Q30 именуется как ""США.""
 p:P6 именуется как ""глава правительства.""
 pq:P580 именуется как ""дата начала.""
 ps:P6 именуется как ""глава правительства.""
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the government head of the USA with the earliest known start time?	Кто был 8-м президентом США?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { wd:Q30 p:P6 ?statement . ?statement pq:P580 ?startTime ; ps:P6 ?uri . } ORDER BY ?startTime OFFSET 7 LIMIT 1	['What', 'is', 'the', 'government', 'head', 'of', 'the', 'USA', 'with', 'the', 'earliest', 'known', 'start', 'time', '?']	['Кто', 'был', '8-м', 'президентом', 'США', '?']	0.1883	0.1723	0.0	69.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What is the government head of the USA with the earliest known start time?	Кто является 8 президентом США?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { wd:Q30 p:P6 ?statement . ?statement pq:P580 ?startTime ; ps:P6 ?uri . } ORDER BY ?startTime OFFSET 7 LIMIT 1	['What', 'is', 'the', 'government', 'head', 'of', 'the', 'USA', 'with', 'the', 'earliest', 'known', 'start', 'time', '?']	['Кто', 'является', '8', 'президентом', 'США', '?']	0.1883	0.1723	0.0	69.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI's of the entities that have the property ""Population size"" with European Union (wd:Q458) as their value?"	Какова численность населения Европейского Союза?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q458 wdt:P1082 ?uri . }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'have', 'the', 'property', '``', 'Population', 'size', ""''"", 'with', 'European', 'Union', '(', 'wd', ':', 'Q458', ')', 'as', 'their', 'value', '?']"	['Какова', 'численность', 'населения', 'Европейского', 'Союза', '?']	0.1726	0.0891	0.0	128.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI's of the entities that have the property ""Population size"" with European Union (wd:Q458) as their value?"	Общее количество населения Европейского Союза?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q458 wdt:P1082 ?uri . }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'have', 'the', 'property', '``', 'Population', 'size', ""''"", 'with', 'European', 'Union', '(', 'wd', ':', 'Q458', ')', 'as', 'their', 'value', '?']"	['Общее', 'количество', 'населения', 'Европейского', 'Союза', '?']	0.1726	0.0891	0.0	128.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	"What are the distinctive URI's of the entities that have the property ""Population size"" with European Union (wd:Q458) as their value?"	Сколько всего людей в Европейском союзе?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q458 wdt:P1082 ?uri . }	"['What', 'are', 'the', 'distinctive', 'URI', ""'s"", 'of', 'the', 'entities', 'that', 'have', 'the', 'property', '``', 'Population', 'size', ""''"", 'with', 'European', 'Union', '(', 'wd', ':', 'Q458', ')', 'as', 'their', 'value', '?']"	['Сколько', 'всего', 'людей', 'в', 'Европейском', 'союзе', '?']	0.1726	0.0968	0.0	127.0
 Трансформируй SPARQL запрос в вопрос на естественном языке. Выведи только транфсормируемый вопрос"	What are the distinct URI's of cosmodromes where the operator is NASA?	Перечислите все стартовые площадки NASA?	ru	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q194188 ; wdt:P137 wd:Q23548 . }	"['What', 'are', 'the', 'distinct', 'URI', ""'s"", 'of', 'cosmodromes', 'where', 'the', 'operator', 'is', 'NASA', '?']"	['Перечислите', 'все', 'стартовые', 'площадки', 'NASA', '?']	0.155	0.3693	0.125	61.0
232	"Имея следующий SPARQL запрос: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q131007 wdt:P178 ?uri . } 
 Где:
 wd:Q131007 именуется как ""World of Warcraft.""
 wdt:P178 именуется как ""разработчик.""
