id	prompt	generated_nl	gold_standard_nl	lang	model	prompt_type	query
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct films that William Shatner both directed and acted in as a cast member?	Give me all actors starring in movies directed by and starring William Shatner.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?film wdt:P57 wd:Q16297 ; wdt:P161 wd:Q16297   . ?film wdt:P161 ?uri . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the unique film entities that are subclasses of some entity and originate from Denmark?	Give me all Danish films.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q11424 . ?uri wdt:P31 ?type ; wdt:P495 wd:Q35 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the children of Bruce Lee?	Give me the grandchildren of Bruce Lee.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q16397 wdt:P40 ?children . ?children wdt:P40 ?uri . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct crew members of Apollo 14?	Give me the Apollo 14 astronauts.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q178871 wdt:P1029 ?uri }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct URI identifiers of entities that are conductors and play the trumpet as an instrument?	Give me a list of all trumpet players that were bandleaders.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q158852 ; wdt:P1303 wd:Q8338 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct museums that are located in London?	Show me all museums in London.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q33506> . ?uri <http://www.wikidata.org/prop/direct/P276> <http://www.wikidata.org/entity/Q84> . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the URI identifiers of entities that are writers and have received the Nobel Prize in Literature?	Give me all writers that won the Nobel Prize in literature.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P106 wd:Q36180 . ?uri wdt:P166 wd:Q37922 . } 
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct URI identifiers of basketball players with heights greater than 200 units?	Show me all basketball players that are higher than 2 meters.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q3665646> . ?uri <http://www.wikidata.org/prop/direct/P2048> ?height .  FILTER(?height > 200)}
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the URI identifiers of individuals who are swimmers and were born in Moscow?	Give all swimmers that were born in Moscow.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q10843402 ; wdt:P19 wd:Q649 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	Which distinct URI identifiers represent astronauts from the Soviet Union or Russia?	Give me all cosmonauts.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri  <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q11631> . { ?uri <http://www.wikidata.org/prop/direct/P27> <http://www.wikidata.org/entity/Q15180> } UNION { ?uri <http://www.wikidata.org/prop/direct/P27> <http://www.wikidata.org/entity/Q159> } }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	Which nonprofit organizations are headquartered in Switzerland, and which municipalities in Switzerland do they have their headquarters in? (or) What are the municipalities in Switzerland where nonprofit organizations are headquartered? (or) Where are the headquarters of nonprofit organizations located in Switzerland, and which municipalities in Switzerland are those in?	Give me all Swiss non-profit organizations.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q163740 . { ?uri wdt:P159 wd:Q39 . } UNION { ?uri wdt:P159 ?city . ?city wdt:P31 wd:Q70208 } }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct URI identifiers of association football clubs that participate in Bundesliga?	Show a list of soccer clubs that play in the Bundesliga.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q476028 ; wdt:P118 wd:Q82595 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the capitals of the countries that are part of the Himalayas?	Give me the capitals of all countries that the Himalayas run through.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q5451 wdt:P17 ?country . ?country wdt:P36 ?uri . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct islands in Japan?	Give me all islands that belong to Japan.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q23442 ; wdt:P17 wd:Q17 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	Which distinct association football clubs are part of the Premier League?	Give me all soccer clubs in the Premier League.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q476028> . ?uri <http://www.wikidata.org/prop/direct/P118> <http://www.wikidata.org/entity/Q9448> . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the UNESCO World Heritage Sites that were discovered or inventED more than 2 years but less than 5 years ago?	Give me all world heritage sites designated within the past two years.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX xsd: <http://www.w3.org/2001/XMLSchema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q9259 ; wdt:P575 ?date . BIND(xsd:integer(YEAR(?date)) as ?year) . BIND(xsd:integer(YEAR(NOW())) as ?currentYear) . FILTER(?year < ?currentYear && ?year < (?currentYear - 2)) . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the URI's of actors who were born in Paris after the year 1950?	Give me all actors who were born in Paris after 1950.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 ; wdt:P19 wd:Q90 ; wdt:P569 ?birthDate . BIND(YEAR(?birthDate) as ?birthYear) . FILTER(?birthYear > 1950) }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinctive nonprofit organizations that have their headquarters located in Australia?	Give me all Australian nonprofit organizations.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q163740 . { ?uri wdt:P159|wdt:P17 wd:Q408 . } UNION { ?uri wdt:P159|wdt:P17 ?city . ?city wdt:P159 wd:Q408 } }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct URI identifiers of individuals who have held the position of Federal Chancellor of Germany according to Wikidata?	Give me all federal chancellors of Germany.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P39> <http://www.wikidata.org/entity/Q4970706> . } 
 Transform the SPARQL query to a natural language question. Output just the transformed question"	"What are the URI identifiers of the entities representing the employees of Google?

 Transform the SPARQL query to a natural language question. Output just the transformed question"	Which actors were born in Berlin?	Give me all actors who were born in Berlin.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 ; wdt:P19 wd:Q64 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	Which URI's represent the creators of Goofy?	Who created Goofy?	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q111135> <http://www.wikidata.org/prop/direct/P170> ?uri . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	Which television programs have cast members who are instances of Neil Patrick Harris?	Give me all the TV shows with Neil Patrick Harris.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?type wdt:P279* wd:Q15416 . ?uri wdt:P161 wd:Q485310 . ?uri wdt:P31 ?type . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the uris of entities that represent public holidays in Sweden?	Give me all Swedish holidays.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q1401522 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct URI identifiers of businesses that operate in the marketing industry?	Give me all companies in the advertising industry.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4830453 ; wdt:P452 wd:Q39809 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	Which musical groups originated in Australia and belong to the metalcore genre?	Give me all Australian metalcore bands.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q215380 ; wdt:P495 wd:Q408 ; wdt:P136 wd:Q183862 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the URI identifiers of all entities that are subclasses of the eating disorder concept?	Give me all types of eating disorders.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279 wd:Q373822 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct URI identifiers of books with Danielle Steel as author?	Give me all books written by Danielle Steel.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q571> . ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q72653> . } 
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the URI labels of libraries that existed before the year 1400?	Give me all libraries established earlier than 1400.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7075 ; wdt:P571 ?date . FILTER (YEAR(?date) < 1400 ) }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the URI identifiers of politicians who have the religion or worldview of Methodism?	Give me all Methodist politicians.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P140 wd:Q33203 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	"""What are the song instances published between 1980 and 1990 by Bruce Springsteen?"""	Show me all songs from Bruce Springsteen released between 1980 and 1990.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7366 ; wdt:P577 ?date ; wdt:P175 wd:Q1225 . BIND(YEAR(?date) as ?year) . FILTER(?year >= 1980 && ?year <= 1990) }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct URI identifiers of lakes that are located in Denmark?	Give me a list of all lakes in Denmark.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q23397 ; wdt:P17 wd:Q35 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the historic counties of architectural styles that are subtypes of Gothic architecture?	Show me all English Gothic buildings in Kent.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?type wdt:P279* wd:Q176483 . ?uri wdt:P149 ?type ; wdt:P7959 wd:Q67479626 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	"What is the population of a city that is a subclass of a city and is located in a country named Germany, which is a instance of the country category?

Or in simpler terms:

 Transform the SPARQL query to a natural language question. Output just the transformed question"	"What is the mayor who is a human and has been the Mayor of Lisbon with the earliest start time for their position held in politics?

 Transform the SPARQL query to a natural language question. Output just the transformed question"	How many episodes belong to The Sopranos, season 1?	List all episodes of the first season of the HBO television series The Sopranos!	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT (COUNT(?episode) AS ?count) WHERE { ?episode wdt:P4908 wd:Q5274359 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct film instances that have Hal Roach as their producer?	Give me all films produced by Hal Roach.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q11424> . ?uri <http://www.wikidata.org/prop/direct/P162> <http://www.wikidata.org/entity/Q72792> . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	Who are the bandleaders that play the trumpet?	Give me a list of all bandleaders that play trumpet.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P106 wd:Q806349 . ?res wdt:P1303 wd:Q8338 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the names of cities in New Jersey with a population over 100,000 people?	Give me all cities in New Jersey with more than 100000 inhabitants.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q515> . ?uri <http://www.wikidata.org/prop/direct/P131>+ <http://www.wikidata.org/entity/Q1408> . ?uri <http://www.wikidata.org/prop/direct/P1082> ?population . FILTER(?population > 100000) }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	"What is the position held by the ""King of Rome"" entity in Wikidata?"	List the seven kings of Rome.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT * WHERE { ?res wdt:P39 wd:Q55375123 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	Which entities have been born in Vienna and died in Berlin or have been born in Berlin and died in Vienna, listing all the administrative territories they were located in during their lives?	Give me all people that were born in Vienna and died in Berlin.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT ?uri WHERE {{ ?uri wdt:P19/wdt:P131* wd:Q1741 . { SELECT ?uri WHERE { ?uri wdt:P20 wd:Q64 . }}} UNION { ?uri wdt:P20/wdt:P131* wd:Q64 . { SELECT ?uri WHERE { ?uri wdt:P19 wd:Q1741 . }}} UNION { ?uri wdt:P19/wdt:P131+ wd:Q1741 . { SELECT ?uri WHERE { ?uri wdt:P20/wdt:P131+ wd:Q64 . }}}}
 Transform the SPARQL query to a natural language question. Output just the transformed question"	"""Does Darth Vader have a child named Luke Skywalker?"""	Is Darth Vader Lukes father?	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12206942 wdt:P40 wd:Q51746 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct URI identifiers of breweries that are located in Australia?	Show me all the breweries in Australia.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q131734 . ?uri wdt:P17 wd:Q408 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct URI's of films produced by Steven Spielberg that cost more than 80 million dollars?	Give me all films produced by Steven Spielberg with a budget of at least $80 million.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P162 wd:Q8877 ; wdt:P31/wdt:P279* wd:Q11424 ; wdt:P2130 ?cost . FILTER(?cost > 80000000)}
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinctive association football clubs in Spain?	Give me all soccer clubs in Spain.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q476028> . ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q29> . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	Which distinct URI's represent breeds that are subclasses of German Shepherd?	Give me all breeds of the German Shepherd dog.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279* wd:Q38280 FILTER(?uri != wd:Q38280) }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	"What are the distinct film entities that are subclasses of entities with a director ""Francis Ford Coppola"" and are instances of the film class?"	Give me all movies directed by Francis Ford Coppola.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q11424 ; wdt:P57 wd:Q56094 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	"What is the birthdate of the person with the occupation of a darts player, and what is that person's identity?

 Transform the SPARQL query to a natural language question. Output just the transformed question"	"What is the name of the spouse of Barack Obama, as labeled in the RDF dataset?

Or, in simpler terms:

 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the unique spaceports operated by the National Aeronautics and Space Administration?	Give me all launch pads operated by NASA.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q194188 ; wdt:P137 wd:Q23548 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	"What are the distinct URI identifiers of dramatico-musical works that have a composer with the name ""Elton John"" and are instances of or subclasses of any musical genre or creative work type?"	List all the musicals with music by Elton John.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31/wdt:P279* wd:Q58483083 ; wdt:P86 wd:Q2808 . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What is the duration of Toy Story?	Give me the runtime of Toy Story.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?val WHERE { wd:Q171048 wdt:P2047 ?val . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the children of Margaret Thatcher?	List the children of Margaret Thatcher.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q7416 wdt:P40 ?uri . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct UrbanMusicDB movie entities that represent films and have William Shatner as their director and are also listed as cast members?	Give me all actors starring in movies directed by William Shatner.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?movie wdt:P31 wd:Q11424 ; wdt:P57 wd:Q16297  ; wdt:P161 ?uri . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What is the place of birth of Frank Sinatra?	Give me the birth place of Frank Sinatra.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q40912 wdt:P19 ?uri }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	"What is the sports team membership of Neymar?

Or

 Transform the SPARQL query to a natural language question. Output just the transformed question"	"""Did Aristotle get influenced by Socrates?""

Alternatively, if you prefer a more formal question:

 Transform the SPARQL query to a natural language question. Output just the transformed question"	Who are the children of Elvis Presley?	Give me the grandchildren of Elvis Presley.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT DISTINCT ?o2 WHERE { <http://www.wikidata.org/entity/Q303>  <http://www.wikidata.org/prop/direct/P40>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P40> ?o2 }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	"What is the spouse of Barack Obama?

 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct URI identifiers of books with Muhammad Ali as their author?	Show me the book that Muhammad Ali wrote.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q571> . ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q36107> . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What are the distinct URI identifiers of works authored by Ernest Hemingway and belonging to the genre of autobiography?	Show me Hemingway's autobiography.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q23434> . ?uri <http://www.wikidata.org/prop/direct/P136> <http://www.wikidata.org/entity/Q4184> . }
392	"Having a SPARQL query: SELECT ?o1 { <http://www.wikidata.org/entity/Q4740851> <http://www.wikidata.org/prop/direct/P2048>  ?o1 .  } 
 Where:
 http://www.wikidata.org/entity/Q4740851 has human-readable name ""Amazon Eve.""
 http://www.wikidata.org/prop/direct/P2048 has human-readable name ""height.""
 Transform the SPARQL query to a natural language question. Output just the transformed question"	Which record labels have released grunge music in Canada?	Give me all Canadian Grunge record labels.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	 SELECT ?s1 WHERE { ?s1  wdt:P136  <http://www.wikidata.org/entity/Q11365> . ?s1  wdt:P31  <http://www.wikidata.org/entity/Q18127> . ?s1  wdt:P17 <http://www.wikidata.org/entity/Q16> . }
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What is the currency of People's Republic of China?	Give me the currency of China.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q148>  <http://www.wikidata.org/prop/direct/P38>  ?o1 .  } 
 Transform the SPARQL query to a natural language question. Output just the transformed question"	What is the country of citizenship and occupation of the oceanographer?	Give me all Swedish oceanographers.	en	mistralai/Mistral-7B-Instruct-v0.2	ZERO_SHOT	SELECT ?s1 WHERE {   ?s1  <http://www.wikidata.org/prop/direct/P27>  <http://www.wikidata.org/entity/Q34> .   ?s1  <http://www.wikidata.org/prop/direct/P106>  <http://www.wikidata.org/entity/Q3546255> .  }
