{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q152316 wdt:P22 ?father ; wdt:P25 ?mother . wd:Q36812 wdt:P22 ?father ; wdt:P25 ?mother . }   \u0413\u0434\u0435:  wd:Q152316 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0413\u0430\u0440\u0440\u0438, \u0433\u0435\u0440\u0446\u043e\u0433 \u0421\u0430\u0441\u0441\u0435\u043a\u0441\u043a\u0438\u0439.\"  wdt:P22 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043e\u0442\u0435\u0446.\"  wd:Q152316 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0413\u0430\u0440\u0440\u0438, \u0433\u0435\u0440\u0446\u043e\u0433 \u0421\u0430\u0441\u0441\u0435\u043a\u0441\u043a\u0438\u0439.\"  wdt:P25 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043c\u0430\u0442\u044c.\"  wd:Q36812 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0423\u0438\u043b\u044c\u044f\u043c, \u043f\u0440\u0438\u043d\u0446 \u0423\u044d\u043b\u044c\u0441\u043a\u0438\u0439.\"  wdt:P22 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043e\u0442\u0435\u0446.\"  wd:Q36812 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0423\u0438\u043b\u044c\u044f\u043c, \u043f\u0440\u0438\u043d\u0446 \u0423\u044d\u043b\u044c\u0441\u043a\u0438\u0439.\"  wdt:P25 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043c\u0430\u0442\u044c.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u0423 \u043f\u0440\u0438\u043d\u0446\u0430 \u0413\u0430\u0440\u0440\u0438 \u0438 \u0412\u0438\u043b\u044c\u044f\u043c\u0430 \u043e\u0434\u043d\u0438 \u0438 \u0442\u0435 \u0436\u0435 \u0440\u043e\u0434\u0438\u0442\u0435\u043b\u0438?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P31 wd:Q8502 . ?res wdt:P131+ wd:Q1202 . ?res wdt:P2044 ?height . } ORDER BY DESC(?height) LIMIT 1   \u0413\u0434\u0435:  wdt:P31 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u044d\u0442\u043e \u0447\u0430\u0441\u0442\u043d\u044b\u0439 \u0441\u043b\u0443\u0447\u0430\u0439 \u043f\u043e\u043d\u044f\u0442\u0438\u044f.\"  wd:Q8502 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0433\u043e\u0440\u0430.\"  wdt:P131 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0430\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u0438\u0432\u043d\u043e-\u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0430\u043b\u044c\u043d\u0430\u044f \u0435\u0434\u0438\u043d\u0438\u0446\u0430.\"  wd:Q1202 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0421\u0430\u043a\u0441\u043e\u043d\u0438\u044f.\"  wdt:P2044 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0432\u044b\u0441\u043e\u0442\u0430 \u043d\u0430\u0434 \u0443\u0440\u043e\u0432\u043d\u0435\u043c \u043c\u043e\u0440\u044f.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a\u0430\u043a\u0430\u044f \u0433\u043e\u0440\u0430 \u0432 \u0421\u0430\u043a\u0441\u043e\u043d\u0438\u0438 \u0441\u0430\u043c\u0430\u044f \u0432\u044b\u0441\u043e\u043a\u0430\u044f?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P106> <http://www.wikidata.org/entity/Q3665646> . ?uri <http://www.wikidata.org/prop/direct/P2048> ?height .  FILTER(?height > 200)}   \u0413\u0434\u0435:  http://www.wikidata.org/prop/direct/P106 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0440\u043e\u0434 \u0437\u0430\u043d\u044f\u0442\u0438\u0439.\"  http://www.wikidata.org/entity/Q3665646 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0431\u0430\u0441\u043a\u0435\u0442\u0431\u043e\u043b\u0438\u0441\u0442.\"  http://www.wikidata.org/prop/direct/P2048 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0432\u044b\u0441\u043e\u0442\u0430/\u0440\u043e\u0441\u0442.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041f\u043e\u043a\u0430\u0436\u0438 \u043c\u043d\u0435 \u0432\u0441\u0435\u0445 \u0431\u0430\u0441\u043a\u0435\u0442\u0431\u043e\u043b\u0438\u0441\u0442\u043e\u0432 \u0432\u044b\u0448\u0435 \u0434\u0432\u0443\u0445 \u043c\u0435\u0442\u0440\u043e\u0432.   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { wd:Q567 wdt:P69 ?res . ?res wdt:P31/wdt:P279* wd:Q3918 . }   \u0413\u0434\u0435:  wd:Q567 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0410\u043d\u0433\u0435\u043b\u0430 \u041c\u0435\u0440\u043a\u0435\u043b\u044c.\"  wdt:P69 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0443\u0447\u0435\u0431\u043d\u043e\u0435 \u0437\u0430\u0432\u0435\u0434\u0435\u043d\u0438\u0435.\"  wdt:P31 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u044d\u0442\u043e \u0447\u0430\u0441\u0442\u043d\u044b\u0439 \u0441\u043b\u0443\u0447\u0430\u0439 \u043f\u043e\u043d\u044f\u0442\u0438\u044f.\"  wdt:P279 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u043e\u0434\u043a\u043b\u0430\u0441\u0441 \u043e\u0442.\"  wd:Q3918 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a\u0430\u043a\u043e\u0439 \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442 \u043e\u043a\u043e\u043d\u0447\u0438\u043b\u0430 \u043a\u0430\u043d\u0446\u043b\u0435\u0440 \u0413\u0435\u0440\u043c\u0430\u043d\u0438\u0438 \u0410\u043d\u0433\u0435\u043b\u0430 \u041c\u0435\u0440\u043a\u0435\u043b\u044c?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q189080> <http://www.wikidata.org/prop/direct/P136> ?uri . }   \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q189080 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041b\u0443 \u0420\u0438\u0434.\"  http://www.wikidata.org/prop/direct/P136 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0436\u0430\u043d\u0440.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u0412 \u043a\u0430\u043a\u0438\u0445 \u043c\u0443\u0437\u044b\u043a\u0430\u043b\u044c\u043d\u044b\u0445 \u0441\u0442\u0438\u043b\u044f\u0445 \u0438\u0433\u0440\u0430\u043b \u041b\u0443 \u0420\u0438\u0434?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q4830453 . ?uri wdt:P31 ?type ; wdt:P1128 ?num . FILTER(?num > 1000000) }   \u0413\u0434\u0435:  wdt:P279 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u043e\u0434\u043a\u043b\u0430\u0441\u0441 \u043e\u0442.\"  wd:Q4830453 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0431\u0438\u0437\u043d\u0435\u0441-\u043f\u0440\u0435\u0434\u043f\u0440\u0438\u044f\u0442\u0438\u0435.\"  wdt:P31 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u044d\u0442\u043e \u0447\u0430\u0441\u0442\u043d\u044b\u0439 \u0441\u043b\u0443\u0447\u0430\u0439 \u043f\u043e\u043d\u044f\u0442\u0438\u044f.\"  wdt:P1128 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0447\u0438\u0441\u043b\u043e \u0441\u043e\u0442\u0440\u0443\u0434\u043d\u0438\u043a\u043e\u0432.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a\u0430\u043a\u0442\u0435 \u043a\u043e\u043c\u043f\u0430\u043d\u0438\u0438 \u0438\u043c\u0435\u044e\u0442 \u0431\u043e\u043b\u044c\u0448\u0435 \u0447\u0435\u043c 1 \u043c\u0438\u043b\u043b\u0438\u043e\u043d \u0440\u0430\u0431\u043e\u0442\u043d\u0438\u043a\u043e\u0432?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q171684> <http://www.wikidata.org/prop/direct/P119> ?uri  . }   \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q171684 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041b\u0438 \u0421\u044b\u043d \u041c\u0430\u043d.\"  http://www.wikidata.org/prop/direct/P119 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043c\u0435\u0441\u0442\u043e \u043f\u043e\u0433\u0440\u0435\u0431\u0435\u043d\u0438\u044f.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u0413\u0434\u0435 \u043f\u043e\u0445\u043e\u0440\u043e\u043d\u0435\u043d \u0421\u0438\u043d\u0433\u043c\u0430\u043d \u0420\u0438?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1010 wdt:P1082 ?uri . }   \u0413\u0434\u0435:  wd:Q1010 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041c\u0430\u0440\u0438\u0431\u043e\u0440.\"  wdt:P1082 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0447\u0438\u0441\u043b\u0435\u043d\u043d\u043e\u0441\u0442\u044c \u043d\u0430\u0441\u0435\u043b\u0435\u043d\u0438\u044f.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u0421\u043a\u043e\u043b\u044c\u043a\u043e \u0436\u0438\u0442\u0435\u043b\u0435\u0439 \u0432 \u041c\u0430\u0440\u0438\u0431\u043e\u0440\u0435"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P17 wd:Q38 ; wdt:P2044 ?elevation . } ORDER BY DESC(?elevation) LIMIT 1   \u0413\u0434\u0435:  wdt:P31 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u044d\u0442\u043e \u0447\u0430\u0441\u0442\u043d\u044b\u0439 \u0441\u043b\u0443\u0447\u0430\u0439 \u043f\u043e\u043d\u044f\u0442\u0438\u044f.\"  wd:Q8502 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0433\u043e\u0440\u0430.\"  wdt:P17 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u043e.\"  wd:Q38 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0418\u0442\u0430\u043b\u0438\u044f.\"  wdt:P2044 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0432\u044b\u0441\u043e\u0442\u0430 \u043d\u0430\u0434 \u0443\u0440\u043e\u0432\u043d\u0435\u043c \u043c\u043e\u0440\u044f.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041a\u0430\u043a\u0430\u044f \u0441\u0430\u043c\u0430\u044f \u0432\u044b\u0441\u043e\u043a\u0430\u044f \u0433\u043e\u0440\u0430 \u0418\u0442\u0430\u043b\u0438\u0438?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q9696 wdt:P20 ?uri . }   \u0413\u0434\u0435:  wd:Q9696 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0414\u0436\u043e\u043d \u0424\u0438\u0446\u0434\u0436\u0435\u0440\u0430\u043b\u044c\u0434 \u041a\u0435\u043d\u043d\u0435\u0434\u0438.\"  wdt:P20 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043c\u0435\u0441\u0442\u043e \u0441\u043c\u0435\u0440\u0442\u0438.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u0413\u0434\u0435 \u0431\u044b\u043b \u0443\u0431\u0438\u0442 \u0414\u0436\u043e\u043d \u0424\u0438\u0446\u0434\u0436\u0435\u0440\u0430\u043b\u044c\u0434 \u041a\u0435\u043d\u043d\u0435\u0434\u0438?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?res WHERE { ?res wdt:P175 wd:Q483407 . ?res p:P1433 _:a ._:a pq:P2868 wd:Q13432985 . }   \u0413\u0434\u0435:  wdt:P175 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0438\u0441\u043f\u043e\u043b\u043d\u0438\u0442\u0435\u043b\u044c.\"  wd:Q483407 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"Ramones.\"  p:P1433 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043e\u043f\u0443\u0431\u043b\u0438\u043a\u043e\u0432\u0430\u043d\u043e \u0432.\"  pq:P2868 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0432 \u043a\u0430\u0447\u0435\u0441\u0442\u0432\u0435.\"  wd:Q13432985 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0441\u0442\u043e\u0440\u043e\u043d\u0430 \u00ab\u0411\u00bb.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041f\u0435\u0440\u0435\u0447\u0438\u0441\u043b\u0438\u0442\u0435 \u043f\u0435\u0441\u043d\u0438 \u0441\u043e \u0432\u0442\u043e\u0440\u043e\u0439 \u0441\u0442\u043e\u0440\u043e\u043d\u044b \u043f\u043b\u0430\u0441\u0442\u0438\u043d\u043e\u043a \u0433\u0440\u0443\u043f\u043f\u044b Ramones.   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?date WHERE { wd:Q1951 wdt:P571 ?date . }   \u0413\u0434\u0435:  wd:Q1951 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0410\u043b\u044c\u0431\u0435\u0440\u0442\u0430.\"  wdt:P571 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0434\u0430\u0442\u0430 \u043e\u0441\u043d\u043e\u0432\u0430\u043d\u0438\u044f / \u0441\u043e\u0437\u0434\u0430\u043d\u0438\u044f / \u0432\u043e\u0437\u043d\u0438\u043a\u043d\u043e\u0432\u0435\u043d\u0438\u044f.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u0412 \u043a\u0430\u043a\u043e\u043c \u0433\u043e\u0434\u0443 \u0410\u043b\u044c\u0431\u0435\u0440\u0442\u0430 \u0431\u044b\u043b\u0430 \u043f\u0440\u0438\u0437\u043d\u0430\u043d\u0430 \u043f\u0440\u043e\u0432\u0438\u043d\u0446\u0438\u0435\u0439?"}]}
{"messages": [{"role": "user", "content": "Gegeben ist die SPARQL-Anfrage: SELECT ?o1 { <http://www.wikidata.org/entity/Q4740851> <http://www.wikidata.org/prop/direct/P2048>  ?o1 .  }   Dabei gilt:  Die Bezeichnung von http://www.wikidata.org/entity/Q4740851 ist \"Erika Ervin.\"  Die Bezeichnung von http://www.wikidata.org/prop/direct/P2048 ist \"H\u00f6he.\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus.. Wie gro\u00df ist Amazon Eve?   -----------  Gegeben ist die SPARQL-Anfrage: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q4022 . ?lake wdt:P31 wd:Q23397 ; wdt:P17 wd:183 . ?uri wdt:P200 ?lake . }   Dabei gilt:  Die Bezeichnung von wdt:P31 ist \"ist ein(e).\"  Die Bezeichnung von wd:Q4022 ist \"Fluss.\"  Die Bezeichnung von wdt:P31 ist \"ist ein(e).\"  Die Bezeichnung von wd:Q23397 ist \"See.\"  Die Bezeichnung von wdt:P17 ist \"Staat.\"  Die Bezeichnung von wdt:P200 ist \"Zufluss.\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus."}, {"role": "assistant", "content": "Welche Fl\u00fcsse flie\u00dfen in einen deutschen See?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q2743 ; wdt:P86 wd:Q152505 . }   \u0413\u0434\u0435:  wdt:P31 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u044d\u0442\u043e \u0447\u0430\u0441\u0442\u043d\u044b\u0439 \u0441\u043b\u0443\u0447\u0430\u0439 \u043f\u043e\u043d\u044f\u0442\u0438\u044f.\"  wd:Q2743 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043c\u044e\u0437\u0438\u043a\u043b.\"  wdt:P86 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043a\u043e\u043c\u043f\u043e\u0437\u0438\u0442\u043e\u0440.\"  wd:Q152505 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041b\u0435\u043e\u043d\u0430\u0440\u0434 \u0411\u0435\u0440\u043d\u0441\u0442\u0430\u0439\u043d.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041d\u0430\u0437\u043e\u0432\u0438\u0442\u0435 \u0432\u0441\u0435 \u043c\u044e\u0437\u043a\u043b\u044b, \u0433\u0434\u0435 \u0430\u0432\u0442\u043e\u0440\u043e\u043c \u043c\u0443\u0437\u044b\u043a\u0438 \u0431\u044b\u043b \u041b\u0435\u043e\u043d\u0430\u0440\u0434 \u0411\u0435\u0440\u043d\u0448\u0442\u0435\u0439\u043d.   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q154946 wdt:P119 ?uri . }   \u0413\u0434\u0435:  wd:Q154946 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u042e\u043b\u0438\u0430\u043d\u0430 \u041d\u0438\u0434\u0435\u0440\u043b\u0430\u043d\u0434\u0441\u043a\u0430\u044f.\"  wdt:P119 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043c\u0435\u0441\u0442\u043e \u043f\u043e\u0433\u0440\u0435\u0431\u0435\u043d\u0438\u044f.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u0412 \u043a\u0430\u043a\u043e\u043c \u0433\u043e\u0440\u043e\u0434\u0435 \u0431\u044b\u043b\u0430 \u0440\u043e\u0436\u0434\u0435\u043d\u0430 \u0431\u044b\u0432\u0448\u0430\u044f \u043a\u043e\u0440\u043e\u043b\u0435\u0432\u0430 \u041d\u0438\u0434\u0435\u0440\u043b\u0430\u043d\u0434\u043e\u0432 - \u0414\u0436\u0443\u043b\u0438\u0430\u043d\u0430?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q796 wdt:P1082 ?val . }   \u0413\u0434\u0435:  wd:Q796 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0418\u0440\u0430\u043a.\"  wdt:P1082 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0447\u0438\u0441\u043b\u0435\u043d\u043d\u043e\u0441\u0442\u044c \u043d\u0430\u0441\u0435\u043b\u0435\u043d\u0438\u044f.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041a\u0430\u043a\u043e\u0432\u043e \u043d\u0430\u0441\u0435\u043b\u0435\u043d\u0438\u0435 \u0418\u0440\u0430\u043a\u0430?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?num WHERE { wd:Q1207989 wdt:P2048 ?num . }   \u0413\u0434\u0435:  wd:Q1207989 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041c\u0430\u0440\u0438\u043d-\u0442\u0430\u0443\u044d\u0440.\"  wdt:P2048 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0432\u044b\u0441\u043e\u0442\u0430/\u0440\u043e\u0441\u0442.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a\u0430\u043a\u043e\u0432\u0430 \u0432\u044b\u0441\u043e\u0442\u0430 \u041c\u043e\u0440\u0441\u043a\u043e\u0439 \u0431\u0430\u0448\u043d\u0438 \u0432 \u0418\u043e\u043a\u043e\u0433\u0430\u043c\u0435?"}]}
