{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9036 wdt:P166 wd:Q38104 . }   \u0413\u0434\u0435:  wd:Q9036 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041d\u0438\u043a\u043e\u043b\u0430 \u0422\u0435\u0441\u043b\u0430.\"  wdt:P166 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u043e\u043b\u0443\u0447\u0435\u043d\u043d\u044b\u0435 \u043d\u0430\u0433\u0440\u0430\u0434\u044b.\"  wd:Q38104 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041d\u043e\u0431\u0435\u043b\u0435\u0432\u0441\u043a\u0430\u044f \u043f\u0440\u0435\u043c\u0438\u044f \u043f\u043e \u0444\u0438\u0437\u0438\u043a\u0435.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041f\u043e\u043b\u0443\u0447\u0438\u043b \u043b\u0438 \u0422\u0435\u0441\u043b\u0430 \u041d\u043e\u0431\u0435\u043b\u0435\u0432\u0441\u043a\u0443\u044e \u043f\u0440\u0435\u043c\u0438\u044e \u043f\u043e \u0444\u0438\u0437\u0438\u043a\u0435?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q5401 wdt:P1082 ?val . }   \u0413\u0434\u0435:  wd:Q5401 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0415\u0432\u0440\u0430\u0437\u0438\u044f.\"  wdt:P1082 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0447\u0438\u0441\u043b\u0435\u043d\u043d\u043e\u0441\u0442\u044c \u043d\u0430\u0441\u0435\u043b\u0435\u043d\u0438\u044f.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u0421\u043a\u043e\u043b\u044c\u043a\u043e \u043b\u044e\u0434\u0435\u0439 \u0436\u0438\u0432\u0435\u0442 \u0432 \u0415\u0432\u0440\u0430\u0437\u0438\u0438?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P106 wd:Q82955 ; wdt:P69 wd:Q49088 . }   \u0413\u0434\u0435:  wdt:P106 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0440\u043e\u0434 \u0437\u0430\u043d\u044f\u0442\u0438\u0439.\"  wd:Q82955 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u043e\u043b\u0438\u0442\u0438\u043a.\"  wdt:P69 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0443\u0447\u0435\u0431\u043d\u043e\u0435 \u0437\u0430\u0432\u0435\u0434\u0435\u043d\u0438\u0435.\"  wd:Q49088 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041a\u043e\u043b\u0443\u043c\u0431\u0438\u0439\u0441\u043a\u0438\u0439 \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u0421\u043a\u043e\u043b\u044c\u043a\u043e \u043f\u043e\u043b\u0438\u0442\u0438\u043a\u043e\u0432 \u0432\u044b\u043f\u0443\u0441\u0442\u0438\u043b\u043e\u0441\u044c \u0438\u0437 \u041a\u043e\u043b\u0443\u043c\u0431\u0438\u0439\u0441\u043a\u043e\u0433\u043e \u0443\u043d\u0438\u0432\u0435\u0440\u0441\u0438\u0442\u0435\u0442\u0430?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?label WHERE { wd:Q59150527 wdt:P527 ?uri . ?uri wdt:P577 ?date . ?uri wdt:P264 ?label . } ORDER BY ?date LIMIT 1   \u0413\u0434\u0435:  wdt:P527 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0441\u043e\u0441\u0442\u043e\u0438\u0442 \u0438\u0437.\"  wdt:P577 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0434\u0430\u0442\u0430 \u043f\u0443\u0431\u043b\u0438\u043a\u0430\u0446\u0438\u0438.\"  wdt:P264 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043b\u0435\u0439\u0431\u043b \u0437\u0432\u0443\u043a\u043e\u0437\u0430\u043f\u0438\u0441\u0438.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u0414\u043b\u044f \u043a\u0430\u043a\u043e\u0433\u043e \u043b\u0435\u0439\u0431\u043b\u0430 \u042d\u043b\u0432\u0438\u0441 \u0437\u0430\u043f\u0438\u0441\u0430\u043b \u0441\u0432\u043e\u0439 \u043f\u0435\u0440\u0432\u044b\u0439 \u0430\u043b\u044c\u0431\u043e\u043c?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q189080> <http://www.wikidata.org/prop/direct/P136> ?uri . }   \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q189080 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041b\u0443 \u0420\u0438\u0434.\"  http://www.wikidata.org/prop/direct/P136 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0436\u0430\u043d\u0440.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041a\u0430\u043a\u0443\u044e \u043c\u0443\u0437\u044b\u043a\u0443 \u0438\u0433\u0440\u0430\u043b \u041b\u0443 \u0420\u0438\u0434?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?type wdt:P279* wd:Q176483 . ?uri wdt:P149 ?type ; wdt:P7959 wd:Q67479626 . }   \u0413\u0434\u0435:  wdt:P279 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u043e\u0434\u043a\u043b\u0430\u0441\u0441 \u043e\u0442.\"  wd:Q176483 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0433\u043e\u0442\u0438\u0447\u0435\u0441\u043a\u0430\u044f \u0430\u0440\u0445\u0438\u0442\u0435\u043a\u0442\u0443\u0440\u0430.\"  wdt:P149 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0430\u0440\u0445\u0438\u0442\u0435\u043a\u0442\u0443\u0440\u043d\u044b\u0439 \u0441\u0442\u0438\u043b\u044c.\"  wdt:P7959 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0438\u0441\u0442\u043e\u0440\u0438\u0447\u0435\u0441\u043a\u043e\u0435 \u0433\u0440\u0430\u0444\u0441\u0442\u0432\u043e.\"  wd:Q67479626 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041a\u0435\u043d\u0442.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041f\u043e\u043a\u0430\u0436\u0438\u0442\u0435 \u043c\u043d\u0435 \u0432\u0441\u0435 \u0437\u0434\u0430\u043d\u0438\u044f \u0432 \u0441\u0442\u0438\u043b\u0435 \u0410\u043d\u0433\u043b\u0438\u0439\u0441\u043a\u043e\u0439 \u0413\u043e\u0442\u0438\u043a\u0438 \u0432 \u041a\u0435\u043d\u0442\u0435."}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q5582> <http://www.wikidata.org/prop/direct/P737> ?uri . }   \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q5582 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0412\u0438\u043d\u0441\u0435\u043d\u0442 \u0412\u0430\u043d \u0413\u043e\u0433.\"  http://www.wikidata.org/prop/direct/P737 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0438\u0441\u043f\u044b\u0442\u0430\u043b \u0432\u043b\u0438\u044f\u043d\u0438\u0435 \u043e\u0442.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041a\u0435\u043c \u0432\u0434\u043e\u0445\u043d\u043e\u0432\u043b\u044f\u043b\u0441\u044f \u0412\u0438\u043d\u0441\u0435\u043d\u0442 \u0432\u0430\u043d \u0413\u043e\u0433?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q11424 . ?uri wdt:P31 ?type ; wdt:P161 wd:Q35332 ; wdt:P57 wd:Q192990 . }   \u0413\u0434\u0435:  wdt:P279 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u043e\u0434\u043a\u043b\u0430\u0441\u0441 \u043e\u0442.\"  wd:Q11424 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0444\u0438\u043b\u044c\u043c.\"  wdt:P31 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u044d\u0442\u043e \u0447\u0430\u0441\u0442\u043d\u044b\u0439 \u0441\u043b\u0443\u0447\u0430\u0439 \u043f\u043e\u043d\u044f\u0442\u0438\u044f.\"  wdt:P161 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0432 \u0440\u043e\u043b\u044f\u0445.\"  wd:Q35332 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0411\u0440\u044d\u0434 \u041f\u0438\u0442\u0442.\"  wdt:P57 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0440\u0435\u0436\u0438\u0441\u0441\u0451\u0440.\"  wd:Q192990 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0413\u0430\u0439 \u0420\u0438\u0447\u0438.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u0424\u0438\u043b\u044c\u043c\u044b, \u0432 \u043a\u043e\u0442\u043e\u0440\u044b\u0445 \u0441\u043d\u0438\u043c\u0430\u043b\u0441\u044f \u0411\u0440\u0435\u0434 \u041f\u0438\u0442\u0442 \u0438 \u0440\u0435\u0436\u0438\u0441\u0435\u0440\u0435\u043c \u0431\u044b\u043b \u0413\u0430\u0439 \u0420\u0438\u0447\u0438"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q177397 wdt:P131 ?obj . ?obj wdt:P131 ?uri . }   \u0413\u0434\u0435:  wd:Q177397 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0417\u043e\u043d\u0430 51.\"  wdt:P131 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0430\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u0438\u0432\u043d\u043e-\u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0430\u043b\u044c\u043d\u0430\u044f \u0435\u0434\u0438\u043d\u0438\u0446\u0430.\"  wdt:P131 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0430\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u0438\u0432\u043d\u043e-\u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0430\u043b\u044c\u043d\u0430\u044f \u0435\u0434\u0438\u043d\u0438\u0446\u0430.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u0412 \u043a\u0430\u043a\u043e\u043c \u0448\u0442\u0430\u0442\u0435 \u0421\u0428\u0410 \u043d\u0430\u0445\u043e\u0434\u0438\u0442\u0441\u044f \u0417\u043e\u043d\u0430 51?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q93284 wdt:P172 wd:Q7325 . }   \u0413\u0434\u0435:  wd:Q93284 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041c\u0430\u0440\u043a \u0417\u0430\u0445\u0430\u0440\u043e\u0432\u0438\u0447 \u0428\u0430\u0433\u0430\u043b.\"  wdt:P172 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u044d\u0442\u043d\u0438\u0447\u0435\u0441\u043a\u0430\u044f \u0433\u0440\u0443\u043f\u043f\u0430.\"  wd:Q7325 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0435\u0432\u0440\u0435\u0438.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041c\u0430\u0440\u043a \u0428\u0430\u0433\u0430\u043b \u0431\u044b\u043b \u0435\u0432\u0440\u0435\u0435\u043c"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1163227 wdt:P50 ?uri . }   \u0413\u0434\u0435:  wd:Q1163227 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0421\u0442\u043e\u043b\u043f\u044b \u0417\u0435\u043c\u043b\u0438.\"  wdt:P50 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0430\u0432\u0442\u043e\u0440.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041a\u0442\u043e \u0430\u0432\u0442\u043e\u0440 \u043a\u043d\u0438\u0433\u0438 \"\u0421\u0442\u043e\u043b\u043f\u044b \u0417\u0435\u043c\u043b\u0438\"?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT (COUNT(DISTINCT ?uri) as ?count) WHERE {  ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q315484> . }   \u0413\u0434\u0435:  http://www.wikidata.org/prop/direct/P57 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0440\u0435\u0436\u0438\u0441\u0441\u0451\u0440.\"  http://www.wikidata.org/entity/Q315484 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041f\u0430\u043a \u0427\u0445\u0430\u043d \u0423\u043a.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u0421\u043a\u043e\u043b\u044c\u043a\u043e \u0444\u0438\u043b\u044c\u043c\u043e\u0432 \u0441\u0440\u0435\u0436\u0435\u0441\u0441\u0438\u0440\u043e\u0432\u0430\u043b \u041f\u0430\u043a \u0427\u0430\u043d \u0423\u043a?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { wd:Q43874 wdt:P40 ?uri . }   \u0413\u0434\u0435:  wd:Q43874 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u042d\u0434\u0434\u0438 \u041c\u0451\u0440\u0444\u0438.\"  wdt:P40 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0434\u0435\u0442\u0438.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u0421\u043a\u043e\u043b\u044c\u043a\u043e \u0434\u0435\u0442\u0435\u0439 \u0438\u043c\u0435\u0435\u0442 \u042d\u0434\u0434\u0438 \u041c\u0435\u0440\u0444\u0438?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1214 wdt:P6 ?uri . }   \u0413\u0434\u0435:  wd:Q1214 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0412\u0430\u0439\u043e\u043c\u0438\u043d\u0433.\"  wdt:P6 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0433\u043b\u0430\u0432\u0430 \u043f\u0440\u0430\u0432\u0438\u0442\u0435\u043b\u044c\u0441\u0442\u0432\u0430.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a\u0442\u043e \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f \u0433\u0443\u0431\u0435\u0440\u043d\u0430\u0442\u043e\u0440\u043e\u043c \u0448\u0442\u0430\u0442\u0430 \u0412\u0430\u0439\u043e\u043c\u0438\u043d\u0433?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q7416 wdt:P40 ?uri . }   \u0413\u0434\u0435:  wd:Q7416 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041c\u0430\u0440\u0433\u0430\u0440\u0435\u0442 \u0422\u044d\u0442\u0447\u0435\u0440.\"  wdt:P40 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0434\u0435\u0442\u0438.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041f\u0435\u0440\u0435\u0447\u0438\u0441\u043b\u0438\u0442\u0435 \u0434\u0435\u0442\u0435\u0439 \u041c\u0430\u0440\u0433\u0430\u0440\u0435\u0442 \u0422\u044d\u0442\u0447\u0435\u0440.   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441:  SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q187893>  <http://www.wikidata.org/prop/direct/P421>  ?o1 .  }    \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q187893 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0421\u0430\u043d-\u041f\u0435\u0434\u0440\u043e-\u0434\u0435-\u0410\u0442\u0430\u043a\u0430\u043c\u0430.\"  http://www.wikidata.org/prop/direct/P421 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0447\u0430\u0441\u043e\u0432\u043e\u0439 \u043f\u043e\u044f\u0441.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u0412\u0440\u0435\u043c\u0435\u043d\u043d\u043e\u0439 \u043f\u043e\u044f\u0441 \u0432 \u0421\u0430\u043d-\u041f\u0435\u0434\u0440\u043e-\u0434\u0435-\u0410\u0442\u0430\u043a\u0430\u043c\u0430"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P279* wd:Q41291 . ?uri wdt:P1427 wd:Q177477  . }   \u0413\u0434\u0435:  wdt:P279 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u043e\u0434\u043a\u043b\u0430\u0441\u0441 \u043e\u0442.\"  wd:Q41291 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0440\u0430\u043a\u0435\u0442\u0430.\"  wdt:P1427 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043d\u0430\u0447\u0430\u043b\u043e \u043f\u0443\u0442\u0438.\"  wd:Q177477 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0411\u0430\u0439\u043a\u043e\u043d\u0443\u0440.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041a\u0430\u043a\u0438\u0435 \u0440\u0430\u043a\u0435\u0442\u044b \u0431\u044b\u043b\u0438 \u0437\u0430\u043f\u0443\u0449\u0435\u043d\u044b \u0441 \u0411\u0430\u0439\u043a\u043e\u043d\u0443\u0440\u0430?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q51803 wdt:P175 ?uri }   \u0413\u0434\u0435:  wd:Q51803 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0427\u0443\u0431\u0430\u043a\u043a\u0430.\"  wdt:P175 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0438\u0441\u043f\u043e\u043b\u043d\u0438\u0442\u0435\u043b\u044c.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a\u0442\u043e \u0438\u0433\u0440\u0430\u043b \u0440\u043e\u043b\u044c \u0427\u0443\u0431\u0430\u043a\u043a\u0438?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: ASK WHERE { <http://www.wikidata.org/entity/Q7934> <http://www.wikidata.org/prop/direct/P570> ?date . FILTER(!BOUND(?date)) }   \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q7934 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0424\u0440\u044d\u043d\u043a \u0413\u0435\u0440\u0431\u0435\u0440\u0442.\"  http://www.wikidata.org/prop/direct/P570 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0434\u0430\u0442\u0430 \u0441\u043c\u0435\u0440\u0442\u0438.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u0416\u0438\u0432 \u043b\u0438 \u0434\u043e \u0441\u0438\u0445 \u043f\u043e\u0440 \u0424\u0440\u044d\u043d\u043a \u0413\u0435\u0440\u0431\u0435\u0440\u0442?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q319308> <http://www.wikidata.org/prop/direct/P166> ?uri . }   \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q319308 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0414\u0443\u0433\u043b\u0430\u0441 \u0425\u043e\u0444\u0448\u0442\u0430\u0434\u0442\u0435\u0440.\"  http://www.wikidata.org/prop/direct/P166 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u043e\u043b\u0443\u0447\u0435\u043d\u043d\u044b\u0435 \u043d\u0430\u0433\u0440\u0430\u0434\u044b.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a\u0430\u043a\u0438\u0435 \u043d\u0430\u0433\u0440\u0430\u0434\u044b \u0435\u0441\u0442\u044c \u0443 \u0414\u0443\u0433\u043b\u0430\u0441\u0430 \u0425\u043e\u0444\u0448\u0442\u0430\u0434\u0442\u0435\u0440\u0430?"}]}
