{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT DISTINCT ?uri WHERE {  ?uri <http://www.wikidata.org/prop/direct/P161> <http://www.wikidata.org/entity/Q219512> . }   \u0413\u0434\u0435:  http://www.wikidata.org/prop/direct/P161 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0432 \u0440\u043e\u043b\u044f\u0445.\"  http://www.wikidata.org/entity/Q219512 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0414\u0436\u0435\u0441\u0441\u0438 \u0410\u0439\u0437\u0435\u043d\u0431\u0435\u0440\u0433.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u0412 \u043a\u0430\u043a\u0438\u0445 \u0444\u0438\u043b\u044c\u043c\u0430\u0445 \u0441\u044b\u0433\u0440\u0430\u043b \u0414\u0436\u0435\u0441\u0441\u0438 \u0410\u0439\u0437\u0435\u043d\u0431\u0435\u0440\u0433?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> SELECT ?res WHERE { ?mayor wdt:P31 wd:Q5 . ?mayor p:P39 _:a ._:a ps:P39 wd:Q43185970 ._:a pq:P580 ?date . ?mayor wdt:P102 ?res . } ORDER BY DESC(?date) LIMIT 1   \u0413\u0434\u0435:  wdt:P31 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u044d\u0442\u043e \u0447\u0430\u0441\u0442\u043d\u044b\u0439 \u0441\u043b\u0443\u0447\u0430\u0439 \u043f\u043e\u043d\u044f\u0442\u0438\u044f.\"  wd:Q5 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0447\u0435\u043b\u043e\u0432\u0435\u043a.\"  p:P39 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0437\u0430\u043d\u0438\u043c\u0430\u0435\u043c\u0430\u044f \u0434\u043e\u043b\u0436\u043d\u043e\u0441\u0442\u044c.\"  ps:P39 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0437\u0430\u043d\u0438\u043c\u0430\u0435\u043c\u0430\u044f \u0434\u043e\u043b\u0436\u043d\u043e\u0441\u0442\u044c.\"  wd:Q43185970 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043c\u044d\u0440 \u041b\u0438\u0441\u0441\u0430\u0431\u043e\u043d\u0430.\"  pq:P580 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0434\u0430\u0442\u0430 \u043d\u0430\u0447\u0430\u043b\u0430.\"  wdt:P102 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0447\u043b\u0435\u043d \u043f\u043e\u043b\u0438\u0442\u0438\u0447\u0435\u0441\u043a\u043e\u0439 \u043f\u0430\u0440\u0442\u0438\u0438.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a\u0430\u043a\u0430\u044f \u043f\u0430\u0440\u0442\u0438\u044f \u044f\u043b\u0432\u044f\u0435\u0442\u0441\u044f \u0432\u0435\u0434\u0443\u0449\u0435\u0439 \u0432 \u041b\u0438\u0441\u0441\u0430\u0431\u043e\u043d\u0435?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q43247 wdt:P40 ?child . ?child wdt:P26 ?uri . }   \u0413\u0434\u0435:  wd:Q43247 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0418\u043d\u0433\u0440\u0438\u0434 \u0411\u0435\u0440\u0433\u043c\u0430\u043d.\"  wdt:P40 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0434\u0435\u0442\u0438.\"  wdt:P26 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0441\u0443\u043f\u0440\u0443\u0433(\u0430).\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u0417\u0430 \u043a\u0435\u043c \u0431\u044b\u043b\u0430 \u0437\u0430\u043c\u0443\u0436\u0435\u043c \u0434\u043e\u0447\u044c \u0418\u043d\u0433\u0440\u0438\u0434 \u0411\u0435\u0440\u0433\u043c\u0430\u043d?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q5451 wdt:P17 ?uri . }   \u0413\u0434\u0435:  wd:Q5451 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0413\u0438\u043c\u0430\u043b\u0430\u0438.\"  wdt:P17 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u043e.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041f\u043e \u043a\u0430\u043a\u0438\u043c \u0441\u0442\u0440\u0430\u043d\u0430\u043c \u043f\u0440\u043e\u0442\u044f\u043d\u0443\u043b\u0430\u0441\u044c \u0433\u043e\u0440\u043d\u0430\u044f \u0441\u0438\u0441\u0442\u0435\u043c\u0430 \u0413\u0438\u043c\u0430\u043b\u0430\u0435\u0432?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1009> <http://www.wikidata.org/prop/direct/P36> ?uri}   \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q1009 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041a\u0430\u043c\u0435\u0440\u0443\u043d.\"  http://www.wikidata.org/prop/direct/P36 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0430\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u0438\u0432\u043d\u044b\u0439 \u0446\u0435\u043d\u0442\u0440.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041a\u0430\u043a\u0430\u044f \u0441\u0442\u043e\u043b\u0438\u0446\u0430 \u0443 \u041a\u0430\u043c\u0435\u0440\u0443\u043d\u0430?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q168383 wdt:P127 ?uri . }   \u0413\u0434\u0435:  wd:Q168383 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"Universal Pictures.\"  wdt:P127 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0432\u043b\u0430\u0434\u0435\u043b\u044c\u0446\u0435\u043c \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a\u0442\u043e \u0432\u043b\u0430\u0434\u0435\u043b\u0435\u0446 \u0441\u0442\u0443\u0434\u0438\u0438 Universal Studios?"}]}
{"messages": [{"role": "user", "content": "Gegeben ist die SPARQL-Anfrage: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q152316 wdt:P22 ?father ; wdt:P25 ?mother . wd:Q36812 wdt:P22 ?father ; wdt:P25 ?mother . }   Dabei gilt:  Die Bezeichnung von wd:Q152316 ist \"Prinz Harry, Herzog zu Sussex.\"  Die Bezeichnung von wdt:P22 ist \"Vater.\"  Die Bezeichnung von wd:Q152316 ist \"Prinz Harry, Herzog zu Sussex.\"  Die Bezeichnung von wdt:P25 ist \"Mutter.\"  Die Bezeichnung von wd:Q36812 ist \"Prinz William, F\u00fcrst zu Wales.\"  Die Bezeichnung von wdt:P22 ist \"Vater.\"  Die Bezeichnung von wd:Q36812 ist \"Prinz William, F\u00fcrst zu Wales.\"  Die Bezeichnung von wdt:P25 ist \"Mutter.\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus.. Haben Prinz Harry und Prinz William die gleichen Eltern?   -----------  Gegeben ist die SPARQL-Anfrage: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q21191270> . ?uri <http://www.wikidata.org/prop/direct/P361> <http://www.wikidata.org/entity/Q5274359> }    Dabei gilt:  Die Bezeichnung von http://www.wikidata.org/prop/direct/P31 ist \"ist ein(e).\"  Die Bezeichnung von http://www.wikidata.org/entity/Q21191270 ist \"Episode einer Fernsehserie.\"  Die Bezeichnung von http://www.wikidata.org/prop/direct/P361 ist \"ist Teil von.\"  Die Bezeichnung von http://www.wikidata.org/entity/Q5274359 ist \"Die Sopranos/Staffel 1.\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus."}, {"role": "assistant", "content": "Liste alle Episoden der ersten Staffel der HBO-Fernsehserie The Sopranos auf."}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1009> <http://www.wikidata.org/prop/direct/P36> ?uri}   \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q1009 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041a\u0430\u043c\u0435\u0440\u0443\u043d.\"  http://www.wikidata.org/prop/direct/P36 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0430\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u0438\u0432\u043d\u044b\u0439 \u0446\u0435\u043d\u0442\u0440.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041a\u0430\u043a\u0430\u044f \u0441\u0442\u043e\u043b\u0438\u0446\u0430 \u0443 \u041a\u0430\u043c\u0435\u0440\u0443\u043d\u0430?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q168383 wdt:P127 ?uri . }   \u0413\u0434\u0435:  wd:Q168383 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"Universal Pictures.\"  wdt:P127 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0432\u043b\u0430\u0434\u0435\u043b\u044c\u0446\u0435\u043c \u044f\u0432\u043b\u044f\u0435\u0442\u0441\u044f.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a\u0442\u043e \u0432\u043b\u0430\u0434\u0435\u043b\u0435\u0446 Universal Studios?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 ; wdt:P2044 ?elevation . } ORDER BY DESC(?elevation) LIMIT 1   \u0413\u0434\u0435:  wdt:P31 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u044d\u0442\u043e \u0447\u0430\u0441\u0442\u043d\u044b\u0439 \u0441\u043b\u0443\u0447\u0430\u0439 \u043f\u043e\u043d\u044f\u0442\u0438\u044f.\"  wd:Q8502 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0433\u043e\u0440\u0430.\"  wdt:P2044 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0432\u044b\u0441\u043e\u0442\u0430 \u043d\u0430\u0434 \u0443\u0440\u043e\u0432\u043d\u0435\u043c \u043c\u043e\u0440\u044f.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u0421\u0430\u043c\u0430\u044f \u0432\u044b\u0441\u043e\u043a\u0430\u044f \u0433\u043e\u0440\u0430?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441:  SELECT ?s1 WHERE { ?s1  wdt:P136  <http://www.wikidata.org/entity/Q11365> . ?s1  wdt:P31  <http://www.wikidata.org/entity/Q18127> . ?s1  wdt:P17 <http://www.wikidata.org/entity/Q16> . }   \u0413\u0434\u0435:  wdt:P136 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0436\u0430\u043d\u0440.\"  http://www.wikidata.org/entity/Q11365 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0433\u0440\u0430\u043d\u0436.\"  wdt:P31 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u044d\u0442\u043e \u0447\u0430\u0441\u0442\u043d\u044b\u0439 \u0441\u043b\u0443\u0447\u0430\u0439 \u043f\u043e\u043d\u044f\u0442\u0438\u044f.\"  http://www.wikidata.org/entity/Q18127 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043b\u0435\u0439\u0431\u043b \u0437\u0432\u0443\u043a\u043e\u0437\u0430\u043f\u0438\u0441\u0438.\"  wdt:P17 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u043e.\"  http://www.wikidata.org/entity/Q16 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041a\u0430\u043d\u0430\u0434\u0430.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041f\u0435\u0440\u0435\u0447\u0438\u0441\u043b\u0438\u0442\u0435 \u0432\u0441\u0435 \u043a\u0430\u043d\u0430\u0434\u0441\u043a\u0438\u0435 \u043b\u0435\u0439\u0431\u043b\u044b \u0432 \u0441\u0442\u0438\u043b\u0435 \u0433\u0440\u0430\u043d\u0436."}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?name WHERE { wd:Q567 wdt:P1477 ?name . }    \u0413\u0434\u0435:  wd:Q567 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0410\u043d\u0433\u0435\u043b\u0430 \u041c\u0435\u0440\u043a\u0435\u043b\u044c.\"  wdt:P1477 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0438\u043c\u044f \u043f\u0440\u0438 \u0440\u043e\u0436\u0434\u0435\u043d\u0438\u0438.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041a\u0430\u043a \u0437\u0432\u0430\u043b\u0438 \u0410\u043d\u0433\u0435\u043b\u0443 \u041c\u0435\u0440\u043a\u0435\u043b\u044c \u043f\u0440\u0438 \u0440\u043e\u0436\u0434\u0435\u043d\u0438\u0438?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { wd:Q1501505 wdt:P170 ?creator . ?creator wdt:P27 ?uri . }   \u0413\u0434\u0435:  wd:Q1501505 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041c\u0438\u0444\u0444\u0438.\"  wdt:P170 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0441\u043e\u0437\u0434\u0430\u0442\u0435\u043b\u044c.\"  wdt:P27 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0433\u0440\u0430\u0436\u0434\u0430\u043d\u0441\u0442\u0432\u043e.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u0418\u0437 \u043a\u0430\u043a\u043e\u0439 \u0441\u0442\u0440\u0430\u043d\u044b \u0430\u0432\u0442\u043e\u0440 \"Miffy\"?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1564644> <http://www.wikidata.org/prop/direct/P527> ?uri }   \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q1564644 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041e\u0441\u043d\u043e\u0432\u0430\u043d\u0438\u0435.\"  http://www.wikidata.org/prop/direct/P527 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0441\u043e\u0441\u0442\u043e\u0438\u0442 \u0438\u0437.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041f\u0435\u0440\u0435\u0447\u0438\u0441\u043b\u0438\u0442\u0435 \u0432\u0441\u0435 \u043a\u043d\u0438\u0433\u0438 \u0432 \u0441\u0435\u0440\u0438\u0438 \u0410\u0437\u0438\u043c\u043e\u0432\u0430 \u041e\u0441\u043d\u043e\u0432\u0430\u043d\u0438\u0435?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q1198 wdt:P2046 ?val . }   \u0413\u0434\u0435:  wd:Q1198 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0421\u0435\u0432\u0435\u0440\u043d\u044b\u0439 \u0420\u0435\u0439\u043d-\u0412\u0435\u0441\u0442\u0444\u0430\u043b\u0438\u044f.\"  wdt:P2046 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u043b\u043e\u0449\u0430\u0434\u044c.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a\u0430\u043a\u043e\u0432\u0430 \u043f\u043b\u043e\u0449\u0430\u0434\u044c \u0421\u0435\u0432\u0435\u0440\u043d\u043e\u0433\u043e \u0420\u0435\u0439\u043d\u0430-\u0412\u0435\u0441\u0442\u0444\u0430\u043b\u0438\u0438?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: ASK WHERE { <http://www.wikidata.org/entity/Q5513> <http://www.wikidata.org/prop/direct/P2046> ?area1 . <http://www.wikidata.org/entity/Q5525> <http://www.wikidata.org/prop/direct/P2046> ?area2 . FILTER(?area1 > ?area2) }   \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q5513 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0411\u0430\u0439\u043a\u0430\u043b.\"  http://www.wikidata.org/prop/direct/P2046 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u043b\u043e\u0449\u0430\u0434\u044c.\"  http://www.wikidata.org/entity/Q5525 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0411\u043e\u043b\u044c\u0448\u043e\u0435 \u041c\u0435\u0434\u0432\u0435\u0436\u044c\u0435 \u043e\u0437\u0435\u0440\u043e.\"  http://www.wikidata.org/prop/direct/P2046 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u043b\u043e\u0449\u0430\u0434\u044c.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u0411\u043e\u043b\u044c\u0448\u0435 \u043b\u0438 \u043e\u0437\u0435\u0440\u043e \u0411\u0430\u0439\u043a\u0430\u043b, \u0447\u0435\u043c \u0411\u043e\u043b\u044c\u0448\u043e\u0435 \u041c\u0435\u0434\u0432\u0435\u0436\u044c\u0435 \u043e\u0437\u0435\u0440\u043e?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q35657 ; wdt:P2046 ?area ; wdt:P1082 ?population . BIND((?population/?area) AS ?density) . } ORDER BY DESC(?density) LIMIT 1   \u0413\u0434\u0435:  wdt:P31 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u044d\u0442\u043e \u0447\u0430\u0441\u0442\u043d\u044b\u0439 \u0441\u043b\u0443\u0447\u0430\u0439 \u043f\u043e\u043d\u044f\u0442\u0438\u044f.\"  wd:Q35657 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0448\u0442\u0430\u0442 \u0421\u0428\u0410.\"  wdt:P2046 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u043b\u043e\u0449\u0430\u0434\u044c.\"  wdt:P1082 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0447\u0438\u0441\u043b\u0435\u043d\u043d\u043e\u0441\u0442\u044c \u043d\u0430\u0441\u0435\u043b\u0435\u043d\u0438\u044f.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a\u0430\u043a\u043e\u0439 \u0448\u0442\u0430\u0442 \u0421\u043e\u0435\u0434\u0438\u043d\u0435\u043d\u043d\u044b\u0445 \u0428\u0442\u0430\u0442\u043e\u0432 \u0410\u043c\u0435\u0440\u0438\u043a\u0438 \u0438\u043c\u0435\u0442 \u0441\u0430\u043c\u0443\u044e \u0432\u044b\u0441\u043e\u043a\u0443\u044e \u043f\u043b\u043e\u0442\u043d\u043e\u0441\u0442\u044c \u043d\u0430\u0441\u0435\u043b\u0435\u043d\u0438\u044f?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q868 wdt:P737 wd:Q913 . }   \u0413\u0434\u0435:  wd:Q868 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0410\u0440\u0438\u0441\u0442\u043e\u0442\u0435\u043b\u044c.\"  wdt:P737 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0438\u0441\u043f\u044b\u0442\u0430\u043b \u0432\u043b\u0438\u044f\u043d\u0438\u0435 \u043e\u0442.\"  wd:Q913 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0421\u043e\u043a\u0440\u0430\u0442.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041f\u043e\u0432\u043b\u0438\u044f\u043b \u043b\u0438 \u0421\u043e\u043a\u0440\u0430\u0442 \u043d\u0430 \u0410\u0440\u0438\u0441\u0442\u043e\u0442\u0435\u043b\u044f?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q189080> <http://www.wikidata.org/prop/direct/P136> ?uri . }   \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q189080 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041b\u0443 \u0420\u0438\u0434.\"  http://www.wikidata.org/prop/direct/P136 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0436\u0430\u043d\u0440.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u0412 \u043a\u0430\u043a\u0438\u0445 \u043c\u0443\u0437\u044b\u043a\u0430\u043b\u044c\u043d\u044b\u0445 \u0441\u0442\u0438\u043b\u044f\u0445 \u0438\u0433\u0440\u0430\u043b \u041b\u0443 \u0420\u0438\u0434?"}]}
{"messages": [{"role": "user", "content": "---- Start Example ----   Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P119 wd:Q3411252 . }   Where:  wdt:P119 has human-readable name \"place of burial.\"  wd:Q3411252 has human-readable name \"Pyramid G1-a.\"  Transform the SPARQL query to a natural language question. Output just the transformed question. Who was buried in the Great Pyramid of Giza?   ----End Example ----  Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P162 wd:Q8877 ; wdt:P31/wdt:P279* wd:Q11424 ; wdt:P2130 ?cost . FILTER(?cost > 80000000)}   Where:  wdt:P162 has human-readable name \"producer.\"  wd:Q8877 has human-readable name \"Steven Spielberg.\"  wdt:P31 has human-readable name \"instance of.\"  wdt:P279 has human-readable name \"subclass of.\"  wd:Q11424 has human-readable name \"film.\"  wdt:P2130 has human-readable name \"cost.\"  Transform the SPARQL query to a natural language question. Output just the transformed question"}, {"role": "assistant", "content": "Give me all films produced by Steven Spielberg with a budget of at least $80 million."}]}
