{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT DISTINCT ?number WHERE { <http://www.wikidata.org/entity/Q408> <http://www.wikidata.org/prop/direct/P36> ?uri . ?uri <http://www.wikidata.org/prop/direct/P1082> ?number . }   \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q408 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0410\u0432\u0441\u0442\u0440\u0430\u043b\u0438\u044f.\"  http://www.wikidata.org/prop/direct/P36 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0430\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u0438\u0432\u043d\u044b\u0439 \u0446\u0435\u043d\u0442\u0440.\"  http://www.wikidata.org/prop/direct/P1082 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0447\u0438\u0441\u043b\u0435\u043d\u043d\u043e\u0441\u0442\u044c \u043d\u0430\u0441\u0435\u043b\u0435\u043d\u0438\u044f.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u0421\u043a\u043e\u043b\u044c\u043a\u043e \u043b\u044e\u0434\u0435\u0439 \u0436\u0438\u0432\u0435\u0442 \u0432 \u0441\u0442\u043e\u043b\u0438\u0446\u0435 \u0410\u0432\u0441\u0442\u0440\u0430\u043b\u0438\u0438   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?res WHERE { wd:Q1163227 wdt:P50 ?res. }   \u0413\u0434\u0435:  wd:Q1163227 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0421\u0442\u043e\u043b\u043f\u044b \u0417\u0435\u043c\u043b\u0438.\"  wdt:P50 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0430\u0432\u0442\u043e\u0440.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a\u0442\u043e \u043d\u0430\u043f\u0438\u0441\u0430\u043b \u043a\u043d\u0438\u0433\u0443 \u0421\u0442\u043e\u043b\u043f\u044b \u0417\u0435\u043c\u043b\u0438?"}]}
{"messages": [{"role": "user", "content": "Gegeben ist die SPARQL-Anfrage: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q16397 wdt:P40 ?children . ?children wdt:P40 ?uri . }   Dabei gilt:  Die Bezeichnung von wd:Q16397 ist \"Bruce Lee.\"  Die Bezeichnung von wdt:P40 ist \"Kind(er).\"  Die Bezeichnung von wdt:P40 ist \"Kind(er).\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus.. Zeige die Enkelkinder von Bruce Lee?   -----------  Gegeben ist die SPARQL-Anfrage: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q43229 . ?uri wdt:P31 ?type . ?uri wdt:P571 ?foundedAt . FILTER CONTAINS(STR(?foundedAt), \"1950\") }   Dabei gilt:  Die Bezeichnung von wdt:P279 ist \"Unterklasse von.\"  Die Bezeichnung von wd:Q43229 ist \"Organisation.\"  Die Bezeichnung von wdt:P31 ist \"ist ein(e).\"  Die Bezeichnung von wdt:P571 ist \"Datum der Gr\u00fcndung, Erstellung, Entstehung, Erbauung.\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus."}, {"role": "assistant", "content": "Welche Organisationen wurden 1950 gegr\u00fcndet?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q60 wdt:P6 ?uri . }   \u0413\u0434\u0435:  wd:Q60 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041d\u044c\u044e-\u0419\u043e\u0440\u043a.\"  wdt:P6 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0433\u043b\u0430\u0432\u0430 \u043f\u0440\u0430\u0432\u0438\u0442\u0435\u043b\u044c\u0441\u0442\u0432\u0430.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041a\u0442\u043e \u043c\u0435\u0440 \u041d\u044c\u044e \u0419\u043e\u0440\u043a\u0430?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q728 . wd:Q155644 wdt:P287 ?designer . ?uri wdt:P279 ?type ; wdt:P287 ?designer . FILTER (?uri != wd:Q155644) }   \u0413\u0434\u0435:  wdt:P279 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u043e\u0434\u043a\u043b\u0430\u0441\u0441 \u043e\u0442.\"  wd:Q728 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043e\u0440\u0443\u0436\u0438\u0435.\"  wd:Q155644 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"Uzi.\"  wdt:P287 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u0440\u043e\u0435\u043a\u0442\u0438\u0440\u043e\u0432\u0449\u0438\u043a.\"  wdt:P279 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u043e\u0434\u043a\u043b\u0430\u0441\u0441 \u043e\u0442.\"  wdt:P287 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043f\u0440\u043e\u0435\u043a\u0442\u0438\u0440\u043e\u0432\u0449\u0438\u043a.\"  wd:Q155644 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"Uzi.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a\u0430\u043a\u043e\u0435 \u0435\u0449\u0451 \u043e\u0440\u0443\u0436\u0438\u0435 \u0440\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u0430\u043b \u0434\u0438\u0437\u0430\u0439\u043d\u0435\u0440 \u0423\u0417\u0418?"}]}
{"messages": [{"role": "user", "content": "Gegeben ist die SPARQL-Anfrage: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P31 wd:Q131436 . }   Dabei gilt:  Die Bezeichnung von wdt:P31 ist \"ist ein(e).\"  Die Bezeichnung von wd:Q131436 ist \"Brettspiel.\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus.. Liste die Brettspiele von GMT auf.   -----------  Gegeben ist die SPARQL-Anfrage: prefix rdfs:   <http://www.w3.org/2000/01/rdf-schema#>  ASK WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q7889> . ?uri rdfs:label \"Battle Chess\"@en }   Dabei gilt:  Die Bezeichnung von http://www.wikidata.org/prop/direct/P31 ist \"ist ein(e).\"  Die Bezeichnung von http://www.wikidata.org/entity/Q7889 ist \"Computerspiel.\"  Die Bezeichnung von rdfs:label ist \"label.\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus."}, {"role": "assistant", "content": "Gibt es eine Videospiel, das Ballte Chess hei\u00dft?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT (COUNT(DISTINCT ?uri) as ?count) WHERE {  ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q315484> . }   \u0413\u0434\u0435:  http://www.wikidata.org/prop/direct/P57 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0440\u0435\u0436\u0438\u0441\u0441\u0451\u0440.\"  http://www.wikidata.org/entity/Q315484 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041f\u0430\u043a \u0427\u0445\u0430\u043d \u0423\u043a.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u0421\u043a\u043e\u043b\u044c\u043a\u043e \u0444\u0438\u043b\u044c\u043c\u043e\u0432 \u0441\u043d\u044f\u043b \u041f\u0430\u0440\u043a \u0427\u0430\u043d \u0412\u0443\u043a?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441:  SELECT ?o2 WHERE { <http://www.wikidata.org/entity/Q5089>  <http://www.wikidata.org/prop/direct/P885>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P17>  ?o2 .  }    \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q5089 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0413\u0430\u043d\u0433.\"  http://www.wikidata.org/prop/direct/P885 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0438\u0441\u0442\u043e\u043a \u0432\u043e\u0434\u043e\u0442\u043e\u043a\u0430.\"  http://www.wikidata.org/prop/direct/P17 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u043e.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u0412 \u043a\u0430\u043a\u043e\u0439 \u0441\u0442\u0440\u0430\u043d\u0435 \u0438\u0441\u0442\u043e\u043a \u0413\u0430\u043d\u0433\u0430?"}]}
{"messages": [{"role": "user", "content": "Gegeben ist die SPARQL-Anfrage: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) AS ?c) WHERE { ?uri wdt:P361 wd:Q207329 }   Dabei gilt:  Die Bezeichnung von wdt:P361 ist \"ist Teil von.\"  Die Bezeichnung von wd:Q207329 ist \"Sojusprogramm.\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus.. Wie viele Missionen hat das Soyuz-Programm?   -----------  Gegeben ist die SPARQL-Anfrage: SELECT DISTINCT ?s1 WHERE { ?s1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q11424> . ?s1  <http://www.wikidata.org/prop/direct/P161>  <http://www.wikidata.org/entity/Q103894> . ?s1 <http://www.wikidata.org/prop/direct/P577> ?o1 . }  order by DESC(?o1)  limit 1   Dabei gilt:  Die Bezeichnung von http://www.wikidata.org/prop/direct/P31 ist \"ist ein(e).\"  Die Bezeichnung von http://www.wikidata.org/entity/Q11424 ist \"Film.\"  Die Bezeichnung von http://www.wikidata.org/prop/direct/P161 ist \"Darsteller.\"  Die Bezeichnung von http://www.wikidata.org/entity/Q103894 ist \"Alec Guinness.\"  Die Bezeichnung von http://www.wikidata.org/prop/direct/P577 ist \"Ver\u00f6ffentlichungsdatum.\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus."}, {"role": "assistant", "content": "Wie hie\u00df der letzte Film mit Alec Guiness?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/>  PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8502 . ?uri p:P2044 ?stmnode. ?stmnode psv:P2044 ?valuenode . ?valuenode wikibase:quantityAmount ?elevation . ?valuenode wikibase:quantityUnit ?unit . wd:Q130736 wdt:P2044 ?elevationNangaParbat . FILTER(?unit = wd:Q11573) FILTER (?elevation > ?elevationNangaParbat) }   \u0413\u0434\u0435:  wdt:P31 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u044d\u0442\u043e \u0447\u0430\u0441\u0442\u043d\u044b\u0439 \u0441\u043b\u0443\u0447\u0430\u0439 \u043f\u043e\u043d\u044f\u0442\u0438\u044f.\"  wd:Q8502 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0433\u043e\u0440\u0430.\"  p:P2044 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0432\u044b\u0441\u043e\u0442\u0430 \u043d\u0430\u0434 \u0443\u0440\u043e\u0432\u043d\u0435\u043c \u043c\u043e\u0440\u044f.\"  psv:P2044 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"psv:P2044.\"  wikibase:quantityAmount \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"wikibase:quantityAmount.\"  wikibase:quantityUnit \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"wikibase:quantityUnit.\"  wd:Q130736 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041d\u0430\u043d\u0433\u0430\u043f\u0430\u0440\u0431\u0430\u0442.\"  wdt:P2044 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0432\u044b\u0441\u043e\u0442\u0430 \u043d\u0430\u0434 \u0443\u0440\u043e\u0432\u043d\u0435\u043c \u043c\u043e\u0440\u044f.\"  wd:Q11573 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u043c\u0435\u0442\u0440.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041a\u0430\u043a\u0438\u0435 \u0433\u043e\u0440\u044b \u0432\u044b\u0448\u0435 \u041d\u0430\u043d\u0433\u0430 \u041f\u0430\u0440\u0431\u0430\u0442?   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(?uri) AS ?count) WHERE { ?uri wdt:P31 wd:Q15149663 . }   \u0413\u0434\u0435:  wdt:P31 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u044d\u0442\u043e \u0447\u0430\u0441\u0442\u043d\u044b\u0439 \u0441\u043b\u0443\u0447\u0430\u0439 \u043f\u043e\u043d\u044f\u0442\u0438\u044f.\"  wd:Q15149663 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0448\u0442\u0430\u0442 \u041c\u0435\u043a\u0441\u0438\u043a\u0438.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u0421\u043a\u043e\u043b\u044c\u043a\u043e \u0448\u0442\u0430\u0442\u043e\u0432 \u0432 \u041c\u0435\u043a\u0441\u0438\u043a\u0435?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q7416 wdt:P40 ?uri . }   \u0413\u0434\u0435:  wd:Q7416 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041c\u0430\u0440\u0433\u0430\u0440\u0435\u0442 \u0422\u044d\u0442\u0447\u0435\u0440.\"  wdt:P40 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0434\u0435\u0442\u0438.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041f\u0435\u0440\u0435\u0447\u0438\u0441\u043b\u0438\u0442\u0435 \u0434\u0435\u0442\u0435\u0439 \u041c\u0430\u0440\u0433\u0430\u0440\u0435\u0442 \u0422\u044d\u0442\u0447\u0435\u0440.   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q3235867 wdt:P170 ?painter . ?painter wdt:P135 ?uri . }   \u0413\u0434\u0435:  wd:Q3235867 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0422\u0440\u0438 \u0442\u0430\u043d\u0446\u043e\u0440\u0430.\"  wdt:P170 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0441\u043e\u0437\u0434\u0430\u0442\u0435\u043b\u044c.\"  wdt:P135 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0448\u043a\u043e\u043b\u0430 (\u0434\u0432\u0438\u0436\u0435\u043d\u0438\u0435).\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a \u043a\u0430\u043a\u043e\u043c\u0443 \u0445\u0443\u0434\u043e\u0436\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c\u0443 \u043d\u0430\u043f\u0440\u0430\u0432\u043b\u0435\u043d\u0438\u044e \u043f\u0440\u0438\u043d\u0430\u0434\u043b\u0435\u0436\u0438\u0442 \u0430\u0432\u0442\u043e\u0440 \u0422\u0440\u0435\u0445 \u0442\u0430\u043d\u0446\u043e\u0432\u0449\u0438\u0446?"}]}
{"messages": [{"role": "user", "content": "Gegeben ist die SPARQL-Anfrage: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q8502> . ?uri <http://www.wikidata.org/prop/direct/P30> <http://www.wikidata.org/entity/Q3960> . ?uri <http://www.wikidata.org/prop/direct/P2044> ?height. } ORDER BY DESC(?height) LIMIT 1   Dabei gilt:  Die Bezeichnung von http://www.wikidata.org/prop/direct/P31 ist \"ist ein(e).\"  Die Bezeichnung von http://www.wikidata.org/entity/Q8502 ist \"Berg.\"  Die Bezeichnung von http://www.wikidata.org/prop/direct/P30 ist \"Kontinent.\"  Die Bezeichnung von http://www.wikidata.org/entity/Q3960 ist \"Australien.\"  Die Bezeichnung von http://www.wikidata.org/prop/direct/P2044 ist \"H\u00f6he \u00fcber dem Meeresspiegel.\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus.. Wie hei\u00dft der h\u00f6chste Berg in Australien?   -----------  Gegeben ist die SPARQL-Anfrage: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q476028> . ?uri <http://www.wikidata.org/prop/direct/P118> <http://www.wikidata.org/entity/Q9448> . }   Dabei gilt:  Die Bezeichnung von http://www.wikidata.org/prop/direct/P31 ist \"ist ein(e).\"  Die Bezeichnung von http://www.wikidata.org/entity/Q476028 ist \"Fu\u00dfballverein.\"  Die Bezeichnung von http://www.wikidata.org/prop/direct/P118 ist \"Liga.\"  Die Bezeichnung von http://www.wikidata.org/entity/Q9448 ist \"Premier League.\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus."}, {"role": "assistant", "content": "Welche Fu\u00dfballvereine spielen in der Premier League?"}]}
{"messages": [{"role": "user", "content": "Gegeben ist die SPARQL-Anfrage:  SELECT ?o2 WHERE { <http://www.wikidata.org/entity/Q5089>  <http://www.wikidata.org/prop/direct/P885>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P17>  ?o2 .  }    Dabei gilt:  Die Bezeichnung von http://www.wikidata.org/entity/Q5089 ist \"Ganges.\"  Die Bezeichnung von http://www.wikidata.org/prop/direct/P885 ist \"Quelle des Wasserlaufs.\"  Die Bezeichnung von http://www.wikidata.org/prop/direct/P17 ist \"Staat.\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus.. In welchem Land entspringt der Ganges?   -----------  Gegeben ist die SPARQL-Anfrage: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P119 wd:Q3411252 . }   Dabei gilt:  Die Bezeichnung von wdt:P119 ist \"Begr\u00e4bnisort.\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus."}, {"role": "assistant", "content": "Wer wurde in der Gro\u00dfen Pyramide von Gizeh bestattet?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q5451 wdt:P17 ?country . ?country wdt:P36 ?uri . }   \u0413\u0434\u0435:  wd:Q5451 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0413\u0438\u043c\u0430\u043b\u0430\u0438.\"  wdt:P17 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0433\u043e\u0441\u0443\u0434\u0430\u0440\u0441\u0442\u0432\u043e.\"  wdt:P36 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0430\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u0438\u0432\u043d\u044b\u0439 \u0446\u0435\u043d\u0442\u0440.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041f\u0435\u0440\u0435\u0447\u0438\u0441\u043b\u0438\u0442\u0435 \u0441\u0442\u043e\u043b\u0438\u0446\u044b \u0432\u0441\u0435\u0445 \u0441\u0442\u0440\u0430\u043d, \u0447\u0435\u0440\u0435\u0437 \u043a\u043e\u0442\u043e\u0440\u044b\u0435 \u043f\u0440\u043e\u0445\u043e\u0434\u044f\u0442 \u0413\u0438\u043c\u0430\u043b\u0430\u0438   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q36> <http://www.wikidata.org/prop/direct/P1082> ?uri }   \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q36 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041f\u043e\u043b\u044c\u0448\u0430.\"  http://www.wikidata.org/prop/direct/P1082 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0447\u0438\u0441\u043b\u0435\u043d\u043d\u043e\u0441\u0442\u044c \u043d\u0430\u0441\u0435\u043b\u0435\u043d\u0438\u044f.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u0421\u043a\u043e\u043b\u044c\u043a\u043e \u043b\u044e\u0434\u0435\u0439 \u043f\u0440\u043e\u0436\u0438\u0432\u0430\u0435\u0442 \u0432 \u041f\u043e\u043b\u044c\u0448\u0435?"}]}
{"messages": [{"role": "user", "content": "Gegeben ist die SPARQL-Anfrage: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q5930> <http://www.wikidata.org/prop/direct/P170> ?uri}   Dabei gilt:  Die Bezeichnung von http://www.wikidata.org/entity/Q5930 ist \"Family Guy.\"  Die Bezeichnung von http://www.wikidata.org/prop/direct/P170 ist \"Urheber.\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus.. Von wem ist Family Guy?   -----------  Gegeben ist die SPARQL-Anfrage: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q41421 wdt:P2048 ?val . }   Dabei gilt:  Die Bezeichnung von wd:Q41421 ist \"Michael Jordan.\"  Die Bezeichnung von wdt:P2048 ist \"H\u00f6he.\"  Transformiere die SPARQL-Anfrage in eine Frage in nat\u00fcrlicher Sprache. Gib nur die transformierte Frage aus."}, {"role": "assistant", "content": "Wie gro\u00df ist Micheal Jordan?"}]}
{"messages": [{"role": "user", "content": "\u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q858840>  <http://www.wikidata.org/prop/direct/P161>  ?o1 .  }    \u0413\u0434\u0435:  http://www.wikidata.org/entity/Q858840 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u041f\u043e\u0441\u043b\u0435\u0434\u043d\u0438\u0439 \u043a\u0438\u043d\u043e\u0433\u0435\u0440\u043e\u0439.\"  http://www.wikidata.org/prop/direct/P161 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0432 \u0440\u043e\u043b\u044f\u0445.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441. \u041f\u0435\u0440\u0435\u0447\u0438\u0441\u043b\u0438\u0442\u0435 \u0432\u0441\u0435\u0445 \u0430\u043a\u0442\u0435\u0440\u043e\u0432 \u0444\u0438\u043b\u044c\u043c\u0430 \"\u041f\u043e\u0441\u043b\u0435\u0434\u043d\u0438\u0439 \u043a\u0438\u043d\u043e\u0433\u0435\u0440\u043e\u0439\"   -----------  \u0418\u043c\u0435\u044f \u0441\u043b\u0435\u0434\u0443\u044e\u0449\u0438\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1163227 wdt:P50 ?uri . }   \u0413\u0434\u0435:  wd:Q1163227 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0421\u0442\u043e\u043b\u043f\u044b \u0417\u0435\u043c\u043b\u0438.\"  wdt:P50 \u0438\u043c\u0435\u043d\u0443\u0435\u0442\u0441\u044f \u043a\u0430\u043a \"\u0430\u0432\u0442\u043e\u0440.\"  \u0422\u0440\u0430\u043d\u0441\u0444\u043e\u0440\u043c\u0438\u0440\u0443\u0439 SPARQL \u0437\u0430\u043f\u0440\u043e\u0441 \u0432 \u0432\u043e\u043f\u0440\u043e\u0441 \u043d\u0430 \u0435\u0441\u0442\u0435\u0441\u0442\u0432\u0435\u043d\u043d\u043e\u043c \u044f\u0437\u044b\u043a\u0435. \u0412\u044b\u0432\u0435\u0434\u0438 \u0442\u043e\u043b\u044c\u043a\u043e \u0442\u0440\u0430\u043d\u0444\u0441\u043e\u0440\u043c\u0438\u0440\u0443\u0435\u043c\u044b\u0439 \u0432\u043e\u043f\u0440\u043e\u0441"}, {"role": "assistant", "content": "\u041a\u0442\u043e \u0430\u0432\u0442\u043e\u0440 \u043a\u043d\u0438\u0433\u0438 \"\u0421\u0442\u043e\u043b\u043f\u044b \u0417\u0435\u043c\u043b\u0438\"?"}]}
