-----------  Having a SPARQL query: ASK WHERE { <http://www.wikidata.org/entity/Q23212> <http://www.wikidata.org/prop/direct/P403> ""Bosnian.""  . }   Where:  http://www.wikidata.org/entity/Q23212 has human-readable name ""Slobodan Milošević.""  http://www.wikidata.org/prop/direct/P403 has human-readable name ""nickname.""  Transform the SPARQL query to a natural language question. Output just the transformed question [/"	Give me the grandchildren of Bruce Lee.	en	perevalov/Mistral-7B-instruct-v0.2-SPARQL2NL	ONE_SHOT	PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q16397 wdt:P40 ?children . ?children wdt:P40 ?uri . }
14	"---- Start Example ---- 
 Having a SPARQL query: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q986> <http://www.wikidata.org/prop/direct/P35> ?uri} 
 Where:
 http://www.wikidata.org/entity/Q986 has human-readable name ""Eritrea.""
 http://www.wikidata.org/prop/direct/P35 has human-readable name ""head of state.""
 Transform the SPARQL query to a natural language question. Output just the transformed question. Who is the president of Eritrea? 
 ----End Example ---- 
Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?type wdt:P279* wd:Q728 . wd:Q155644 wdt:P287 ?designer . ?uri wdt:P279 ?type ; wdt:P287 ?designer . FILTER (?uri != wd:Q155644) } 
 Where:
 wdt:P279 has human-readable name ""subclass of.""
 wd:Q728 has human-readable name ""weapon.""
 wd:Q155644 has human-readable name ""Uzi.""
 wdt:P287 has human-readable name ""designed by.""
 wdt:P279 has human-readable name ""subclass of.""
 wdt:P287 has human-readable name ""designed by.""
 wd:Q155644 has human-readable name ""Uzi.""
 Transform the SPARQL query to a natural language question. Output just the transformed question"	"Which weapons did the designer of the Uzi develop?

----  End Example ----  Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?uri WHERE { ?uri wdt:P122 wd:Q189708 . }   Where:  wdt:P122 has human-readable name ""alma mater.""  wd:Q189708 has human-readable name ""Columbia University.""  Transform the SPARQL query to a natural language question. Output just the transformed question [/inst]Which politicians graduated from Columbia University?

 ----  End of Example ----  Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q37076 wdt:P39 ?val . }   Where:  wd:Q37076 has human-readable name ""Batman.""  wdt:P39 has human-readable name ""occupation.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//INS]In which profession is Batman?


 ----  End of Example ----  Having a SPARQL query: SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q571> . ?uri <http://www.wikidata.org/prop/direct/P50> <http://www.wikidata.org/entity/Q36107> . }   Where:  http://www.wikidata.org/prop/direct/P31 has human-readable name ""instance of.""  http://www.wikidata.org/entity/Q571 has human-readable name ""book.""  http://www.wikidata.org/prop/direct/P50 has human-readable name ""author.""  http://www.wikidata.org/entity/Q36107 has human-readable name ""Ramayana.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//INST]Give me the book of the Indian epic Ramayana.

--Introduce some noise with incorrect statements--  SELECT ?s WHERE { ?s  wdt:P31  wdt:P279*}  order by RAND() limit 1   where { ?s  wdt:P31  wdt:Q1064536 }  --If this statement is true, output it--  .

--Introduce some noise with incorrect statements--  SELECT ?s WHERE { ?s  wdt:P31  wdt:P279*}  order by RAND() limit 1   where { ?s  wdt:P31  wdt:Q134134 }  --If this statement is true, output it--  .

--Introduce some noise with incorrect statements--  SELECT ?s WHERE { ?s  wdt:P31  wdt:P279*}  order by RAND() limit 1   where { ?s  wdt:P31  wdt:Q49335 }  --If this statement is true, output it--  .

--Introduce some noise with incorrect statements--  SELECT ?s WHERE { ?s  wdt:P31  wdt:P279*}  order by RAND() limit 1   where { ?s  wdt:P31  wdt:Q8585 }  --If this statement is true, output it--  .

--Introduce some noise with incorrect statements--  SELECT ?s WHERE { ?s  wdt:P31  wdt:P279*}  order by RAND() limit 1   where { ?s  wdt:P31  wdt:Q33506 }  --If this statement is true, output it--  .

--Introduce some noise with incorrect statements--  SELECT ?s WHERE { ?s  wdt:P31  wdt:P279*}  order by RAND() limit 1   where { ?s  wdt:P31  wdt:Q43229 }  --If this statement is true, output it--  .

--Introduce some noise with incorrect statements--  SELECT ?s WHERE { ?s  wdt:P31  wdt:P279*}  order by RAND() limit 1   where { ?s  wdt:P31  wdt:Q140151 }  --If this statement is true, output it--  .

--Introduce some noise with incorrect statements--  SELECT ?s WHERE { ?s  wdt:P31  wdt:P279*}  order by RAND() limit 1   where { ?s  wdt:P31  wdt:Q31392 }  --If this statement is true, output it--  .

--Introduce some noise with incorrect statements--  SELECT ?s WHERE { ?s  wdt:P31  wdt:P279*}  order by RAND() limit 1   where { ?s  wdt:P31  wdt:Q151126 }  --If this statement is true, output it--  .

--Introduce some noise with incorrect statements--  SELECT ?s WHERE { ?s  wdt:P31  wdt:P279*}  order by RAND() limit 1   where { ?s  wdt:P31  wdt:Q8475 }  --If this statement is true, output it--  .

-- ----  End Example  --  Transform the SPARQL query to a natural language question. Output just the transformed question [/
[instituto georgemeade =  ""Georgemeade Institutio de Tecnologia"" .
(instituto georgemeade wdt:P31 wd:Q10645889 .
instituto georgemeade wdt:P17 wd:Q173 .
]  :  [| wdt:P31 wd:Q10643270  .
| wdt:P17 wd:Q17 .
| wdt:P31 <instituto georgemeade> .
| wdt:P17 <wd:Q173> .
--> SELECT ?s WHERE { ?s wdt:P31 <instituto georgemeade> . ?s wdt:P17 wd:Q173 . }

Which university in Canada has the most students?

-- ----  End Example  --  Transform the SPARQL query to a natural language question. Output just the transformed question [/
SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q7350 ; wdt:P577 ?emotional . } ORDER BY DESC(?emotional) LIMIT 1   Where:  wdt:P31 has human-readable name ""instance of.""  wd:Q7350 has human-readable name ""music album.""  wdt:P577 has human-readable name ""emotion.""  Transform the SPARQL query to a natural language question. Output just the transformed question [/
Which album is the saddest?

----  End ----  Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P69 wd:Q41203 ; wdt:P131+ wd:Q90 . }   Where:  wdt:P69 has human-readable name ""educated at.""  wd:Q41203 has human-readable name ""Columbia University.""  wdt:P131 has human-readable name ""located in the administrative territorial entity.""  wd:Q90 has human-readable name ""New York City.""  Transform the SPARQL query to a natural language question. Output just the transformed question [/inst](Who) went to the university(Columbia) of the city(New York)?

----  End of Example ----  Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q437006 ; wdt:P17 wd:Q408 . }   Where:  wdt:P106 has human-readable name ""occupation.""  wd:Q437006 has human-readable name ""seafarer.""  wdt:P17 has human-readable name ""country.""  wd:Q408 has human-readable name ""Djibouti.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//inst]Show me a list of all sailors from Djibouti .

----  End of Example ----  Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?val WHERE { wd:Q8502 wdt:P2046 ?val . }   Where:  wd:Q8502 has human-readable name ""Mumbai.""  wdt:P2046 has human-readable name ""population.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//ins]How many inhabitants does Mumbai have?

--  Input: A SPARQL query: PREFIX psv: <http://www.wikidata.org/prop/statement/value/> PREFIX wikibase: <http://wikiba.se/ontology#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> PREFIX p: <http://www.wikidata.org/prop/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q8503 ; p:P2046 ?statement . ?statement psv:P2046 ?value . ?value wikibase:Q13391262 . }   Where:  wdt:P31 has human-readable name ""instance of.""  wd:"	Give me all actors called Baldwin.	en	perevalov/Mistral-7B-instruct-v0.2-SPARQL2NL	ONE_SHOT	"PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { ?uri wdt:P106 wd:Q33999 ; rdfs:label ?label . FILTER(CONTAINS(?label, ""Baldwin""))}"
129	"---- Start Example ---- 
 Having a SPARQL query: SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q1204> <http://www.wikidata.org/prop/direct/P47> ?uri . } 
 Where:
 http://www.wikidata.org/entity/Q1204 has human-readable name ""Illinois.""
 http://www.wikidata.org/prop/direct/P47 has human-readable name ""shares border with.""
 Transform the SPARQL query to a natural language question. Output just the transformed question. Which states border Illinois? 
 ----End Example ---- 
Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q11679 wdt:P50 ?uri . } 
 Where:
 wd:Q11679 has human-readable name ""The Hunger Games.""
 wdt:P50 has human-readable name ""author.""
 Transform the SPARQL query to a natural language question. Output just the transformed question"	"Which Emperor ruled when Huangdi died?

----  Start Example ----  Having a SPARQL query: ASK WHERE { <http://www.wikidata.org/entity/Q91>  <http://www.wikidata.org/prop/direct/P20>  ?o1 . ?o1  <http://www.wikidata.org/prop/direct/P856>  ?o2 .  }     Where:  http://www.wikidata.org/entity/Q91 has human-readable name ""Abraham Lincoln.""  http://www.wikidata.org/prop/direct/P20 has human-readable name ""place of death.""  http://www.wikidata.org/prop/direct/P856 has human-readable name ""official website.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//ex] Does Abraham Lincoln's place of death have a website?

----  End Example ----  Having a SPARQL query: SELECT ?s WHERE { <http://www.wikidata.org/entity/Q26336>  <http://www.wikidata.org/prop/direct/P527>  ?s .  }   Where:  http://www.wikidata.org/entity/Q26336 has human-readable name ""Mecca.""  http://www.wikidata.org/prop/direct/P527 has human-readable name ""closest approached to.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//ex]In which direction is Mecca?

----  Start Example ----  Having a SPARQL query: SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q703> <http://www.wikidata.org/prop/direct/P37> ?uri . }   Where:  http://www.wikidata.org/entity/Q703 has human-readable name ""Akasoqo.""  http://www.wikidata.org/prop/direct/P37 has human-readable name ""occupation.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//ex]Which profession did the people in Akasoqo engage in?

----  End Example ----  Having a SPARQL query: ASK WHERE { <http://www.wikidata.org/entity/Q5513> <http://www.wikidata.org/prop/direct/P20> . }   Where:  http://www.wikidata.org/entity/Q5513 has human-readable name ""Bing Crosby.""  http://www.wikidata.org/prop/direct/P20 has human-readable name ""place of death.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//]Was Bing Crosby dead?

Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q116316 wdt:P26 ?spouse . ?spouse wdt:P27 ?employee . }   Where:  wd:Q116316 has human-readable name ""Jaromir Janaček.""  wdt:P26 has human-readable name ""spouse.""  wdt:P27 has human-readable name ""employer.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//]Did Jaromir Janáckůs wife work for someone?

List only the transformed question. 

----- 

Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/>  SELECT DISTINCT ?uri WHERE { ?uri wdt:P31 wd:Q30780 ; wdt:P131 wd:Q90 . }   Where:  wdt:P31 has human-readable name ""instance of.""  wd:Q30780 has human-readable name ""airport.""  wdt:P131 has human-readable name ""located in the administrative territorial entity.""  wd:Q90 has human-readable name ""Palestine.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//INST]Give me all airports in Palestine.

List only the transformed question. 

----- 

Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?res WHERE { ?res wdt:P31 a wd:Q8502 . ?res wdt:P131+ wd:Q1200 . ?res wdt:P2044 ?height . } ORDER BY DESC(?height) LIMIT 1   Where:  wdt:P31 has human-readable name ""instance of.""  wd:Q8502 has human-readable name ""mountain.""  wdt:P131 has human-readable name ""located in the administrative territorial entity.""  wd:Q1200 has human-readable name ""Saxony.""  wdt:P2044 has human-readable name ""elevation above sea level.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//]Which is the highest mountain located in Saxony, Germany?

List only the transformed question. 

----- 

----End Example ----  Having a SPARQL query: SELECT DISTINCT ?o1 WHERE { <http://www.wikidata.org/entity/Q185520>  <http://www.wikidata.org/prop/direct/P421>  ?o1 .  }   Where:  http://www.wikidata.org/entity/Q185520 has human-readable name ""North Sea.""  http://www.wikidata.org/prop/direct/P421 has human-readable name ""drainage basin.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//examples >  How big is the drainage area of the North Sea?

----End Example ----  Having a SPARQL query: SELECT ?o1 { <http://www.wikidata.org/entity/Q1321010> <http://www.wikidata.org/prop/direct/P166>  ?o1 .  }   Where:  http://www.wikidata.org/entity/Q1321010 has human-readable name ""Bruince.""  http://www.wikidata.org/prop/direct/P166 has human-readable name ""originally published as.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//examples >  In which magazine did Bruince appear?

----  End ----  Having a SPARQL query: SELECT DISTINCT ?uri WHERE {  <http://www.wikidata.org/entity/Q5970> <http://www.wikidata.org/prop/ direct/P170> ?uri . }   Where:  http://www.wikidata.org/entity/Q5970 has human-readable name ""Giovanni Boccaccio.""  http://www.wikidata.org/prop/direct/P170 has human-readable name ""creator.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//INST]Who wrote the Decameron?

You can write your answer like this: SELECT ?res WHERE { ?res <http://www.wikidata.org/prop/direct/p31> <http://www.wikidata.org/entity/Q539804> . ?res <http://www.wikidata.org/prop/direct/p20> <http://www.wikidata.org/entity/Q1163227> . ?res <http://www.wikidata.org/prop/direct/p50> <http://www.wikidata.org/entity/Q3912> . }  

-----------  END  -----------
>  How good is the SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1481540 wdt:P161 wd:Q40622 . }   Where:
   wd:Q1481540 has human-readable name ""Batman Begins.""
   wdt:P161 has human-readable name ""cast member.""
   wd:Q40622 has human-readable name ""Christian Bale.""
   Transform the SPARQL query to a natural language question. Output just the transformed question [/ ][/inst]Was Christian Bale in the movie Batman Begins?

----  End ----  Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q1163220 wdt:P50 ?uri . }   Where:  wd:Q1163220 has human-readable name ""Pulp Fiction.""  wdt:P50 has human-readable name ""composer.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//i]Who composed the music for Pulp Fiction?

 ---- End Example ----  Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?sub WHERE { wd:Q2685 wdt:P279 ?sub . }   Where:  wd:Q2685 has human-readable name ""Easter Island.""  wdt:P279 has human-readable name ""island part of.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//INST]Which island is Easter Island part of?

 ---- Start Example ----  Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) AS ?uri) WHERE { ?uri wdt:P114 wd:Q189709 . }   Where:  wdt:P114 has human-readable name ""airline alliance.""  wd:Q189709 has human-readable name ""Star Alliance.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//insight]How many airlines are members of the Star Alliance?

 ---- End Example ----  Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT (COUNT(DISTINCT ?uri) as ?c) WHERE { ?uri wdt:P106 wd:Q33999 . }   Where:  wdt:P106 has human-readable name ""occupation.""  wd:Q33999 has human-readable name ""actor.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//insight]How many actors are there?

----  End ----  Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q426184 wdt:P31/wdt:P279* wd:Q8054 . }   Where:  wd:Q426184 has human-readable name ""Prokhorov, Mikhail.""  wdt:P31 has human-readable name ""instance of.""  wdt:P279 has human-readable name ""subclass of.""  wd:Q8054 has human-readable name ""billionaire.""  Transform the SPARQL query to a natural language question. Output just the transformed question [/
] Mikhail Prokhorov is a billionaire?

-- Examples:  -- ---- Start Example ----  -- Having a SPARQL query: PREFIX wd: <http://www.wikidata.org/entity/> PREFIX wdt: <http://www.wikidata.org/prop/direct/> SELECT DISTINCT ?o1 WHERE { ?o1  wdt:P26  wd:Q39321 ;  wdt:P31  wd:Q13163083 . }   Where:  wdt:P26 has human-readable name ""performer.""  wd:Q39321 has human-readable name ""Neil Armstrong.""  wdt:P31 has human-readable name ""instance of.""  wd:Q13163083 has human-readable name ""space program.""  Transform the SPARQL query to a natural language question. Output just the transformed question [/
]Which astronauts did Neil Armstrong play in movies?

-- Examples:  -- ---- Start Example ----  -- Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q121216 wdt:P50 ?track . ?track wdt:P162 ?uri . }   Where:  wd:Q121216 has human-readable name ""The Wall.""  wdt:P50 has human-readable name ""title.""  wdt:P162 has human-readable name ""producer.""  Transform the SPARQL query to a natural language question. Output just the transformed question [/
]Who are the producers of the album Wall by Pink Floyd?

Affected SPARQL query: ASK WHERE { <http://www.wikidata.org/entity/Q91> <http://www.wikidata.org/prop/direct/P26> ?spouse . ?spouse <http://www.w3.org/2000/01/rdf-schema#label> ""Mary"" . }  

------------

--  End of Example 2  ----------------------------------  Having a SPARQL query: PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q237072 wdt:P1113 ?newNumOfMoves . wd:Q2367132 wdt:P1113 ?oldNumOfMoves . FILTER (?newNumOfMoves > ?oldNumOfMoves) }   Where:  wd:Q237072 has human-readable name ""Bishop.""  wdt:P1113 has human-readable name ""number of moves.""  wd:Q2367132 has human-readable name ""Rook.""  wdt:P1113 has human-readable name ""number of moves.""  Transform the SPARQL query to a natural language question. Output just the transformed question [//INST]Did Bishop get more moves than Rook?

PREFIX wdt: <http://www.wikidata.org/prop/direct/>  PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?uri WHERE { wd:Q61418 wdt:P36 ?uri . }  -- Optionally: ORDER BY ?uri OFF  -- Offset: 0  -- Limit: 1  --  Transform the SPARQL query to a natural language question output just the transformed question [/
]Who wrote the play ""Inherit the Wind""?[/

 -- ---- Start Example ----  --  Transform the SPARQL query to a natural language question output just the transformed question [/

SELECT DISTINCT ?uri WHERE { ?uri <http://www.wikidata.org/prop/direct/P31> <http://www.wikidata.org/entity/Q7086> . ?uri <http://www.wikidata.org/prop/direct/P17> <http://www.wikidata.org/entity/Q31> . ?uri <http://www.wikidata.org/prop/direct/P1128> ?employees . } ORDER BY DESC(?employees) LIMIT 1   --  Transform the SPARQL query to a natural language question output just the transformed question [/
]Which country has the most inhabitants?[/

-- ---- Start Example ----  --  Transform the SPARQL query to a natural language question output just the transformed question [/

SELECT ?s WHERE { ?s  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q408802> . ?s  <http://www.wikidata.org/prop/direct/P17>  <http://www.wikidata.org/entity/Q1500> . ?s  <http://www.wikidata.org/prop/direct/P1128> ?employees . }  ORDER BY DESC(?employees)  LIMIT 1   -- Offset: 0  Limit: 1  -- Transform the SPARQL query to a natural language question output just the transformed question [/
]Which organization has the most employees?[/

-- ---- Start Example ----  --  Transform the SPARQL query to a natural language question output just the transformed question [/

SELECT DISTINCT ?uri WHERE { <http://www.wikidata.org/entity/Q7633400>  <http://www.wikidata.org/prop/direct/P116>  ?uri . }  -- Optionally: ORDER BY ?uri OFF  -- Offset: 0  -- Limit: 1  --  Transform the SPARQL query to a natural language question output just the transformed question [/
]Which day of the week is World Tune Day?    -- ---- End Example ----  --  Transform the SPARQL query to a natural language question output just the transformed question [/

Remark: In this example the example query has an error: The variable used in the SELECT clause should be ?o1 instead of ?o. With this corrected the example becomes valid."	Give me all actors starring in Last Action Hero.	en	perevalov/Mistral-7B-instruct-v0.2-SPARQL2NL	ONE_SHOT	SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q858840>  <http://www.wikidata.org/prop/direct/P161>  ?o1 .  } 
413	"---- Start Example ---- 
 Having a SPARQL query: SELECT (COUNT(DISTINCT ?uri) as ?count) WHERE {  ?uri <http://www.wikidata.org/prop/direct/P57> <http://www.wikidata.org/entity/Q315484> . } 
 Where:
 http://www.wikidata.org/prop/direct/P57 has human-readable name ""director.""
 http://www.wikidata.org/entity/Q315484 has human-readable name ""Park Chan-wook.""
 Transform the SPARQL query to a natural language question. Output just the transformed question. How many movies did Park Chan-wook direct? 
 ----End Example ---- 
Having a SPARQL query: SELECT ?o1 WHERE {   <http://www.wikidata.org/entity/Q339>  <http://www.wikidata.org/prop/direct/P61>  ?o1 .   ?o1  <http://www.wikidata.org/prop/direct/P31>  <http://www.wikidata.org/entity/Q5> .  }  
 Where:
 http://www.wikidata.org/entity/Q339 has human-readable name ""Pluto.""
 http://www.wikidata.org/prop/direct/P61 has human-readable name ""discoverer or inventor.""
 http://www.wikidata.org/prop/direct/P31 has human-readable name ""instance of.""
 http://www.wikidata.org/entity/Q5 has human-readable name ""human.""
 Transform the SPARQL query to a natural language question. Output just the transformed question"	"Where are all the country capitals that host a United Nations administration?

